[
  {
    "id": "vig_3244_0_mdd",
    "ground_truth": "mdd",
    "difficulty": "MODERATE",
    "demographics": "34-year-old woman, middle-school teacher, married, two children (ages 6 and 3), lives with spouse and children; no military history; no current legal issues.",
    "clinical_text": "Chief concern: \"I feel like I’m running on fumes and I can’t enjoy anything anymore.\"\n\nHistory of present illness: The patient is a 34-year-old middle-school teacher who presents for evaluation of persistent low mood and loss of interest that began about 7–8 weeks ago after a change in school administration and increased workload. She reports feeling \"down, heavy, and numb\" most days, \"from the moment I wake up,\" with notable irritability: \"I snap at my kids over nothing and then I hate myself for it.\" She describes markedly diminished interest in activities she previously enjoyed (reading novels, cooking, weekend outings): \"I used to look forward to Saturdays—now I just want to stay in bed.\" She endorses fatigue nearly every day and says routine tasks feel overwhelming: \"I’m dragging myself through the day.\"\n\nSleep/appetite: She reports early-morning awakening (waking around 3–4 a.m. and unable to fall back asleep) on most nights and unrefreshing sleep. Appetite has decreased with an unintentional 8–10 lb weight loss over ~2 months: \"Food tastes like cardboard; I forget to eat.\" She denies intentional dieting.\n\nCognition/psychomotor: She reports impaired concentration and indecisiveness at work: \"I read the same email three times and still can’t process it.\" She has received feedback that she seems \"slower\" and less engaged in meetings. On interview she appears mildly slowed with reduced spontaneous speech, though she is cooperative and fully oriented.\n\nGuilt/worthlessness: She endorses excessive guilt and feelings of worthlessness: \"I’m a bad mom and a bad teacher. Everyone would be better off without me.\" She ruminates at night about mistakes and perceives herself as \"a burden\" to her spouse.\n\nSuicidality: She reports intermittent passive thoughts of death over the past 2–3 weeks: \"Sometimes I think it would be easier not to wake up.\" She denies a current plan or intent and denies preparatory behaviors. She denies past suicide attempts or self-injury. Protective factors include strong attachment to her children and willingness to seek help. She agrees to seek emergency support if thoughts intensify.\n\nAnxiety/somatic features (non-standard/mild comorbidity): She reports increased muscle tension, headaches, and two brief episodes in the last month of sudden intense anxiety with palpitations and shortness of breath lasting about 10 minutes, occurring while driving to work; she worried she was \"having a heart problem\" but symptoms resolved spontaneously. She now feels anticipatory worry before commuting but continues to drive. She denies avoidance of leaving home or fear of multiple settings.\n\nFunctioning: Symptoms have caused clinically significant impairment. She has used four sick days in the last month, is behind on grading, and reports reduced patience with students. At home she has withdrawn socially, turning down invitations and spending evenings on the couch. Her spouse reports she is \"not herself\" and less emotionally responsive.\n\nPast psychiatric history: No prior psychiatric hospitalizations. She recalls a shorter period of low mood in college that resolved without treatment. No history of elevated/expansive mood, decreased need for sleep with high energy, increased goal-directed activity, grandiosity, pressured speech, or risky behavior suggestive of manic/hypomanic episodes.\n\nMedical history/medications: Generally healthy. No thyroid disease history. Denies recent infection, pregnancy, or postpartum state. Takes an occasional ibuprofen for headaches. No corticosteroid use. No known medication allergies.\n\nSubstance use: Drinks wine \"most nights,\" typically 1–2 glasses; on two weekends in the last month she had 3–4 drinks at social events. Denies morning drinking, blackouts, withdrawal symptoms, or occupational consequences. Denies tobacco, cannabis, or other substances. Caffeine 2–3 coffees/day.\n\nFamily history: Mother with history of recurrent episodes of low mood treated with antidepressants. Maternal uncle with alcohol-related problems. No known family history of bipolar disorder or psychotic disorders.\n\nMental status exam (summary): Appearance appropriate, mildly disheveled; behavior cooperative; psychomotor mild retardation; speech soft, slowed; mood \"exhausted and sad\"; affect constricted; thought process linear; thought content notable for guilt and passive death wishes without plan/intent; no delusions; no hallucinations; cognition intact to orientation; attention mildly impaired; insight and judgment fair.\n\nAssessment considerations: Symptoms have persisted >2 weeks with depressed mood and markedly diminished interest plus neurovegetative changes (sleep, appetite/weight), fatigue, impaired concentration, psychomotor slowing, excessive guilt/worthlessness, and passive suicidal ideation, causing significant impairment. No evidence of a manic/hypomanic episode. Symptoms are not better explained by substance intoxication/withdrawal or a medical condition based on current history, though basic labs (e.g., TSH, CBC) are planned to rule out contributory medical causes.",
    "symptom_checklist": {
      "depressed_mood_most_of_day_nearly_every_day": "present",
      "markedly_diminished_interest_or_pleasure": "present",
      "significant_weight_loss_or_decreased_appetite": "present",
      "insomnia_or_hypersomnia": "present",
      "psychomotor_retardation_or_agitation_observable": "present",
      "fatigue_or_loss_of_energy": "present",
      "feelings_of_worthlessness_or_excessive_guilt": "present",
      "diminished_ability_to_think_or_concentrate_indecisiveness": "present",
      "recurrent_thoughts_of_death_or_suicidal_ideation": "present",
      "clinically_significant_distress_or_impairment": "present",
      "manic_or_hypomanic_episode_history": "absent",
      "substance_induced_or_medical_condition_primary_cause": "absent",
      "psychotic_features": "absent",
      "panic_attack_like_episodes": "present"
    }
  },
  {
    "id": "vig_3349_2_adhd",
    "ground_truth": "adhd",
    "difficulty": "MODERATE",
    "demographics": "29-year-old woman; works as a project coordinator at a mid-sized marketing firm; lives with partner; completed college; no children; drives; drinks 1–2 alcoholic drinks/week; no tobacco; occasional cannabis edible (1–2x/month).",
    "clinical_text": "Chief concern: “My brain feels like a web browser with 30 tabs open, and I can’t keep the right one in front.”\n\nHistory of present illness: The patient presents for evaluation of chronic difficulties with sustained attention, organization, and time management that have become more impairing after a recent promotion requiring more self-directed work. She reports frequent missed details and inconsistent follow-through despite strong intent: “I’ll read an email, think I responded, then realize two days later I never hit send.” She describes starting multiple tasks and shifting between them, often leaving projects half-completed until deadlines are imminent. She notes she relies on “panic mode” to finish work and then feels exhausted and embarrassed.\n\nInattention-related symptoms described: She reports (1) frequent careless mistakes (incorrect attachments, mis-typed dates, overlooked line items), (2) difficulty sustaining focus during meetings unless she is actively taking notes, (3) appearing not to listen when spoken to—partner says she “zones out” mid-conversation, (4) failure to follow through on instructions and routine administrative tasks (expense reports, calendar invites), (5) disorganization (cluttered desk, multiple unsorted to-do lists, trouble breaking projects into steps), (6) avoidance of tasks requiring sustained mental effort (e.g., budgeting, long reports), (7) losing items (badge, keys, earbuds; uses tracking tags but still misplaces them), (8) distractibility by external stimuli and internal thoughts (“If Slack pings, I’m gone”), and (9) forgetfulness in daily activities (missed appointments unless reminded; late bill payments).\n\nHyperactivity/impulsivity-related symptoms described: She denies feeling “physically hyper” most of the day but endorses restlessness (shifts position, fidgets with pens, taps foot), difficulty staying seated through long meetings, and frequent interrupting in conversations when excited: “If I don’t say it right away, I’ll lose it.” She also describes occasional impulsive online purchases (“little dopamine buys”) but without major financial harm.\n\nCourse and age of onset: She reports these patterns began in childhood. She recalls elementary school teachers writing comments such as “bright but daydreams,” “forgets homework,” and “talks too much with friends.” Her mother reportedly had to pack her backpack nightly and bring forgotten items to school. She states she often completed assignments at the last minute and relied on high test performance to compensate. She denies any period of sustained symptom remission. Symptoms are present in multiple settings: work (missed deadlines, performance feedback for “inconsistency” and “not following through”), home (unfinished chores, forgotten plans, conflict with partner about not listening), and driving (missed exits; distracted by thoughts though no accidents).\n\nFunctional impact: At work, she has received a formal warning after missing a client deliverable and forgetting to add a meeting time-zone conversion, resulting in a no-show. She reports spending evenings “trying to catch up” but becoming overwhelmed and then procrastinating. At home, she describes chronic clutter, difficulty maintaining routines, and arguments with her partner who feels “unheard.” She reports low self-esteem tied to perceived underachievement: “I feel lazy, but I’m actually trying all the time.”\n\nAssociated features / mild comorbidity: She reports chronic sleep-onset difficulty (mind racing, late-night scrolling) and variable sleep schedule; she often feels tired in the mornings. She endorses intermittent anxiety secondary to performance concerns (“I worry I’ll mess up again”), but denies persistent excessive worry across most domains. She denies panic attacks. Mood is described as “frustrated and ashamed,” with no sustained depressive episode symptoms; appetite stable. She denies suicidal ideation, self-harm, or history of mania/hypomania. No psychotic symptoms.\n\nSubstance and medical history: Caffeine 2–3 cups of coffee/day; notes it sometimes “helps me focus.” Rare cannabis edible use; denies other substances. No history of traumatic brain injury or seizures. No known thyroid disease. Medications: none. Allergies: none.\n\nFamily/developmental history: Father described as “very distractible” and chronically late; no formal diagnoses known. No developmental delays reported; met early milestones. Academic history notable for strong standardized test scores but chronic missing assignments and “messy” work.\n\nMental status exam: Well-groomed, cooperative, mildly restless in chair with frequent fidgeting. Speech normal rate/volume; occasionally tangential but redirectable. Mood “stressed”; affect mildly anxious, congruent. Thought process generally linear with occasional topic shifts. No delusions or hallucinations. Cognition grossly intact; attention during interview variable—asks for questions to be repeated once and checks phone impulsively but puts it away when asked. Insight and judgment fair.\n\nRisk assessment: Denies suicidal or homicidal ideation. No acute safety concerns.\n\nClinical impression (descriptive): Longstanding, pervasive pattern of attentional dysregulation and executive function difficulties beginning in childhood, persisting into adulthood, impairing occupational and relational functioning, with mild situational anxiety and sleep dysregulation likely exacerbating symptom severity. No evidence of a primary mood, psychotic, or substance-induced disorder accounting for the presentation.",
    "symptom_checklist": {
      "IA1_careless_mistakes": "present",
      "IA2_difficulty_sustaining_attention": "present",
      "IA3_seems_not_listen": "present",
      "IA4_fails_follow_through": "present",
      "IA5_disorganized": "present",
      "IA6_avoids_sustained_effort": "present",
      "IA7_loses_things": "present",
      "IA8_easily_distracted": "present",
      "IA9_forgetful": "present",
      "HI1_fidgets": "present",
      "HI2_leaves_seat": "absent",
      "HI3_restless": "present",
      "HI4_unable_play_quietly": "absent",
      "HI5_on_the_go": "absent",
      "HI6_talks_excessively": "absent",
      "HI7_blurts_out": "present",
      "HI8_difficulty_waiting_turn": "absent",
      "HI9_interrupts_intrudes": "present",
      "onset_before_12": "present",
      "impairment_two_or_more_settings": "present",
      "clinically_significant_impairment": "present",
      "sleep_onset_insomnia_mild": "present",
      "situational_performance_anxiety_mild": "present",
      "substance_induced_explanation": "absent",
      "bipolar_manic_history": "absent",
      "psychosis_history": "absent"
    }
  }
]
