[
  {
    "id": "vig_000_mdd_clear_781b6de5",
    "ground_truth": [
      "mdd"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n64-year-old retired teacher presents with \"I can't shake this sadness and I don't want to do anything anymore.\"\n\n2. HISTORY OF PRESENT ILLNESS\nSymptoms began approximately three weeks ago after the death of a close friend. Patient reports \"I wake up empty and cry for no reason\" and \"I don't care about my garden or my knitting anymore.\" She describes pervasive low mood most of each day, nearly every day. Reports marked loss of interest: stopped attending weekly bridge club and has not cooked meals for two weeks. Appetite decreased with an unintentional 6% weight loss over the past month; she reports eating one small meal per day. Sleep is fragmented: falling asleep at 2–3 AM and rising at 6 AM, with frequent nocturnal awakenings. Observed psychomotor retardation: patient walked slowly into clinic, sat with minimal spontaneous movement, and spoke in a low, slowed voice. Endorses fatigue \"I feel like I have no energy to get up,\" near-daily. Expresses pervasive worthlessness: \"I am useless and a burden,\" nearly every day. Reports diminished concentration and indecisiveness — missed medication refills and bills unpaid because she \"can't focus.\" States recurrent thoughts of death: \"I think about dying a lot,\" but explicitly states she has no specific plan and no current intent.\n\nPERTINENT NEGATIVES\nDenies current intent to act on thoughts of death. Denies visual or auditory perceptual experiences. Denies homicidal ideation. Denies recent recreational drug use beyond occasional cannabis months ago.\n\nDURATION\nSymptoms present for approximately 3 week(s); began about three weeks ago.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history. No prior hospitalizations for mood or safety concerns.\n\n4. FAMILY HISTORY\nMother had long-standing mood-related complaints; father died of myocardial infarction.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nHypertension, osteoarthritis. Substance use: drinks wine 1–2 times per week (1–2 glasses), no regular recreational drug use, caffeine 1 cup coffee per morning. Labs: TSH normal, metabolic panel unremarkable, toxicology negative. Medications: lisinopril 10 mg daily, acetaminophen as needed.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: older woman, disheveled, weight loss evident. Behavior: psychomotor retardation, delayed responses. Speech: low volume, slowed rate. Mood: subjectively \"sad, empty.\" Affect: constricted, tearful during interview. Thought process: slowed, goal-directed but ruminative. Thought content: pervasive feelings of worthlessness and recurrent thoughts of death; denies intent or plan. Perceptions: denies hallucinations. Insight: limited — recognizes change but attributes it to \"getting old.\"",
    "answers": {
      "age": 64,
      "mdd_a1": "present",
      "mdd_a2": "present",
      "mdd_a3": "present",
      "mdd_a4": "present",
      "mdd_a5": "present",
      "mdd_a6": "present",
      "mdd_a7": "present",
      "mdd_a8": "present",
      "mdd_a9": "present",
      "mdd_exc_substance": "cleared",
      "mdd_exc_medical": "cleared",
      "mdd_exc_psychotic": "cleared",
      "mdd_exc_bipolar": "cleared",
      "mdd_subj_clinical_significance": "met",
      "duration_days": 21
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 394
    }
  },
  {
    "id": "vig_001_gad_clear_56bb4469",
    "ground_truth": [
      "gad"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n\"33-year-old graphic designer presents with \"I can't stop worrying; it's ruining my sleep and making me mess up at work.\"\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports a roughly 6-month history of pervasive, excessive worry about multiple domains, primarily work performance and future events, beginning approximately July 2025. Patient states, \"I replay meetings in my head and worry about every detail for days,\" and \"I go to bed exhausted but my mind won't shut off.\" Worry occurs more days than not, is difficult for the patient to control, and focuses on fear of making mistakes, being judged, and minor logistic problems (e.g., missing deadlines, being late to meetings). Patient describes feeling \"on edge\" and restless, reporting frequent fidgeting at the desk and inability to relax. Reports being easily fatigued despite no change in physical workload. Concentration is impaired with episodes of mind going blank during presentations; patient notes recent mistakes in design files and missed emails. Irritability has increased: patient describes snapping at partner and colleagues over small issues. Muscle tension reported as persistent neck and shoulder tightness relieved only by brief stretching. Sleep disrupted with difficulty falling asleep, frequent nocturnal awakenings, and nonrestorative sleep; patient averages 4–5 hours per night and reports daytime tiredness. Two direct quotes above. Pertinent negatives: Denies suicidal ideation, denies homicidal ideation, denies hallucinations or hearing voices, denies fixed false beliefs.\n\nDURATION: Symptoms present for approximately 6 month(s). Began in July 2025.\n\nFUNCTIONAL IMPACT\n- Work: Decreased productivity; missed deadlines; errors in routine tasks; avoidance of leading meetings; increased sick leave.\n- Relationships: Increased conflict with partner; social withdrawal from friends; irritability during family interactions.\n- Daily activities: Difficulty concentrating on household tasks; reduced exercise; daytime fatigue limits errands and leisure.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history; no previous psychiatric medications or hospitalizations.\n\n4. FAMILY HISTORY\nMother had treatment for chronic worry and sleep problems; no known hospitalizations in family.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nNo chronic medical conditions reported. Substance use: alcohol 1–2 drinks socially on weekends; denies recreational drug use; caffeine intake 2–3 cups coffee daily. Labs: TSH normal, metabolic panel unremarkable, toxicology negative. Medications: oral contraceptive; occasional OTC melatonin for sleep.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: well-groomed, appropriate dress. Behavior: cooperative, fidgety, repeatedly adjusts seating. Speech: rate and volume within normal limits, slightly pressured when discussing worries. Mood (subjective): \"worried and tired.\" Affect (observed): tense, constricted range. Thought process: linear but ruminative, preoccupied with work-related concerns. Cognition: oriented to person, place, time; attention fluctuates; recent memory recall adequate on testing. Insight: acknowledges symptoms and willingness to seek help.",
    "answers": {
      "age": 33,
      "gad_a": "present",
      "gad_b": "present",
      "gad_c1": "present",
      "gad_c2": "present",
      "gad_c3": "present",
      "gad_c4": "present",
      "gad_c5": "present",
      "gad_c6": "present",
      "gad_exc_substance": "cleared",
      "gad_exc_medical": "cleared",
      "gad_exc_panic": "cleared",
      "gad_exc_social_anxiety": "cleared",
      "gad_exc_ocd": "cleared",
      "gad_exc_separation": "cleared",
      "gad_exc_ptsd": "cleared",
      "gad_exc_anorexia": "cleared",
      "gad_exc_somatic": "cleared",
      "gad_exc_bdd": "cleared",
      "gad_exc_illness_anxiety": "cleared",
      "gad_exc_psychotic": "cleared",
      "gad_subj_clinical_significance": "met",
      "gad_subj_excessive": "met",
      "duration_days": 187
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 433
    }
  },
  {
    "id": "vig_002_adhd_moderate_669f053d",
    "ground_truth": [
      "adhd"
    ],
    "difficulty": "MODERATE",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n31-year-old project manager presents with \"I kind of miss details and get distracted all the time\" and \"I sometimes just get up and walk around when I should be at my desk.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports symptoms present for approximately 6 month(s); began about 6 months ago. States these difficulties first appeared around age 5. Describes frequent careless errors at work: \"I overlook numbers in reports and my spreadsheets have mistakes,\" and reports colleagues point out missed details. Reports often not seeming to listen when spoken to: \"People will be talking and my mind's kind of elsewhere, even if nothing obvious is going on.\" Describes chronic difficulty organizing tasks and time management: missed deadlines, messy project files, difficulty keeping sequential steps straight; \"I have a hard time keeping my desk and digital folders in order, and I kind of put things off.\" Reports avoidance of tasks requiring sustained mental effort (long reports, forms), and frequent loss of items needed for tasks (keys, phone chargers, printed documents). Notes being easily distracted by external stimuli and intrusive thoughts. Describes leaving her seat in meetings when she feels restless: \"Sometimes I just get up and walk around the room.\" Reports inability to remain quiet during leisure activities and occasional blurting out answers or comments in meetings; \"I sometimes finish people's sentences or jump in before it's my turn.\" Reports difficulty waiting in lines and interrupting others. Denies episodes of similar severity previously.\n\nPertinent negatives: Denies often having difficulty sustaining attention in tasks or play activities. Denies often not following through on instructions and failing to finish tasks due to being sidetracked. Denies being often forgetful in daily activities. Denies often fidgeting with or tapping hands or feet or squirming in seat.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\n4. FAMILY HISTORY\nMother reported to have lifelong concentration difficulties; no known psychiatric hospitalizations in first-degree relatives.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nNo chronic medical conditions reported. Alcohol: 1–2 drinks on weekends. Recreational drugs: denies current use. Caffeine: 2–3 cups coffee daily.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, well-groomed. Behaviour: frequently shifts posture and stood briefly during interview; no repetitive tapping observed. Speech: normal rate and volume. Mood: describes as \"frustrated\" and \"tired of making errors.\" Affect: congruent, reactive. Thought process: linear but occasionally interrupts interviewer with examples. Thought content: no delusional ideas reported. Perceptions: no hallucinations reported. Insight: partial—recognizes problems but attributes to stress and poor organization rather than a medical explanation.",
    "answers": {
      "age": 31,
      "adhd_a1a": "present",
      "adhd_a1b": "absent",
      "adhd_a1c": "present",
      "adhd_a1d": "absent",
      "adhd_a1e": "present",
      "adhd_a1f": "present",
      "adhd_a1g": "present",
      "adhd_a1h": "present",
      "adhd_a1i": "absent",
      "adhd_a2a": "absent",
      "adhd_a2b": "present",
      "adhd_a2c": "present",
      "adhd_a2d": "present",
      "adhd_a2e": "absent",
      "adhd_a2f": "absent",
      "adhd_a2g": "present",
      "adhd_a2h": "present",
      "adhd_a2i": "present",
      "adhd_exc_psychotic": "cleared",
      "adhd_exc_mood": "cleared",
      "adhd_exc_anxiety": "cleared",
      "adhd_exc_dissociative": "cleared",
      "adhd_exc_personality": "cleared",
      "adhd_exc_substance": "cleared",
      "adhd_subj_functional_impairment": "met",
      "adhd_subj_developmental": "met",
      "adhd_subj_not_oppositional": "met",
      "duration_days": 187,
      "onset_age": 5
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 418
    }
  },
  {
    "id": "vig_003_ptsd_moderate_c9168724",
    "ground_truth": [
      "ptsd"
    ],
    "difficulty": "MODERATE",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n35-year-old elementary school teacher presents with \"I can't stop seeing it and it's messing with my head.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports onset approximately 1 month ago after witnessing a multi-vehicle collision on her commute. She describes watching injured people and emergency responders on scene and \"being there watching them hurt\" rather than being hit herself. \"Sometimes I feel like I'm back there for a minute,\" she says, describing brief dissociative reactions in which she feels and acts as if the event is recurring (eyes glaze, pauses mid-sentence). She reports avoiding the stretch of road where the crash occurred, avoiding conversations about car accidents, and asking others to drive when possible: \"I kind of steer clear of that street now.\" She endorses a persistent negative mood—\"on edge, guilty, ashamed a lot of the time\"—and difficulty feeling pleasure or satisfaction in activities she previously enjoyed. Colleagues note increased irritability and several verbal outbursts at work over minor frustrations. She reports trouble concentrating at work over the past month and has missed two partial days due to feeling \"distracted and wiped out.\"\n\nPERTINENT NEGATIVES\nDenies directly experiencing the traumatic event(s). Denies learning that the traumatic event(s) occurred to a close family member or close friend. Denies repeated or extreme exposure to aversive details of the event(s) through work. Denies recurrent, involuntary, and intrusive distressing memories of the event(s). Denies recurrent distressing dreams related to the event(s). Denies intense or prolonged psychological distress at exposure to internal or external cues that symbolize the event(s). Denies marked physiological reactions to such cues. Denies avoidance of memories, thoughts, or feelings about the event(s).\n\nDURATION\nSymptoms present for approximately 1 month, beginning immediately after witnessing the collision.\n\nFUNCTIONAL IMPACT\nWork: Reduced concentration, missed partial workdays, difficulty completing lesson planning. Relationships: Increased irritability with partner and children, withdrawing from social invitations. Daily activities: Avoids driving on certain routes, reduced participation in hobbies, difficulty sleeping.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\n4. FAMILY HISTORY\nMother treated in the past for mood-related problems.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nOccasional alcohol (1–2 drinks/week), denies recreational drug use, drinks 2–3 cups coffee/day. TSH normal. Metabolic panel unremarkable. Toxicology negative. Medications: none prescription; occasional ibuprofen.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, mildly disheveled. Behavior: cooperative, occasional dissociative pause. Mood: \"on edge, kind of numb.\" Affect: restricted, congruent. Thought content: denies suicidal ideation, no plan or intent; protective factors include children and job responsibilities. Cognition: oriented ×3, concentration decreased. Insight: limited to moderate.",
    "answers": {
      "age": 35,
      "ptsd_a1": "absent",
      "ptsd_a2": "present",
      "ptsd_a3": "absent",
      "ptsd_a4": "absent",
      "ptsd_b1": "absent",
      "ptsd_b2": "absent",
      "ptsd_b3": "present",
      "ptsd_b4": "absent",
      "ptsd_b5": "absent",
      "ptsd_c1": "absent",
      "ptsd_c2": "present",
      "ptsd_d1": "absent",
      "ptsd_d2": "absent",
      "ptsd_d3": "absent",
      "ptsd_d4": "present",
      "ptsd_d5": "absent",
      "ptsd_d6": "absent",
      "ptsd_d7": "present",
      "ptsd_e1": "present",
      "ptsd_e2": "absent",
      "ptsd_e3": "absent",
      "ptsd_e4": "absent",
      "ptsd_e5": "present",
      "ptsd_e6": "absent",
      "ptsd_exc_substance": "cleared",
      "ptsd_exc_medical": "cleared",
      "ptsd_exc_dissociative_substance": "cleared",
      "ptsd_exc_dissociative_medical": "cleared",
      "ptsd_subj_distress": "met",
      "ptsd_subj_trauma_quality": "met",
      "ptsd_subj_violent_accidental": "met",
      "duration_days": 37
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 420
    }
  },
  {
    "id": "vig_004_ptsd_preschool_clear_c0891da1",
    "ground_truth": [
      "ptsd_preschool"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n3-year-old child brought by mother who reports \"He is different since the house incident—he won't stop replaying it\" and \"He has bad dreams and won't sleep without me.\"\n\n2. HISTORY OF PRESENT ILLNESS\nMother reports symptoms began approximately 1 month ago after an acute household incident in early December 2025. \"He saw us get hurt and then he learned that I was hurt too,\" mother states. Caregiver describes frequent repetitive play that reenacts the event, repeated verbalizations of brief phrases heard during the incident, and sudden freezing episodes. \"He will suddenly stop and stare, then put the toys in the same pattern over and over,\" and \"Some nights he screams in his sleep and wakes up crying but won't tell me why.\" Mother reports increased clinginess, multiple daily intense temper outbursts with hitting and throwing objects, and refusal to go to the familiar backyard or the car where the incident occurred. Eating has decreased; there is nighttime waking requiring caregiver soothing. Toileting had been toilet-trained but there have been a few daytime accidents over the past 2 weeks. No prior similar episodes.\n\n3. DEVELOPMENTAL HISTORY\nWalked at 12 months, uses multiword phrases and vocabulary appropriate for age, follows simple directions, independent with most self-care for age. No prior developmental evaluations. Language and motor development reported as developmentally appropriate.\n\n4. FAMILY HISTORY\nMother reports a history of mental health treatment in a first-degree relative; father reports no known history.\n\n5. MEDICAL HISTORY\nFull-term vaginal birth without complications. No chronic medical conditions. No current prescriptions; uses occasional acetaminophen for minor illnesses. Recent upper respiratory infection resolved 3 weeks ago. Substance use: mother reports drinks alcohol socially (1–2 times/month), no recreational drug use in caregivers, minimal caffeine use. Labs: TSH normal, metabolic panel unremarkable, toxicology negative.\n\nPertinent negatives: Caregiver denies child talking about wanting to die or harm self; caregiver denies intentionally hurting others beyond temper outbursts; caregiver denies loss of previously acquired language.\n\n6. BEHAVIOURAL OBSERVATIONS / MENTAL STATUS EXAMINATION\nChild appeared disheveled but physically well groomed for age; clung to mother on arrival, required permitting mother to remain in room. Eye contact intermittent; engaged in play but repeatedly reenacted a specific event with toy figures, lining them up and making repetitive noises. Affect tearful at times, flat during reenactment play, fearful when approached toward the door. Play was constricted and repetitive, centered on the incident; no spontaneous imaginative play observed. Startle response exaggerated to loud noises. Separation from caregiver produced crying and refusal to cooperate with brief tasks. Speech age-appropriate in vocabulary but often limited to short repetitive phrases referencing the event. Motor activity hypervigilant with scanning the room. Attention fluctuated with easy distractibility. Sleep disrupted per caregiver; appetite decreased; brief regression in toileting noted.\n\nDURATION: Symptoms present for approximately 1 month, beginning early December 2025.\n\nFUNCTIONAL IMPACT\nRelationships: Increased clinginess with mother, irritability toward father and sibling during play, frequent conflicts at home. Peer/play: Withdrawn from parallel play, limited reciprocal play, obsessions with reenactment interfere with play with peers. Preschool/home routines: Refusal to enter car or backyard, difficulty participating in routine activities, frequent disruptions to family schedule. Sleep/eating/toileting: Frequent night awakenings with screaming, decreased appetite, recent daytime toileting accidents.",
    "answers": {
      "age": 3,
      "ptsd_a1_child": "present",
      "ptsd_a2_child": "present",
      "ptsd_a3_child": "present",
      "ptsd_b1_child": "present",
      "ptsd_b2_child": "present",
      "ptsd_b3_child": "present",
      "ptsd_b4_child": "present",
      "ptsd_b5_child": "present",
      "ptsd_c1_child": "present",
      "ptsd_c2_child": "present",
      "ptsd_c3_child": "present",
      "ptsd_c4_child": "present",
      "ptsd_c5_child": "present",
      "ptsd_c6_child": "present",
      "ptsd_d1_child": "present",
      "ptsd_d2_child": "present",
      "ptsd_d3_child": "present",
      "ptsd_d4_child": "present",
      "ptsd_d5_child": "present",
      "ptsd_exc_substance_child": "cleared",
      "ptsd_exc_medical_child": "cleared",
      "ptsd_exc_dissociative_substance_child": "cleared",
      "ptsd_exc_dissociative_medical_child": "cleared",
      "ptsd_subj_distress_child": "met",
      "ptsd_subj_trauma_quality_child": "met",
      "duration_days": 37
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 534
    }
  },
  {
    "id": "vig_005_asd_clear_0d51860e",
    "ground_truth": [
      "asd"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n61-year-old retired accountant presents with \"People don't understand me; I get stuck on the same things and they think I'm rude.\"\n\n2. HISTORY OF PRESENT ILLNESS\nDuration: Symptoms present for approximately 3 weeks (began 3 weeks ago). Onset: Symptoms first appeared around age 7.\nPatient reports a recent increase in longstanding social and behavioral features. \"I used to walk the same route to the store every day and it felt wrong to change,\" he stated. He describes frequent one-sided conversations: when asked about his day he launches into detailed timetables of buses and is slow to respond to questions. He reports limited sharing of feelings — \"I don't usually tell people how I feel\" — and becomes visibly irritated when others attempt to engage in emotional topics. Caregiver reports he avoids reciprocal topics and often fails to ask others about themselves, often returning to his fixed interests.\nHe exhibits restricted interests with intense focus on clocks and schedules, spending hours arranging and recounting times. Repetitive behaviors observed include frequent finger flicking and lining up pens during the interview. He reports distress with changes: when the usual radio station was different last week he became agitated and left the building. He describes heightened sensitivity to certain sounds and textures, covering his ears at high-pitched noises and staring at moving ceiling fans for long periods.\nPertinent negatives: Denies suicidal ideation, homicidal ideation, auditory or visual hallucinations. Denies recent illicit substance use.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\n4. FAMILY HISTORY\nPatient reports a brother described as socially withdrawn and a mother who \"preferred routines\"; no formal diagnoses reported in family.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nHistory of hypertension and hypothyroidism. Current medications: lisinopril 10 mg daily, levothyroxine 75 mcg daily. Denies current alcohol misuse or illicit drug use; occasional caffeine.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: Well-groomed older male, casually dressed. Behaviour: Repetitive finger flicking, limited spontaneous social gestures, repeatedly rearranged items on the table. Speech: Low volume, monotone at times, literal and pedantic; occasional immediate repetition of phrases. Mood (subjective): \"I get annoyed when things change.\" Affect (observed): Constricted, limited facial expressivity. Thought process: Concrete, perseverative on routines and schedules; no evidence of delusional content. Cognition: Alert and oriented ×3, attention adequate but rigid on abstract questions. Insight: Limited appreciation of social difficulties and impact on relationships.",
    "answers": {
      "age": 61,
      "asd_a1": "present",
      "asd_a2": "present",
      "asd_a3": "present",
      "asd_b1": "present",
      "asd_b2": "present",
      "asd_b3": "present",
      "asd_b4": "present",
      "asd_exc_intellectual_disability": "cleared",
      "asd_subj_impairment": "met",
      "asd_subj_early_onset": "met",
      "asd_subj_severity_social": "met",
      "asd_subj_severity_rrb": "met",
      "duration_days": 21,
      "onset_age": 7
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 392
    }
  },
  {
    "id": "vig_006_mdd_moderate_478bcf34",
    "ground_truth": [
      "mdd"
    ],
    "difficulty": "MODERATE",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n24-year-old graduate student presents with \"I kind of don't enjoy anything anymore, sometimes I just wait to get through the day.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports a 3-week history of markedly reduced interest in nearly all activities. Began approximately 3 weeks ago after a breakup and increased academic demands. Patient: \"I used to go to the climbing gym every week and I haven't gone in two weeks,\" and \"I kind of just stop doing things I usually like.\" Describes pervasive low energy: \"I'm tired most days even if I sleep fine.\" Reports nearly daily feelings of worthlessness: \"I feel useless, like I don't deserve what I have,\" and occasional excessive guilt about perceived personal failures. Notes difficulty concentrating and indecisiveness affecting study: \"I sit with my readings and my mind just drifts; I can't decide what to write.\" Endorses recurrent thoughts of death and passive suicidal ideation without intent or plan: \"Sometimes I think about dying, but I don't have a plan.\" No recent self-harm.\n\nPERTINENT NEGATIVES\nDenies depressed mood most of the day, nearly every day, as reported or observed. Denies significant weight loss or gain or change in appetite nearly every day. Denies insomnia or hypersomnia nearly every day. Denies psychomotor agitation or retardation nearly every day.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history. No prior psychiatric hospitalizations. No prior psychotropic medication trials.\n\n4. FAMILY HISTORY\nMother with history of alcohol use; no known psychiatric hospitalizations in first-degree relatives reported.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nNo chronic medical conditions reported. Alcohol use: drinks socially, 1–2 drinks 1–2×/week. Recreational drugs: denies regular use; tried cannabis occasionally in college. Caffeine: 1–2 cups coffee daily. Labs: TSH normal; metabolic panel unremarkable; toxicology negative. Medications: oral contraceptive; occasional ibuprofen.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, slightly disheveled. Behavior: cooperative but withdrawn. Speech: soft, normal rate. Mood (patient report): \"kind of flat, tired.\" Affect: restricted range, congruent. Thought process: linear but slowed with indecisive responses. Thought content: frequent self-deprecatory statements and passive death ideation; no fixed false beliefs elicited. Perceptions: denies hallucinations. Insight: limited; attributes symptoms to personal failure. Judgment: intact for safety planning; no current plan for self-harm. Functional impact: decreased attendance and productivity at school, withdrawal from friends and partner, difficulty initiating daily tasks (not completing readings, skipping chores).",
    "answers": {
      "age": 24,
      "mdd_a1": "absent",
      "mdd_a2": "present",
      "mdd_a3": "absent",
      "mdd_a4": "absent",
      "mdd_a5": "absent",
      "mdd_a6": "present",
      "mdd_a7": "present",
      "mdd_a8": "present",
      "mdd_a9": "present",
      "mdd_exc_substance": "cleared",
      "mdd_exc_medical": "cleared",
      "mdd_exc_psychotic": "cleared",
      "mdd_exc_bipolar": "cleared",
      "mdd_subj_clinical_significance": "met",
      "duration_days": 21
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 387
    }
  },
  {
    "id": "vig_007_gad_clear_ee9cd60b",
    "ground_truth": [
      "gad"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n40-year-old project manager presents with \"I can't stop worrying and it's ruining my sleep\" and \"I'm exhausted but my brain won't shut off.\"\n\n2. HISTORY OF PRESENT ILLNESS\nSymptoms present for approximately 6 month(s). Began around July 2025 after a promotion and increased workload. Patient reports excessive worry occurring most days about work performance, upcoming meetings, and minor mistakes: \"I think about every email for hours,\" and \"I replay conversations in my head and worry I'll mess up.\" Describes difficulty controlling the worry: even when attempting to distract, worries return within minutes. Reports feeling keyed up and restless, pacing during phone calls and tapping foot in meetings. Endorses marked fatigue despite several hours of sleep; states, \"I'm tired all day and still can't sleep at night.\" Describes difficulty concentrating with frequent blanks during presentations and forgetting simple tasks (missed a deadline last month). Reports increased irritability, snapping at partner over small issues. Describes muscle tension in neck and shoulders with daily headaches and jaw clenching. Sleep disturbance: difficulty falling asleep, multiple nocturnal awakenings, and non-restorative sleep (falls asleep after midnight, wakes 3–4 times nightly). Functional decline noted at work (reduced productivity, missed deadlines), strained relationship with partner (frequent arguments, avoidance of social plans), and decreased ability to complete household tasks.\n\nPertinent negatives: Denies suicidal ideation, denies homicidal ideation, denies perceptual disturbances (hearing or seeing things). Denies recent significant substance misuse.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history. No past psychotherapy or psychiatric medication.\n\n4. FAMILY HISTORY\nMother received counseling in the past for prolonged worry and stress; no hospitalizations reported in family.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nHypertension, on lisinopril 10 mg daily. Alcohol: 1–2 drinks socially on weekends. Recreational drugs: denies use. Caffeine: 2–3 caffeinated coffees/day. Labs: TSH normal, metabolic panel unremarkable, toxicology negative. OTC: ibuprofen PRN, daily multivitamin.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: well-groomed. Behavior: mildly restless, frequent shifting. Speech: normal rate and volume. Mood (subjective): \"anxious and worn out.\" Affect: anxious, congruent with mood. Thought process: linear but preoccupied with worries. Cognition: oriented ×3; attention and concentration reduced with occasional blanking. Insight: recognizes problem and requests help.",
    "answers": {
      "age": 40,
      "gad_a": "present",
      "gad_b": "present",
      "gad_c1": "present",
      "gad_c2": "present",
      "gad_c3": "present",
      "gad_c4": "present",
      "gad_c5": "present",
      "gad_c6": "present",
      "gad_exc_substance": "cleared",
      "gad_exc_medical": "cleared",
      "gad_exc_panic": "cleared",
      "gad_exc_social_anxiety": "cleared",
      "gad_exc_ocd": "cleared",
      "gad_exc_separation": "cleared",
      "gad_exc_ptsd": "cleared",
      "gad_exc_anorexia": "cleared",
      "gad_exc_somatic": "cleared",
      "gad_exc_bdd": "cleared",
      "gad_exc_illness_anxiety": "cleared",
      "gad_exc_psychotic": "cleared",
      "gad_subj_clinical_significance": "met",
      "gad_subj_excessive": "met",
      "duration_days": 187
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 356
    }
  },
  {
    "id": "vig_008_adhd_moderate_db660edb",
    "ground_truth": [
      "adhd"
    ],
    "difficulty": "MODERATE",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n48-year-old project manager presents with \"I'm kind of all over the place lately; I can't seem to keep my mind on things.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports a long-standing pattern of attentional difficulties beginning in childhood, with symptoms first appearing around age 9. Over the past approximately 6 months symptoms have been more persistent and impairing. Patient states, \"I start reading or a report and my mind wanders during the lecture or a long conversation,\" and, \"I start something and then I get sidetracked—it's like I forget what I'm doing.\" Describes often not seeming to listen when spoken to directly; says the mind seems elsewhere even when no obvious distraction is present. Reports frequent failure to follow through on instructions and incomplete work tasks: \"I begin tasks at the office but I quickly lose focus and jump to something else.\" Often loses necessary items (keys, mobile phone, paperwork, reading glasses). Notes being easily distracted by noises and by unrelated thoughts. Reports forgetfulness in daily activities such as returning calls, paying bills, and missing appointments. Describes leaving his seat in meetings or feeling unable to remain still in restaurants; reports feeling restless and \"on the go\" and says, \"I think I talk a lot sometimes and I blurt out answers before people finish the question.\" Timeline: childhood onset with waxing and waning, more continuous impairment over last 6 months affecting work and home routines.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history, no previous medications or psychotherapy reported.\n\n4. FAMILY HISTORY\nPatient reports no known family psychiatric history.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nNo significant medical history; not on chronic medications. Alcohol: 1–2 drinks on social occasions (weekly). Recreational drugs: denies current or past illicit drug use. Caffeine: 2–3 cups of coffee daily.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, well-groomed. Behaviour: cooperative, paced speech and occasional animated gestures. Speech: normal rate and volume, at times more talkative. Mood: \"a bit frustrated.\" Affect: appropriate to content. Thought process: linear with occasional quick shifts to related topics; at times interrupts interviewer to clarify a point. Thought content: denies delusional beliefs. Perceptions: denies hallucinations. Insight: recognizes difficulties and reports desire for strategies to improve functioning.\n\nPERTINENT NEGATIVES\nDenies often failing to give close attention to details or making careless mistakes. Denies difficulty organizing tasks and activities. Denies avoidance or reluctance to engage in tasks requiring sustained mental effort. Denies fidgeting with or tapping hands or feet or squirms in seat.\n\nFUNCTIONAL IMPACT\nWork/academic: Missed deadlines, incomplete reports, decreased productivity, frequent task-switching. Relationships: Spouse and colleagues report impatience, interrupting, and talking over others; conflicts over missed commitments. Daily activities: Misplaced keys/phone, missed appointments, delayed bill payments, difficulty completing household chores.",
    "answers": {
      "age": 48,
      "adhd_a1a": "absent",
      "adhd_a1b": "present",
      "adhd_a1c": "present",
      "adhd_a1d": "present",
      "adhd_a1e": "absent",
      "adhd_a1f": "absent",
      "adhd_a1g": "present",
      "adhd_a1h": "present",
      "adhd_a1i": "present",
      "adhd_a2a": "absent",
      "adhd_a2b": "present",
      "adhd_a2c": "present",
      "adhd_a2d": "absent",
      "adhd_a2e": "present",
      "adhd_a2f": "present",
      "adhd_a2g": "present",
      "adhd_a2h": "absent",
      "adhd_a2i": "present",
      "adhd_exc_psychotic": "cleared",
      "adhd_exc_mood": "cleared",
      "adhd_exc_anxiety": "cleared",
      "adhd_exc_dissociative": "cleared",
      "adhd_exc_personality": "cleared",
      "adhd_exc_substance": "cleared",
      "adhd_subj_functional_impairment": "met",
      "adhd_subj_developmental": "met",
      "adhd_subj_not_oppositional": "met",
      "duration_days": 187,
      "onset_age": 9
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 453
    }
  },
  {
    "id": "vig_009_ptsd_ambiguous_85e6e7b2",
    "ground_truth": [
      "ptsd"
    ],
    "difficulty": "AMBIGUOUS",
    "meets_criteria": true,
    "clinical_text": "31-year-old high school teacher presents with \"I'm okay, it's just been weird\" and \"I don't want to make a big deal of it.\"\n\nHISTORY OF PRESENT ILLNESS\nPatient reports symptoms began approximately 1 month ago after witnessing a violent street altercation in which several bystanders were injured. States, \"I saw them get hurt right in front of me,\" and describes vivid sensory recall of sounds and sights from the scene. Reports marked physiological reactions to internal and external cues: heart racing, sweating, nausea when hearing sirens or passing the street where the event occurred. Describes deliberate attempts to avoid thinking about or talking about the event: \"I just don't bring it up,\" and reports difficulty recalling an important aspect of what occurred immediately after the event — \"there's a gap in my memory around what happened next.\" Reports persistent negative emotions (fear, guilt, occasional anger) and intermittent reckless behavior (recently driving at high speeds at night, occasional heavy drinking episodes). Sleep has been disturbed with trouble falling asleep, multiple awakenings, and restless sleep. Symptoms present for approximately 1 month, began after the witnessed event.\n\nPERTINENT NEGATIVES\nDenies directly experiencing the traumatic event(s). Denies learning that the traumatic event(s) occurred to a close family member or close friend (violent or accidental death). Denies experiencing repeated or extreme exposure to aversive details of the traumatic event(s) (e.g., first responders; not through media unless work-related). Denies recurrent, involuntary, and intrusive distressing memories of the traumatic event(s). Denies recurrent distressing dreams related to the event(s). Denies dissociative reactions in which the event(s) feel recurring. Denies intense or prolonged psychological distress at exposure to cues that symbolize the event(s). Denies avoidance of external reminders (people, places, conversations, activities, objects, situations) that arouse distressing memories about the event(s).\n\nPAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\nFAMILY HISTORY\nMother received psychiatric treatment in past; details unknown.\n\nMEDICAL HISTORY AND SUBSTANCES\nNo chronic medical problems reported. Alcohol: 2–3 drinks on weekends with two recent heavy episodes in past month. Recreational drugs: Denies current use. Caffeine: 2–3 cups coffee daily. Labs: TSH normal; metabolic panel unremarkable; toxicology negative. Medications: No current prescriptions. OTC: multivitamin, ibuprofen PRN.\n\nMENTAL STATUS EXAMINATION\nAppearance: casually dressed, good hygiene. Behaviour: cooperative, occasionally avoids eye contact. Mood: \"anxious and irritated.\" Affect: constricted, reactive to topic of event. Thought content: no current plan for self-harm; endorses brief passive thoughts of not wanting to wake up 1–2 times/week, no active ideation, no intent or plan; protective factors include partner support and future work responsibilities. Cognition: oriented x3; attention mildly impaired at times; reports patchy memory for event. Insight: limited, minimises severity. No psychotic symptoms observed.",
    "answers": {
      "age": 31,
      "ptsd_a1": "absent",
      "ptsd_a2": "present",
      "ptsd_a3": "absent",
      "ptsd_a4": "absent",
      "ptsd_b1": "absent",
      "ptsd_b2": "absent",
      "ptsd_b3": "absent",
      "ptsd_b4": "absent",
      "ptsd_b5": "present",
      "ptsd_c1": "present",
      "ptsd_c2": "absent",
      "ptsd_d1": "present",
      "ptsd_d2": "absent",
      "ptsd_d3": "absent",
      "ptsd_d4": "present",
      "ptsd_d5": "absent",
      "ptsd_d6": "absent",
      "ptsd_d7": "absent",
      "ptsd_e1": "absent",
      "ptsd_e2": "present",
      "ptsd_e3": "absent",
      "ptsd_e4": "absent",
      "ptsd_e5": "absent",
      "ptsd_e6": "present",
      "ptsd_exc_substance": "cleared",
      "ptsd_exc_medical": "cleared",
      "ptsd_exc_dissociative_substance": "cleared",
      "ptsd_exc_dissociative_medical": "cleared",
      "ptsd_subj_distress": "met",
      "ptsd_subj_trauma_quality": "met",
      "ptsd_subj_violent_accidental": "met",
      "duration_days": 37
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 438
    }
  },
  {
    "id": "vig_010_ptsd_preschool_clear_749bbfa3",
    "ground_truth": [
      "ptsd_preschool"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "DEMOGRAPHICS AND CHIEF COMPLAINT\n5-year-old child brought by mother who reports \"He's not himself since the house fire\" and \"He keeps playing the same thing over and over and won't sleep alone.\"\n\nDURATION\nSymptoms present for approximately 1 month, beginning the night of the house fire when the child and mother were in the home and mother was injured.\n\nHISTORY OF PRESENT ILLNESS\nMother reports child was in the room during the event, witnessed mother being hurt, and was told later that mother had been burned. \"He was standing there when it happened,\" she said. Since then mother describes frequent repetition of the event in play: \"He keeps making the toy people cry and burning the house with his cars.\" Mother reports recurrent waking with \"bad dreams\" several nights per week, often finding him sitting up crying. Child has episodes where he suddenly becomes very still and stare‑like for a minute and then seems confused; mother says, \"He looks like he's back in that night.\" He startles at loud noises, refuses to enter the bedroom where smoke alarm sounded, and avoids passing the house on the street where the fire occurred. Eating is decreased, bedtime routines are disrupted with prolonged night wakings, and there has been one instance of daytime toileting accident described as new. Mother reports increased clinginess, frequent tantrums, and withdrawing from previously enjoyed play. \"He used to like the playground, now he hides behind me,\" she said.\n\nDEVELOPMENTAL HISTORY\nWalked by 12–15 months, first words by 12 months, two‑word phrases by 2 years; currently age‑appropriate language and fine/gross motor skills. No prior developmental evaluations.\n\nFAMILY HISTORY\nMother reports longstanding problems with low mood and trouble sleeping; father reports periodic heavy alcohol use.\n\nMEDICAL HISTORY\nFull‑term uncomplicated birth. No chronic medical conditions. No current prescription medications; takes daily multivitamin. Recent illnesses none. Substance use: mother drinks alcohol socially, no recreational drug use; limited caffeine. TSH normal, metabolic panel unremarkable, toxicology negative.\n\nPERTINENT NEGATIVES\nCaregiver denies suicidal ideation or self‑injurious behavior. Caregiver denies prior similar episodes. No loss of gross motor milestones observed. No seizure activity reported.\n\nBEHAVIOURAL OBSERVATIONS / MENTAL STATUS EXAMINATION\nWell‑groomed, age‑appropriate dress. With mother present child alternated between clinging and withdrawing; limited spontaneous eye contact at times. Affect variable: tearful, anxious, occasionally flat. Play during session was constricted and repetitive, reenacting fires and rescue, with limited imaginative variation. Language age‑appropriate, coherent sentences. Startle response noted to hallway noise. Attention intermittent with frequent redirection needed. No aggressive behavior observed during session toward evaluator; caregiver reports increased hitting and yelling at home. Sleep and appetite decreased; one recent daytime toileting accident reported. Gross motor development developmentally appropriate.",
    "answers": {
      "age": 5,
      "ptsd_a1_child": "present",
      "ptsd_a2_child": "present",
      "ptsd_a3_child": "present",
      "ptsd_b1_child": "present",
      "ptsd_b2_child": "present",
      "ptsd_b3_child": "present",
      "ptsd_b4_child": "present",
      "ptsd_b5_child": "present",
      "ptsd_c1_child": "present",
      "ptsd_c2_child": "present",
      "ptsd_c3_child": "present",
      "ptsd_c4_child": "present",
      "ptsd_c5_child": "present",
      "ptsd_c6_child": "present",
      "ptsd_d1_child": "present",
      "ptsd_d2_child": "present",
      "ptsd_d3_child": "present",
      "ptsd_d4_child": "present",
      "ptsd_d5_child": "present",
      "ptsd_exc_substance_child": "cleared",
      "ptsd_exc_medical_child": "cleared",
      "ptsd_exc_dissociative_substance_child": "cleared",
      "ptsd_exc_dissociative_medical_child": "cleared",
      "ptsd_subj_distress_child": "met",
      "ptsd_subj_trauma_quality_child": "met",
      "duration_days": 37
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 440
    }
  },
  {
    "id": "vig_011_asd_clear_8f1d1d0d",
    "ground_truth": [
      "asd"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n45-year-old software engineer presents with \"I don't connect with people and small changes ruin my day.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports longstanding patterns first noted around age 10; current exacerbation began approximately 3 weeks ago after a change in work schedule. States, \"I mostly talk about what I like and people don't answer back,\" and, \"If someone moves my coffee mug I have to put everything back or I get sick to my stomach.\" Describes frequent one-sided conversations about a narrow set of topics (railway timetables, coding algorithms), giving minute detail without checking listener interest. Reports lining up pens in exact order and flipping a coin repeatedly until it \"feels right.\" Describes becoming visibly distressed when routines change: recent example—team meeting moved from Friday to Thursday led to agitation and inability to participate. Reports limited sharing of emotions: \"I know I'm happy but I don't show it,\" and difficulty making friends; prefers solitary activities. Notes sensory sensitivities: covers ears at crowded restaurants because of clattering dishes and is unusually fascinated by spinning ceiling fans, watching them for prolonged periods.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history; no previous psychotherapy or psychotropic medication.\n\n4. FAMILY HISTORY\nFamily history noncontributory; no known family psychiatric history.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nNo significant medical history. Not on any regular medications. Denies tobacco, alcohol, and illicit drug use.\n\n6. PERTINENT NEGATIVES\nDenies suicidal ideation, homicidal ideation, hallucinations, and recent memory loss.\n\n7. MENTAL STATUS EXAMINATION\nAppearance: Well-groomed, casually dressed. Behaviour: Repetitive hand-flapping when anxious, avoided spontaneous social initiation. Speech: Monologal at times, normal rate and volume, limited modulation. Mood (subjective): Reports \"fine\" and \"frustrated by changes.\" Affect (observed): Constricted, limited facial expression, minimal reciprocal smiling. Thought process: Goal-directed but perseverative on narrow topics; occasional echolalic repetition of phrases heard in conversation. Cognition: Alert and oriented x3; attention adequate for testing, intact short-term memory on casual testing. Insight: Limited awareness of social impact of behaviors; acknowledges distress around changes but attributes difficulties to others. Functional impact: Work performance impaired by difficulty with team interactions and disruptions to routine; relationships strained by one-sided communication and lack of shared activities; daily activities affected by ritualized behaviors (time-consuming lining and checking) and sensory avoidance (avoids crowded places).",
    "answers": {
      "age": 45,
      "asd_a1": "present",
      "asd_a2": "present",
      "asd_a3": "present",
      "asd_b1": "present",
      "asd_b2": "present",
      "asd_b3": "present",
      "asd_b4": "present",
      "asd_exc_intellectual_disability": "cleared",
      "asd_subj_impairment": "met",
      "asd_subj_early_onset": "met",
      "asd_subj_severity_social": "met",
      "asd_subj_severity_rrb": "met",
      "duration_days": 21,
      "onset_age": 10
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 377
    }
  },
  {
    "id": "vig_012_mdd_moderate_c7965b9d",
    "ground_truth": [
      "mdd"
    ],
    "difficulty": "MODERATE",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n64-year-old retired schoolteacher presents with \"I've been kind of down most days, can't sleep, and sometimes I think about not being here.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports symptoms began approximately 3 weeks ago after a fall at home and subsequent worry about recovery. States, \"I feel empty a lot of the day, like there's this heaviness,\" and \"I've lost about 12 pounds without trying in the last month.\" Describes sleep change: \"I hardly sleep—I'm up most nights,\" and alternately notes, \"some days I lie around and sleep more than usual.\" Reports daily changes in appetite with decreased intake most days. Observed by spouse to be tearful on several occasions and to move more slowly than usual; patient admits, \"I find myself dragging when I walk and taking longer to get things done.\" Also reports moments of pacing in the evening described as feeling restless. Reports recurrent thoughts of death, stating, \"Sometimes I think about dying, not like a plan, just that I wouldn't mind not waking up,\" and acknowledges occasional fleeting thoughts of self-harm without a specific plan. Symptoms have been present nearly every day for the past ~3 weeks and have waxed and waned in intensity.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\n4. FAMILY HISTORY\nFather died by suicide; no other known family psychiatric treatment.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nHypertension, osteoarthritis. Substance use: drinks 1 glass of wine 2–3 times per week, denies recreational drug use, consumes 2–3 cups of coffee daily. TSH normal. Metabolic panel unremarkable. Toxicology negative. Medications: lisinopril 10 mg daily, acetaminophen as needed; OTC multivitamin.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: older adult, casually dressed, reported 12 lb weight loss. Behaviour: cooperative but slow movements; occasional pacing observed in waiting area. Speech: soft, slow, decreased spontaneous elaboration. Mood: reports feeling \"sad, empty, hopeless at times.\" Affect: constricted, tearful during interview. Thought process: linear but slowed. Thought content: denies fixed false beliefs; expresses recurrent thoughts of death and passive suicidal ideation without plan. Perceptions: denies hallucinations. Insight: limited—patient recognizes change but attributes to aging and recent fall. Denies markedly diminished interest or pleasure in all, or almost all, activities most of the day, nearly every day. Denies fatigue or loss of energy nearly every day. Denies feelings of worthlessness or excessive or inappropriate guilt nearly every day. Denies diminished ability to think or concentrate, or indecisiveness nearly every day.",
    "answers": {
      "age": 64,
      "mdd_a1": "present",
      "mdd_a2": "absent",
      "mdd_a3": "present",
      "mdd_a4": "present",
      "mdd_a5": "present",
      "mdd_a6": "absent",
      "mdd_a7": "absent",
      "mdd_a8": "absent",
      "mdd_a9": "present",
      "mdd_exc_substance": "cleared",
      "mdd_exc_medical": "cleared",
      "mdd_exc_psychotic": "cleared",
      "mdd_exc_bipolar": "cleared",
      "mdd_subj_clinical_significance": "met",
      "duration_days": 21
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 402
    }
  },
  {
    "id": "vig_013_gad_ambiguous_5eb525fe",
    "ground_truth": [
      "gad"
    ],
    "difficulty": "AMBIGUOUS",
    "meets_criteria": false,
    "clinical_text": "DEMOGRAPHICS AND CHIEF COMPLAINT\n46-year-old project manager presents with \"I'm just worrying a lot lately, more than I used to.\"\n\nHISTORY OF PRESENT ILLNESS\nPatient reports a 5-month history of excessive worry and apprehensive expectation about multiple domains, primarily work performance and upcoming evaluations, beginning approximately August 2025. \"I worry about screwing up at work most days,\" and \"I can't turn my brain off sometimes\" are repeated descriptions. Worry occurs on most days and centers on tasks, meetings, and social interactions at the office; also worries about finances and minor health concerns. Patient states they find it difficult to control the worry: \"I try to stop it but it just keeps coming back.\" Minimizes severity and expresses uncertainty about need for treatment: \"It's probably not that bad, I can handle it most days.\" Denies restlessness or feeling keyed up or on edge. Denies being easily fatigued. Denies difficulty concentrating or mind going blank. Denies irritability.\n\nPAST PSYCHIATRIC HISTORY\nNo prior psychiatric history. No prior psychotherapy or psychotropic medication use reported.\n\nFAMILY HISTORY\nPatient reports mother had periods of \"nervousness\" requiring counseling in her 40s; no hospitalizations reported in family.\n\nMEDICAL HISTORY AND SUBSTANCES\nHypertension controlled on lisinopril 10 mg daily. No other chronic medical conditions reported.\nSubstance use: Alcohol 1–2 drinks on weekends; denies recreational drug use; caffeine 2 cups of coffee daily. Labs: TSH normal, metabolic panel unremarkable, toxicology negative. Medications: lisinopril 10 mg PO daily; ibuprofen PRN.\n\nMENTAL STATUS EXAMINATION\nAppearance: well-groomed, dressed appropriately for appointment. Behaviour: cooperative, polite, slight fidgeting of hands. Speech: normal rate, tone, and volume. Mood (subjective): \"a bit worried\" and \"a little stressed.\" Affect (observed): mildly constricted but congruent to reported mood. Thought process: linear, goal-directed. Thought content: preoccupation with future events and performance, no delusional content. Denies suicidal or homicidal ideation. Cognition: oriented x3, attention and recent memory intact on bedside testing. Insight: limited; patient minimizes impairment and unsure about need for intervention.",
    "answers": {
      "age": 46,
      "gad_a": "present",
      "gad_b": "present",
      "gad_c1": "absent",
      "gad_c2": "absent",
      "gad_c3": "absent",
      "gad_c4": "absent",
      "gad_c5": "absent",
      "gad_c6": "absent",
      "gad_exc_substance": "cleared",
      "gad_exc_medical": "cleared",
      "gad_exc_panic": "cleared",
      "gad_exc_social_anxiety": "cleared",
      "gad_exc_ocd": "cleared",
      "gad_exc_separation": "cleared",
      "gad_exc_ptsd": "cleared",
      "gad_exc_anorexia": "cleared",
      "gad_exc_somatic": "cleared",
      "gad_exc_bdd": "cleared",
      "gad_exc_illness_anxiety": "cleared",
      "gad_exc_psychotic": "cleared",
      "gad_subj_clinical_significance": "not_met",
      "gad_subj_excessive": "met",
      "duration_days": 177
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 321
    }
  },
  {
    "id": "vig_014_adhd_clear_02fca76c",
    "ground_truth": [
      "adhd"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n61-year-old accountant presents with \"I can't focus at work and I'm always losing things.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports a roughly 6-month worsening of attention and activity regulation symptoms. DURATION: Symptoms present for approximately 6 month(s). ONSET: Symptoms first appeared around age 10. He states, \"I miss details in spreadsheets — I send reports with wrong totals,\" and, \"I start a task and three things later I'm doing something else.\" Describes difficulty sustaining attention in meetings and while reading long reports: \"I zone out during hour-long meetings and then realize I missed action items.\" Reports frequent careless errors (overlooking line items, incorrect data entry), failure to follow through on tasks (starts reconciliation then abandons it), and poor organization (desk and electronic files described as messy; unable to find invoices). Avoids tasks requiring sustained mental effort, saying he postpones monthly reports and leaves them until the deadline. Often loses keys, phone, paperwork; gives example of missing his wallet before an important client dinner. Is easily distracted by unrelated thoughts and external noises; \"I hear someone cough and my train of thought is gone.\" Reports forgetfulness with bills, returning calls, and appointments. Describes motor restlessness: taps fingers, shifts in chair, leaves his seat during long meetings; feels \"on the go\" and uncomfortable sitting in restaurants. Reports talking a lot in meetings, blurting answers before questions are finished, interrupting coworkers, and difficulty waiting his turn. Two direct quotes: \"I finish people's sentences even when I shouldn't,\" and \"I feel like I'm always in motion.\"\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\n4. FAMILY HISTORY\nFather with cardiovascular disease; no known family history of psychiatric treatment reported.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nMedical history: hypertension. Substance use: alcohol 1–2 glasses wine 2–3 times per week; denies recreational drug use; caffeine approximately 3 cups of coffee daily.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, slightly disheveled. Behaviour: restless, frequent shifting and foot tapping, left seat once during interview. Speech: rapid at times, verbose. Mood: reports \"frustrated and annoyed.\" Affect: congruent, reactive. Thought process: tangential at moments with frequent interruptions and quick topic shifts. Thought content: Denies delusional ideas. Perceptions: Denies hallucinations. Insight: acknowledges problems with attention and organization but minimizes their full impact on work and relationships.\n\nPERTINENT NEGATIVES\nDenies suicidal ideation, self-harm, homicidal ideation, recreational drug use, hallucinations, and delusions.",
    "answers": {
      "age": 61,
      "adhd_a1a": "present",
      "adhd_a1b": "present",
      "adhd_a1c": "present",
      "adhd_a1d": "present",
      "adhd_a1e": "present",
      "adhd_a1f": "present",
      "adhd_a1g": "present",
      "adhd_a1h": "present",
      "adhd_a1i": "present",
      "adhd_a2a": "present",
      "adhd_a2b": "present",
      "adhd_a2c": "present",
      "adhd_a2d": "present",
      "adhd_a2e": "present",
      "adhd_a2f": "present",
      "adhd_a2g": "present",
      "adhd_a2h": "present",
      "adhd_a2i": "present",
      "adhd_exc_psychotic": "cleared",
      "adhd_exc_mood": "cleared",
      "adhd_exc_anxiety": "cleared",
      "adhd_exc_dissociative": "cleared",
      "adhd_exc_personality": "cleared",
      "adhd_exc_substance": "cleared",
      "adhd_subj_functional_impairment": "met",
      "adhd_subj_developmental": "met",
      "adhd_subj_not_oppositional": "met",
      "duration_days": 187,
      "onset_age": 10
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 394
    }
  },
  {
    "id": "vig_015_ptsd_clear_92dfc4eb",
    "ground_truth": [
      "ptsd"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n63-year-old paramedic presents with \"I can't get the images out of my head; I feel back at the scene\" \n\n2. HISTORY OF PRESENT ILLNESS\nSymptoms began approximately 1 month ago after responding to a large industrial explosion on 12/10/2025. Patient reports direct exposure to the blast, memorable burns to his own hands, and witnessing multiple coworkers and bystanders injured or dying on scene. He learned later that a close friend and former partner on the job died that night; he received the call while en route. He describes repeated work-related exposure to graphic injuries while assisting in extrication and patient care. \"I pulled a man out and his face was gone — I still smell it,\" he states. Reports recurrent, involuntary images during the day and \"the same nightmare where I'm there again, and I can't save them.\" Describes episodes in which he feels he is back at the scene, drops to the floor, and cannot orient for several minutes: \"It feels like I'm standing next to the burning truck again.\" Avoids driving past the plant, refuses to talk to coworkers involved, and cancels family visits. Cannot recall whether he administered a particular airway maneuver to a patient at the scene. Reports increased startle to loud noises, scanning of environments, angry outbursts with spouse, several recent instances of speeding at night while alone (\"I don't care if I get a ticket\"), difficulty concentrating at work, and restless sleep with multiple awakenings.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\n4. FAMILY HISTORY\nMother alive, history unknown for psychiatric issues; brother alive, no known mental health treatment.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nHypertension controlled on lisinopril 10 mg daily. Substance use: alcohol 3–4 drinks on 1–2 evenings per week (reports increased frequency in past month), no recreational drug use reported, caffeine 2–3 cups/day. Labs: TSH normal, metabolic panel unremarkable, toxicology negative. Medications: lisinopril; OTC ibuprofen as needed.\n\nPERTINENT NEGATIVES\nDenies hearing voices. Denies visual hallucinations unrelated to memories of the event. Denies current suicidal plan or intent; endorses occasional passive wishing not to wake. Denies homicidal ideation. Denies recent illicit drug use.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: disheveled, hygiene adequate. Behavior: restless, hypervigilant, frequent scanning of room, exaggerated startle when door closed. Mood: \"on edge, angry, ashamed.\" Affect: constricted, tearful intermittently. Thought content: intrusive memories and flashback episodes described; passive wish not to wake noted, no active plan or intent; protective factors include adult children and employment history. Cognition: oriented x3, attention and concentration poor (missed calculations, frequent loss of train of thought). Insight: partial; recognizes symptoms are tied to the event but attributes blame to self (\"I should have done more\").",
    "answers": {
      "age": 63,
      "ptsd_a1": "present",
      "ptsd_a2": "present",
      "ptsd_a3": "present",
      "ptsd_a4": "present",
      "ptsd_b1": "present",
      "ptsd_b2": "present",
      "ptsd_b3": "present",
      "ptsd_b4": "present",
      "ptsd_b5": "present",
      "ptsd_c1": "present",
      "ptsd_c2": "present",
      "ptsd_d1": "present",
      "ptsd_d2": "present",
      "ptsd_d3": "present",
      "ptsd_d4": "present",
      "ptsd_d5": "present",
      "ptsd_d6": "present",
      "ptsd_d7": "present",
      "ptsd_e1": "present",
      "ptsd_e2": "present",
      "ptsd_e3": "present",
      "ptsd_e4": "present",
      "ptsd_e5": "present",
      "ptsd_e6": "present",
      "ptsd_exc_substance": "cleared",
      "ptsd_exc_medical": "cleared",
      "ptsd_exc_dissociative_substance": "cleared",
      "ptsd_exc_dissociative_medical": "cleared",
      "ptsd_subj_distress": "met",
      "ptsd_subj_trauma_quality": "met",
      "ptsd_subj_violent_accidental": "met",
      "duration_days": 37
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 446
    }
  },
  {
    "id": "vig_016_ptsd_preschool_clear_d910463f",
    "ground_truth": [
      "ptsd_preschool"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n5-year-old child brought by mother who reports \"He keeps acting like it's happening again\" and \"He won't go near the front door or let me out of his sight.\"\n\n2. HISTORY OF PRESENT ILLNESS\nMother reports a violent home incident approximately 1 month ago when the child was directly present and witnessed injuries to her and another caregiver; she also learned that a close relative was hurt in the same incident. Since the event began roughly 1 month ago, mother describes progressive change: \"He plays the same scene over and over with his cars and dolls,\" and \"He wakes screaming, then can't tell me why.\" Mother reports repeated reenactment in play, sudden freezing spells during routine activities, and nightly wakings. \"Some nights he yells 'no' in his sleep and then clings to me.\" Eating has become pickier; he has had two recent episodes of bedwetting after months of dryness. There is increased crying, frequent tantrums with minimal provocation, and refusal to attend preschool or go to the park where the event occurred.\n\n3. DEVELOPMENTAL HISTORY\nWalked at ~12 months, first words by 12–15 months, two-word phrases by 2 years; toilet trained by 3.5 years. No prior developmental evaluations; caregiver reports language and motor milestones otherwise age-appropriate.\n\n4. FAMILY HISTORY\nMother reports a history of mood symptoms in a paternal uncle and anxiety symptoms in the child's father.\n\n5. MEDICAL HISTORY\nTerm vaginal birth without complications. No chronic medical conditions. Current medications: none prescribed; occasional acetaminophen as needed. Recent illnesses: none. Substance use (caregiver report): mother drinks alcohol 1–2 times/month, no recreational drug use, consumes caffeine daily. Labs: TSH normal, metabolic panel unremarkable, toxicology negative.\n\nCaregiver denies suicidal ideation or self-harm behaviors in the child. No loss of consciousness reported.\n\n6. BEHAVIOURAL OBSERVATIONS / MENTAL STATUS EXAMINATION\nAppearance: age-appropriate dress, clean. Behavior: clung to mother on arrival, intermittently avoided eye contact, became immobile and stared during discussion of the event. Interaction: responded to simple questions with short sentences; engaged briefly in play but repeatedly returned to a repetitive scene reenacting a striking event with small figures. Affect: tearful, fearful at times, flat during some play episodes. Play quality: constricted and repetitive with trauma-themed reenactment; limited imaginative variation. Attachment: increased clinginess, distress with brief separations. Startle: exaggerated response to sudden noises in clinic. Concentration: brief attention span for tasks for age. Sleep: frequent night wakings and nightmares reported. Eating/toileting: decreased appetite, intermittent regression in nighttime toileting. No aggressive sexualized behavior observed during session.",
    "answers": {
      "age": 5,
      "ptsd_a1_child": "present",
      "ptsd_a2_child": "present",
      "ptsd_a3_child": "present",
      "ptsd_b1_child": "present",
      "ptsd_b2_child": "present",
      "ptsd_b3_child": "present",
      "ptsd_b4_child": "present",
      "ptsd_b5_child": "present",
      "ptsd_c1_child": "present",
      "ptsd_c2_child": "present",
      "ptsd_c3_child": "present",
      "ptsd_c4_child": "present",
      "ptsd_c5_child": "present",
      "ptsd_c6_child": "present",
      "ptsd_d1_child": "present",
      "ptsd_d2_child": "present",
      "ptsd_d3_child": "present",
      "ptsd_d4_child": "present",
      "ptsd_d5_child": "present",
      "ptsd_exc_substance_child": "cleared",
      "ptsd_exc_medical_child": "cleared",
      "ptsd_exc_dissociative_substance_child": "cleared",
      "ptsd_exc_dissociative_medical_child": "cleared",
      "ptsd_subj_distress_child": "met",
      "ptsd_subj_trauma_quality_child": "met",
      "duration_days": 37
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 416
    }
  },
  {
    "id": "vig_017_asd_clear_97b01197",
    "ground_truth": [
      "asd"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n36-year-old graphic designer presents with \"I don't know how to act around people\" and \"I get stuck on the same thing and can't stop.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports a change in social behavior noted by family and coworkers beginning approximately three weeks ago. \"I don't answer when people try to start a conversation — I just stare at my screen,\" he says. He describes repeated examples of failing to engage in back-and-forth conversation: when asked about weekend plans he responds with a single factual sentence and does not return questions. He reports reduced sharing of emotions: \"If something good happens I don't show it; I just keep doing my thing.\" He reports longstanding patterns beginning around age 11. Onset: Symptoms first appeared around age 11. Duration: Symptoms present for approximately 3 week(s). They began approximately three weeks ago with a noticeable increase in repetitive behaviors and withdrawal.\n\nHe gives concrete examples of nonverbal difficulties: avoids eye contact in meetings, keeps arms tight to his body, and does not use gestures when speaking. Reports repeating phrases he hears on television (\"I hear lines and say them again\") and lining up pens on his desk for prolonged periods. Describes strict routines: takes the same route to work, eats the same breakfast, and becomes \"really upset\" if these are changed — once became tearful and left work after a colleague swapped his coffee mug.\n\nAlso reports intense preoccupation with transit schedules and building floor plans, spending evenings researching them, to the exclusion of other topics. Sensory observations include covering ears to specific high-pitched alarms and fascination with spinning ceiling fans.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\n4. FAMILY HISTORY\nMother has history of mood symptoms; no formalized psychiatric treatment reported in immediate family.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nHistory of seasonal allergies. No chronic medical conditions. Current medications: loratadine as needed. Denies tobacco use; occasional alcohol use.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, well-groomed. Behaviour: minimal spontaneous social initiation, repetitive hand movements noted. Speech: monosyllabic to brief sentences, sometimes repeats phrases heard earlier. Mood (subjective): \"okay, bored.\" Affect (observed): constricted, limited facial expression. Thought process: linear but concrete, perseverative on specific topics. Cognition: alert and oriented x3; attention variably engaged during interview. Insight: limited regarding social difficulties.\n\nPERTINENT NEGATIVES: Denies suicidal ideation. Denies homicidal ideation. Denies hearing voices or seeing things that others do not. Denies current illicit substance use.",
    "answers": {
      "age": 36,
      "asd_a1": "present",
      "asd_a2": "present",
      "asd_a3": "present",
      "asd_b1": "present",
      "asd_b2": "present",
      "asd_b3": "present",
      "asd_b4": "present",
      "asd_exc_intellectual_disability": "cleared",
      "asd_subj_impairment": "met",
      "asd_subj_early_onset": "met",
      "asd_subj_severity_social": "met",
      "asd_subj_severity_rrb": "met",
      "duration_days": 21,
      "onset_age": 11
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 408
    }
  },
  {
    "id": "vig_018_mdd_moderate_3a14c44b",
    "ground_truth": [
      "mdd"
    ],
    "difficulty": "MODERATE",
    "meets_criteria": true,
    "clinical_text": "DEMOGRAPHICS AND CHIEF COMPLAINT\n22-year-old barista presents with \"I feel empty and I kind of don't care about anything.\"\n\nHISTORY OF PRESENT ILLNESS\nPatient reports a roughly 3 week(s) history of increasingly low mood that began after a difficult breakup approximately 3 weeks ago. States \"I've been sad most days, like all day,\" and \"I sometimes find myself crying for no reason.\" Reports a marked loss of interest in activities once enjoyed: \"I used to go to yoga and hang out with friends, but I just don't want to do that anymore.\" Observed by roommate to be more withdrawn and out of touch with usual routines. Describes slowed movements and slow speech that others have commented on: \"I guess I move kind of slowly now.\" Reports pervasive feelings of worthlessness and excessive guilt: \"I feel like I'm a burden and I should have prevented things,\" nearly every day. Endorses recurrent thoughts of death and passive suicidal ideation without a specific plan: \"Sometimes I think about not waking up,\" and \"I've thought about hurting myself but I don't have a plan.\" Timeline: symptoms began about 3 weeks ago and have been present most days since.\n\nPAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\nFAMILY HISTORY\nMother has received prior mental health treatment; no further details provided.\n\nMEDICAL HISTORY AND SUBSTANCES\nNo chronic medical conditions reported. Substance use: drinks alcohol socially, approximately 1-2 drinks 2–3 times per week; uses cannabis occasionally (monthly); caffeine ~2 cups coffee daily. Labs: TSH normal, metabolic panel unremarkable, toxicology negative. Medications: no current prescriptions; OTC ibuprofen PRN; combined oral contraceptive.\n\nMENTAL STATUS EXAMINATION\nAppearance: casually dressed, slightly disheveled, appears tearful. Behaviour: psychomotor retardation noted (slow movements, delayed responses) observable by clinician. Speech: soft, slowed, spontaneous production decreased. Mood: reports feeling \"empty\" and \"hopeless\" much of the day. Affect: constricted, tearful at times, congruent with reported mood. Thought process: linear but slowed. Thought content: expresses near-daily feelings of worthlessness and excessive guilt; reports recurrent thoughts of death and passive suicidal ideation without a specific plan. Perceptions: Denies hallucinations. Insight: limited; acknowledges change in mood but attributes to personal failure. Denies significant weight loss or gain. Denies insomnia or hypersomnia. Denies fatigue or loss of energy. Denies diminished ability to think or concentrate, or indecisiveness.",
    "answers": {
      "age": 22,
      "mdd_a1": "present",
      "mdd_a2": "present",
      "mdd_a3": "absent",
      "mdd_a4": "absent",
      "mdd_a5": "present",
      "mdd_a6": "absent",
      "mdd_a7": "present",
      "mdd_a8": "absent",
      "mdd_a9": "present",
      "mdd_exc_substance": "cleared",
      "mdd_exc_medical": "cleared",
      "mdd_exc_psychotic": "cleared",
      "mdd_exc_bipolar": "cleared",
      "mdd_subj_clinical_significance": "met",
      "duration_days": 21
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 375
    }
  },
  {
    "id": "vig_019_mdd_gad_comorbid_63f8b2ea",
    "ground_truth": [
      "mdd",
      "gad"
    ],
    "difficulty": "COMORBID",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n39-year-old graphic designer presents with \"I can't get out of bed most days\" and \"I worry all the time and feel completely worthless.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports a 6-month history of progressive low mood and pervasive worry beginning approximately July 2025. States, \"I feel sad and empty nearly every day,\" and, \"Things I used to enjoy just don't matter anymore.\" Reports markedly decreased interest in hobbies and social activities; stopped weekly art group and no longer plays guitar. Describes an unintentional 8% body weight loss over the past month with decreased appetite. Reports difficulty falling asleep and early morning awakening most nights and naps during the day. Observed psychomotor slowing with decreased facial expression and slowed gait; also reports episodes of pacing at home in the evening. Describes persistent fatigue, feelings of worthlessness and pervasive guilt about past decisions (\"I ruined everything for my family\"), difficulty concentrating at work with frequent mistakes and missed deadlines. Endorses recurrent thoughts of death and passive suicidal ideation without a specific plan; denies any past suicide attempts. Reports excessive worry about job performance and family for the past 6 months, difficulty controlling worry, restlessness, easy fatigability, irritability, muscle tension, and mind going blank in meetings.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history; no prior psychiatric hospitalizations or medications.\n\n4. FAMILY HISTORY\nMother experienced long-standing low mood and a paternal uncle had alcohol problems.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nHypertension, well controlled on lisinopril. Alcohol: 1-2 drinks weekly. Recreational drugs: denies use. Caffeine: two coffees daily. TSH normal. Metabolic panel unremarkable. Toxicology negative. Current medications: lisinopril 10 mg daily, occasional OTC melatonin.\n\n6. PERTINENT NEGATIVES (explicitly deny these)\nDenies visual or auditory hallucinations. Denies belief that others intend harm. Denies current suicidal plan or intent. Denies recreational drug use. Denies periods of markedly increased energy or decreased need for sleep. Denies prior suicide attempts.\n\n7. MENTAL STATUS EXAMINATION\nAppearance: unkempt, decreased grooming. Behaviour: cooperative but slowed movements; occasional pacing observed in waiting area. Speech: soft, decreased rate and volume. Mood: subjectively \"sad, anxious.\" Affect: constricted, tearful during exam. Thought process: ruminative, slowed. Thought content: pervasive worthlessness and excessive guilt; recurrent thoughts of death without plan. Perceptions: denies hallucinations. Insight: limited; recognizes symptoms but attributes them to \"failure.\" Judgment: impaired by poor concentration and fatigue.",
    "answers": {
      "age": 39,
      "mdd_a1": "present",
      "mdd_a2": "present",
      "mdd_a3": "present",
      "mdd_a4": "present",
      "mdd_a5": "present",
      "mdd_a6": "present",
      "mdd_a7": "present",
      "mdd_a8": "present",
      "mdd_a9": "present",
      "mdd_exc_substance": "cleared",
      "mdd_exc_medical": "cleared",
      "mdd_exc_psychotic": "cleared",
      "mdd_exc_bipolar": "cleared",
      "mdd_subj_clinical_significance": "met",
      "duration_days": 194,
      "gad_a": "present",
      "gad_b": "present",
      "gad_c1": "present",
      "gad_c2": "present",
      "gad_c3": "present",
      "gad_c4": "present",
      "gad_c5": "present",
      "gad_c6": "present",
      "gad_exc_substance": "cleared",
      "gad_exc_medical": "cleared",
      "gad_exc_panic": "cleared",
      "gad_exc_social_anxiety": "cleared",
      "gad_exc_ocd": "cleared",
      "gad_exc_separation": "cleared",
      "gad_exc_ptsd": "cleared",
      "gad_exc_anorexia": "cleared",
      "gad_exc_somatic": "cleared",
      "gad_exc_bdd": "cleared",
      "gad_exc_illness_anxiety": "cleared",
      "gad_exc_psychotic": "cleared",
      "gad_subj_clinical_significance": "met",
      "gad_subj_excessive": "met"
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 388
    }
  },
  {
    "id": "vig_020_adhd_ambiguous_7b30c9ca",
    "ground_truth": [
      "adhd"
    ],
    "difficulty": "AMBIGUOUS",
    "meets_criteria": false,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n30-year-old software engineer presents with \"I can't keep my head on one thing\" and \"I'm just bad at staying focused.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports symptoms began around age 24 and are currently present in this pattern for approximately 5 month(s). Describes long-standing problems with sustaining attention but notes recent worsening: \"I drift off in meetings, it's like my mind goes somewhere else,\" and \"I start tasks and then get pulled into something else.\" Reports often not seeming to listen when spoken to directly — \"people say I ignore them but I don't mean to, my mind is elsewhere.\" Gives concrete examples: difficulty remaining focused during lectures and long reading; frequently starts projects at work but fails to complete them, leaving documents half-finished; keeps a cluttered desk and misses deadlines. Reports often losing keys, phone, and paperwork; misplacing eyeglasses once last month. Describes frequent fidgeting (taps fingers/feet), feeling restless when required to sit for long periods, and talking more than others in group settings. Reports blurting answers in meetings, finishing others' sentences, difficulty waiting turns, and interrupting coworkers to contribute ideas. Patient minimizes impairment: \"it's not that bad, I still get things done, just takes longer\" and expresses uncertainty about severity.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\n4. FAMILY HISTORY\nFamily history notable for a parent with chronic mood-related difficulties (no formal diagnosis provided).\n\n5. MEDICAL HISTORY AND SUBSTANCES\nMedical history noncontributory. Alcohol: 1–2 drinks on weekends. Recreational drugs: denies current use; reports past experimental cannabis in college, not recent. Caffeine: 2–4 cups coffee daily.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, slightly disheveled, good hygiene. Behaviour: restless, frequently shifts in chair, taps fingers. Speech: rapid at times, increased rate and volume, occasionally interrupts examiner. Mood: \"okay\" / \"a little frustrated.\" Affect: mildly labile, range present but shallow. Thought process: tangential at times, jumps between topics, occasional impulsive replies. Thought content: denies delusional ideas. Perceptions: denies hallucinations. Insight: limited; patient minimizes impact and expresses uncertainty about need for treatment.",
    "answers": {
      "age": 30,
      "adhd_a1a": "absent",
      "adhd_a1b": "present",
      "adhd_a1c": "present",
      "adhd_a1d": "present",
      "adhd_a1e": "present",
      "adhd_a1f": "absent",
      "adhd_a1g": "present",
      "adhd_a1h": "absent",
      "adhd_a1i": "absent",
      "adhd_a2a": "present",
      "adhd_a2b": "absent",
      "adhd_a2c": "present",
      "adhd_a2d": "absent",
      "adhd_a2e": "absent",
      "adhd_a2f": "present",
      "adhd_a2g": "present",
      "adhd_a2h": "present",
      "adhd_a2i": "present",
      "adhd_exc_psychotic": "cleared",
      "adhd_exc_mood": "cleared",
      "adhd_exc_anxiety": "cleared",
      "adhd_exc_dissociative": "cleared",
      "adhd_exc_personality": "cleared",
      "adhd_exc_substance": "cleared",
      "adhd_subj_functional_impairment": "not_met",
      "adhd_subj_developmental": "not_met",
      "adhd_subj_not_oppositional": "met",
      "duration_days": 177,
      "onset_age": 24
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 338
    }
  },
  {
    "id": "vig_021_ptsd_moderate_d71d27a5",
    "ground_truth": [
      "ptsd"
    ],
    "difficulty": "MODERATE",
    "meets_criteria": true,
    "clinical_text": "\"24-year-old retail worker presents with \"I'm kind of on edge and having nightmares about what I saw.\"\"\n\nHISTORY OF PRESENT ILLNESS\nPatient reports onset of symptoms approximately 1 month ago after witnessing a violent street incident in which several bystanders were hurt. He states, \"I was there — I saw it happen to other people, like right in front of me,\" and describes repeatedly replaying elements of the scene in his mind at night. He endorses recurrent distressing dreams related to the event, occurring about 2–3 times per week, saying, \"I wake up sweating and it feels like it's still happening.\" He avoids the intersection and nearby store where it occurred, avoids conversations about the incident, and has stopped going to his usual evening hangouts because they remind him of the scene; he notes, \"I just don't go down that way anymore.\" He describes feeling detached from friends and family, \"kind of distant, like I'm not really there,\" and reports difficulty experiencing happiness or satisfaction in activities that used to feel rewarding. He acknowledges increased irritability with several verbal outbursts at coworkers over minor issues in the past two weeks and one episode of throwing a cup against a wall when angry. Sleep is disturbed: difficulty falling asleep and restless sleep with frequent awakenings, averaging 3–4 hours per night. Symptoms present for approximately 1 month(s); began about four weeks ago.\n\nPERTINENT NEGATIVES\nDenies directly experiencing the event(s) herself/himself. Denies learning that the event(s) occurred to a close family member or close friend. Denies repeated or extreme occupational exposure to aversive details. Denies recurrent, involuntary, and intrusive distressing memories of the event(s). Denies dissociative reactions in which the event(s) feel as if recurring. Denies intense or prolonged psychological distress at exposure to cues that resemble the event(s). Denies marked physiological reactions to such cues. Denies avoidance of or efforts to avoid distressing memories, thoughts, or feelings about or closely associated with the event(s).\n\nPAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\nFAMILY HISTORY\nMother alive, supportive; no known psychiatric history in first-degree relatives.\n\nMEDICAL HISTORY AND SUBSTANCES\nNo chronic medical problems. Alcohol: drinks socially, ~1–2 times/week. Recreational drugs: denies current use. Caffeine: 1–2 caffeinated beverages/day. TSH normal; metabolic panel unremarkable; toxicology negative. Medications: ibuprofen as needed.\n\nMENTAL STATUS EXAMINATION\nAppearance: casually dressed, grooming adequate. Behavior: guarded but cooperative; occasional agitation. Mood: \"on edge.\" Affect: restricted, congruent with reported mood. Thought content: no current suicidal ideation, denies plan or intent; protective factors include desire to finish school and contact with mother. Cognition: alert, oriented x3, concentration mildly reduced. Insight: limited; patient expresses uncertainty about symptoms.",
    "answers": {
      "age": 24,
      "ptsd_a1": "absent",
      "ptsd_a2": "present",
      "ptsd_a3": "absent",
      "ptsd_a4": "absent",
      "ptsd_b1": "absent",
      "ptsd_b2": "present",
      "ptsd_b3": "absent",
      "ptsd_b4": "absent",
      "ptsd_b5": "absent",
      "ptsd_c1": "absent",
      "ptsd_c2": "present",
      "ptsd_d1": "absent",
      "ptsd_d2": "absent",
      "ptsd_d3": "absent",
      "ptsd_d4": "absent",
      "ptsd_d5": "absent",
      "ptsd_d6": "present",
      "ptsd_d7": "present",
      "ptsd_e1": "present",
      "ptsd_e2": "absent",
      "ptsd_e3": "absent",
      "ptsd_e4": "absent",
      "ptsd_e5": "absent",
      "ptsd_e6": "present",
      "ptsd_exc_substance": "cleared",
      "ptsd_exc_medical": "cleared",
      "ptsd_exc_dissociative_substance": "cleared",
      "ptsd_exc_dissociative_medical": "cleared",
      "ptsd_subj_distress": "met",
      "ptsd_subj_trauma_quality": "met",
      "ptsd_subj_violent_accidental": "met",
      "duration_days": 37
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 432
    }
  },
  {
    "id": "vig_022_ptsd_preschool_ambiguous_ff3076d7",
    "ground_truth": [
      "ptsd_preschool"
    ],
    "difficulty": "AMBIGUOUS",
    "meets_criteria": false,
    "clinical_text": "DEMOGRAPHICS AND CHIEF COMPLAINT\n3-year-old child brought by mother who reports \"He keeps replaying it with his toys and won't stop crying,\" and \"He's jumpy and won't let me leave the room.\"\n\nHISTORY OF PRESENT ILLNESS\nMother reports a change in behavior beginning approximately three weeks ago after the child witnessed the event(s) in person. \"He covers his ears when he hears loud noises and screams 'no' if I go near the window,\" she states. Mother notes increased frequency of fear and sadness, more clinginess, and more frequent tantrums: \"He cries for a long time over small things and says he is 'scared'.\" Play has shifted from varied, imaginative play to repetitive re-enactments with cars and dolls focusing on loud noises and caregivers being upset. Sleep is disrupted—multiple night wakings with crying and \"bad dreams\" reported by child but caregiver unsure of content. Eating mostly unchanged; occasional decreased appetite during episodes of fear. Some regression noted: asking for bottle at times and needing assistance with toileting more than before.\n\nDURATION\nSymptoms present for approximately 3 week(s), began about three weeks ago after witnessing the event(s).\n\nDEVELOPMENTAL HISTORY\nWalked independently at 13 months, first words around 12 months, currently using 3–4 word phrases, toilet training daytime partial, no prior developmental evaluations, previously meeting expected milestones per caregiver.\n\nFAMILY HISTORY\nMother reports long-standing treatment for mood symptoms; father reports past difficulties with attention and school.\n\nMEDICAL HISTORY\nFull-term, uncomplicated birth. No chronic medical conditions. No current prescription medications; occasional OTC multivitamin. Recent mild URI resolved. Substance use: mother reports alcohol socially ~monthly, no recreational drug use, caffeine daily. Labs: TSH normal; metabolic panel unremarkable; toxicology negative.\n\nBEHAVIOURAL OBSERVATIONS / MENTAL STATUS EXAMINATION\nWell-groomed, age-appropriate clothing. During session child alternated between clinging to mother and exploring toys; engaged intermittently, required redirection. Eye contact variable; responded to name. Affect labile—tearful at times, sudden bursts of giggling. Play predominantly repetitive, focused on loud noises and caregiver distress scenes; no complex imaginative themes observed. Attachment behavior prominent—clingy, resisted brief separation. Startle response exaggerated to sudden sounds (jumped, covered ears). Language appropriate for age (3–4 word phrases), gross and fine motor skills within expected range. No self-injurious behavior observed.\n\nPERTINENT NEGATIVES\nCaregiver denies directly experiencing the event(s).\nCaregiver denies learning that the event(s) occurred to a parent or caregiving figure.\nCaregiver denies recurrent, involuntary, and intrusive distressing memories of the event(s).\nCaregiver denies recurrent distressing dreams related to the event(s).\nCaregiver denies dissociative reactions in which the child feels or acts as if the event(s) were recurring.\nCaregiver denies intense or prolonged psychological distress at exposure to internal or external cues that symbolize or resemble an aspect of the event(s).\nCaregiver denies avoidance of or efforts to avoid activities, places, or physical reminders that arouse recollections of the event(s).",
    "answers": {
      "age": 3,
      "ptsd_a1_child": "absent",
      "ptsd_a2_child": "present",
      "ptsd_a3_child": "absent",
      "ptsd_b1_child": "absent",
      "ptsd_b2_child": "absent",
      "ptsd_b3_child": "absent",
      "ptsd_b4_child": "absent",
      "ptsd_b5_child": "present",
      "ptsd_c1_child": "absent",
      "ptsd_c2_child": "absent",
      "ptsd_c3_child": "present",
      "ptsd_c4_child": "absent",
      "ptsd_c5_child": "absent",
      "ptsd_c6_child": "absent",
      "ptsd_d1_child": "absent",
      "ptsd_d2_child": "absent",
      "ptsd_d3_child": "present",
      "ptsd_d4_child": "absent",
      "ptsd_d5_child": "absent",
      "ptsd_exc_substance_child": "cleared",
      "ptsd_exc_medical_child": "cleared",
      "ptsd_exc_dissociative_substance_child": "cleared",
      "ptsd_exc_dissociative_medical_child": "cleared",
      "ptsd_subj_distress_child": "not_met",
      "ptsd_subj_trauma_quality_child": "met",
      "duration_days": 27
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 462
    }
  },
  {
    "id": "vig_023_asd_ambiguous_adce8d84",
    "ground_truth": [
      "asd"
    ],
    "difficulty": "AMBIGUOUS",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n\"51-year-old software engineer presents with 'I just feel awkward around people, but it's not a big deal'\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports a longstanding pattern of social differences beginning in adolescence, with a recent perceived worsening over the past three weeks. \"I've always been kind of different since I was 15,\" he states, and also says, \"It's been about three weeks that it's felt harder at work.\" He describes difficulty with back-and-forth conversation (often answering briefly or not responding to social prompts), reduced spontaneous sharing of interests or emotions, and frequent failure to initiate social interactions. Examples: failed attempts at small talk with coworkers leading to silence, not responding when colleagues invite lunch, and avoiding group meetings. He reports limited use of gestures and minimal facial expressiveness; interviewer observed poor eye contact and flat facial movement. Patient notes repetitive verbalizations (\"I repeat phrases I hear at times\") and has routine motor mannerisms (frequent finger tapping, occasional flipping of a pen). He reports one intense, narrow interest in vintage mechanical watches, spending hours reading forums and collecting parts. Duration: Symptoms present for approximately 3 week(s); began ~3 weeks ago. Onset: Symptoms first appeared around age 15.\n\nDenies insistence on sameness, inflexible adherence to routines, or ritualized patterns of verbal or nonverbal behavior. Denies hyper- or hyporeactivity to sensory input or unusual interest in sensory aspects of the environment.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history. No prior psychotropic medication trials.\n\n4. FAMILY HISTORY\nMother has a history of being treated intermittently by mental health services; father alive, no known psychiatric treatment.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nHypertension; on lisinopril 10 mg daily. Denies illicit drug use; drinks 1–2 glasses of wine weekly; no tobacco.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, well-groomed. Behaviour: repetitive finger tapping during interview, minimal spontaneous gestures. Speech: low volume, literal, occasionally repeats interviewer phrases. Mood (subjective): \"Okay most days, a bit tired.\" Affect (observed): constricted, limited range. Thought process: concrete, goal-directed. Cognition: oriented x3, attention mildly reduced during social tasks. Insight: acknowledges interpersonal difficulties but minimizes impact; reports \"I manage fine most days.\"",
    "answers": {
      "age": 51,
      "asd_a1": "present",
      "asd_a2": "present",
      "asd_a3": "present",
      "asd_b1": "present",
      "asd_b2": "absent",
      "asd_b3": "present",
      "asd_b4": "absent",
      "asd_exc_intellectual_disability": "cleared",
      "asd_subj_impairment": "met",
      "asd_subj_early_onset": "met",
      "asd_subj_severity_social": "met",
      "asd_subj_severity_rrb": "met",
      "duration_days": 21,
      "onset_age": 15
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 355
    }
  },
  {
    "id": "vig_024_mdd_clear_a538dbd7",
    "ground_truth": [
      "mdd"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n51-year-old accountant presents with \"I feel empty, like I can't enjoy anything and I just want it to end.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports a 3-week history of pervasive low mood that began after a recent layoff. \"Most days I wake up and dread the day,\" he states. Appears tearful during interview. Describes marked loss of interest: stopped going to weekly softball, stopped reading and stopped cooking—activities he previously enjoyed. Reports an 8-lb unintentional weight loss over the past month and \"I barely have an appetite.\" Sleep is fragmented with early morning awakening and difficulty falling asleep almost every night. Wife reports he is noticeably slower in movements and speaks more softly than usual; patient acknowledges feeling slowed: \"I move like I'm through molasses.\" Endorses fatigue and inability to concentrate at the computer: \"I stare at spreadsheets and can't make decisions.\" Expresses pervasive feelings of worthlessness: \"I ruined everything for my family,\" and reports excessive guilt about being unemployed. Reports recurrent thoughts of death, stating \"I think about dying a lot,\" but denies having a plan. Timeline: symptoms began approximately 3 weeks ago after job loss and have been present nearly every day since.\n\nPERTINENT NEGATIVES (explicitly deny these):\nDenies hallucinations. Denies fixed false beliefs about being controlled. Denies current suicidal plan or intent. Denies recent recreational drug use. Denies episodes of markedly elevated energy or decreased need for sleep.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history. No prior psychiatric hospitalizations. No prior self-harm behavior reported.\n\n4. FAMILY HISTORY\nMother had prolonged periods of low mood and was hospitalized once for suicidal ideation.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nMedical: hypertension controlled on medication. Substance use: alcohol 1–2 drinks 2–3 times per week, denies recreational drugs, caffeine 2 cups coffee daily. Labs: TSH normal; metabolic panel unremarkable; toxicology negative. Medications: lisinopril 10 mg daily, atorvastatin 20 mg nightly, OTC multivitamin.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: disheveled, slight weight loss noted. Behaviour: cooperative but psychomotor slowing observed. Speech: soft, slowed rate. Mood: subjectively \"empty, hopeless.\" Affect: constricted, tearful at times. Thought process: slowed, ruminative. Thought content: no delusional beliefs reported; endorses passive and recurrent thoughts of death without plan. Perceptions: no hallucinations reported. Insight: limited regarding need for treatment.",
    "answers": {
      "age": 51,
      "mdd_a1": "present",
      "mdd_a2": "present",
      "mdd_a3": "present",
      "mdd_a4": "present",
      "mdd_a5": "present",
      "mdd_a6": "present",
      "mdd_a7": "present",
      "mdd_a8": "present",
      "mdd_a9": "present",
      "mdd_exc_substance": "cleared",
      "mdd_exc_medical": "cleared",
      "mdd_exc_psychotic": "cleared",
      "mdd_exc_bipolar": "cleared",
      "mdd_subj_clinical_significance": "met",
      "duration_days": 21
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 375
    }
  },
  {
    "id": "vig_025_gad_ambiguous_04b07b65",
    "ground_truth": [
      "gad"
    ],
    "difficulty": "AMBIGUOUS",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n54-year-old accountant presents with \"I've been worrying about everything for months, but it's probably nothing.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports a gradual onset of excessive worry beginning approximately July 2025. Duration: Symptoms present for approximately 6 month(s). He describes \"constant thoughts about work and if I'm making mistakes\" and \"I can't really turn my brain off at night,\" while also stating, \"it's probably not that bad, I can still do my job.\" Worry is focused on performance at work (fear of making errors in reports, attending meetings), finances, and family health. He reports the worry occurs more days than not and says he finds it difficult to control: \"I try not to think about it but it keeps coming back.\" Irritability noted by patient and corroborated by partner: he reports snapping at coworkers and being short with his spouse over minor issues. Denies restlessness or feeling keyed up or on edge. Denies being easily fatigued. Denies difficulty concentrating or mind going blank. Denies muscle tension.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\n4. FAMILY HISTORY\nMother had long-standing complaints described by patient as \"nervousness\"; no formal treatments reported.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nMedical history: hypertension, hyperlipidemia. Substance use: drinks wine socially, approximately 1–2 glasses per week; denies recreational drug use; caffeine ~2 cups coffee daily. Labs: TSH normal, metabolic panel unremarkable, toxicology negative. Medications: lisinopril 10 mg daily, atorvastatin 20 mg nightly, OTC multivitamin.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: neatly dressed, well-groomed. Behaviour: cooperative, engaged, slightly restless in chair but calm. Speech: normal rate and volume. Mood (subjective): \"a bit on edge, but manageable.\" Affect: mildly irritable, mood-congruent. Thought process: coherent, goal-directed, preoccupied with worries about work and family. Thought content: no reported suicidal ideation or intent; no hallucinations reported. Cognition: oriented x3; immediate and remote memory intact; insight: partial — recognizes worries are frequent but minimizes severity and is uncertain about need for treatment. No psychomotor retardation observed.",
    "answers": {
      "age": 54,
      "gad_a": "present",
      "gad_b": "present",
      "gad_c1": "present",
      "gad_c2": "absent",
      "gad_c3": "absent",
      "gad_c4": "present",
      "gad_c5": "absent",
      "gad_c6": "present",
      "gad_exc_substance": "cleared",
      "gad_exc_medical": "cleared",
      "gad_exc_panic": "cleared",
      "gad_exc_social_anxiety": "cleared",
      "gad_exc_ocd": "cleared",
      "gad_exc_separation": "cleared",
      "gad_exc_ptsd": "cleared",
      "gad_exc_anorexia": "cleared",
      "gad_exc_somatic": "cleared",
      "gad_exc_bdd": "cleared",
      "gad_exc_illness_anxiety": "cleared",
      "gad_exc_psychotic": "cleared",
      "gad_subj_clinical_significance": "met",
      "gad_subj_excessive": "met",
      "duration_days": 187
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 328
    }
  },
  {
    "id": "vig_026_adhd_moderate_e4159962",
    "ground_truth": [
      "adhd"
    ],
    "difficulty": "MODERATE",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n56-year-old accountant presents with \"I can't keep track of anything; I kind of always miss details and I'm running out of patience with myself.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports a roughly 6-month period of worsening problems with attention, organization, restlessness, and impulsive speech. \"I sometimes just blurt things out before someone finishes,\" and \"I lose my keys and phone all the time.\" Describes frequent careless mistakes at work (overlooking figures on reports, inaccurate spreadsheets), difficulty keeping paperwork and materials in order, and missed deadlines due to poor time management. Notes often not appearing to listen during meetings — \"my mind seems elsewhere even when people are talking to me.\" Reports being easily distracted by unrelated thoughts and environmental stimuli, forgetting to return calls and pay bills, and needing prompts for routine chores. Observed fidgeting and frequent repositioning during interview; reports leaving his desk and pacing in the office and feeling \"on the go\" and uncomfortable sitting through long meetings. Talks rapidly and at length in meetings, interrupts colleagues, and states difficulty waiting his turn in conversations and lines. \"I've been like this since I was a kid — around five,\" patient states; symptoms present for approximately 6 months in their current intensity. Denies often having difficulty sustaining attention in tasks or play activities. Denies often not following through on instructions and failing to finish tasks. Denies often avoiding tasks requiring sustained mental effort. Denies often running about or climbing in inappropriate situations.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\n4. FAMILY HISTORY\nPatient reports father was \"always restless\"; no formal family psychiatric treatment reported.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nMedical history unremarkable. Alcohol: 1–2 drinks/month. Recreational drugs: denies use. Caffeine: 2 cups coffee daily.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, slightly disheveled. Behavior: restless, frequent hand tapping, shifted seat multiple times. Speech: rapid, verbose. Mood: \"frustrated and tired.\" Affect: broadly appropriate, somewhat restless. Thought process: at times tangential, interrupts interviewer, completes others' sentences. Thought content: denies delusional ideas. Perceptions: denies hallucinations. Insight: limited awareness of the degree to which symptoms interfere with work and relationships; acknowledges problems and is seeking help.",
    "answers": {
      "age": 56,
      "adhd_a1a": "present",
      "adhd_a1b": "absent",
      "adhd_a1c": "present",
      "adhd_a1d": "absent",
      "adhd_a1e": "present",
      "adhd_a1f": "absent",
      "adhd_a1g": "present",
      "adhd_a1h": "present",
      "adhd_a1i": "present",
      "adhd_a2a": "present",
      "adhd_a2b": "present",
      "adhd_a2c": "absent",
      "adhd_a2d": "absent",
      "adhd_a2e": "present",
      "adhd_a2f": "present",
      "adhd_a2g": "present",
      "adhd_a2h": "present",
      "adhd_a2i": "absent",
      "adhd_exc_psychotic": "cleared",
      "adhd_exc_mood": "cleared",
      "adhd_exc_anxiety": "cleared",
      "adhd_exc_dissociative": "cleared",
      "adhd_exc_personality": "cleared",
      "adhd_exc_substance": "cleared",
      "adhd_subj_functional_impairment": "met",
      "adhd_subj_developmental": "met",
      "adhd_subj_not_oppositional": "met",
      "duration_days": 187,
      "onset_age": 5
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 360
    }
  },
  {
    "id": "vig_027_ptsd_moderate_53aa8683",
    "ground_truth": [
      "ptsd"
    ],
    "difficulty": "MODERATE",
    "meets_criteria": true,
    "clinical_text": "DEMOGRAPHICS AND CHIEF COMPLAINT\n58-year-old firefighter presents with \"I can't stop seeing the scenes, it's like it's on repeat and I kind of shut down when I'm around that truck.\"\n\nHISTORY OF PRESENT ILLNESS\nPatient reports symptoms beginning approximately 1 month ago after repeated work-related exposure to aversive details while responding to multiple severe incidents on recent shifts. He describes recurrent, involuntary images and intrusive memories: \"Sometimes I'll be making coffee and this one image just pops in — I try to push it away but it stays.\" He reports avoiding external reminders (station bay, a specific engine, certain conversations with colleagues): \"I try not to go near the station for a while after a shift.\" He notes an inability to recall an important portion of a recent event sequence: \"I can't really remember how long we were there or exactly what I did — there's a gap.\" He expresses persistent, self-directed and other-directed blaming cognitions: \"I kind of think maybe I should've done more\" and \"I feel like command didn't give us enough time.\" He acknowledges increased irritability with sudden angry outbursts at home and work, and difficulty concentrating during paperwork and briefings. Duration: symptoms present for approximately 1 month, began after a series of nighttime calls about four weeks ago.\n\nPertinent negatives: Denies directly experiencing the traumatic event(s). Denies witnessing, in person, the event(s) as it occurred to others. Denies learning that the traumatic event(s) occurred to a close family member or close friend (violent or accidental death). Denies recurrent distressing dreams related to the events. Denies dissociative reactions in which he feels or acts as if the events were recurring. Denies intense or prolonged psychological distress at exposure to cues that symbolize or resemble aspects of the events. Denies marked physiological reactions to such cues. Denies active avoidance of internal memories or thoughts about the events.\n\nPAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\nFAMILY HISTORY\nFather had problems with alcohol; no known psychiatric treatment in immediate family.\n\nMEDICAL HISTORY AND SUBSTANCES\nHypertension. Alcohol: 1–2 beers on weekends. Recreational drugs: denies. Caffeine: 2 cups coffee daily. Labs: TSH normal; metabolic panel unremarkable; toxicology negative. Medications: lisinopril 10 mg daily; OTC ibuprofen PRN.\n\nMENTAL STATUS EXAMINATION\nAppearance: casually dressed, slightly disheveled. Behavior: cooperative but guarded. Mood: \"on edge, kind of worn out.\" Affect: restricted, reactive to content. Thought process: logical, goal-directed. Thought content: no suicidal ideation reported; denies current plan or intent; protective factors include spouse and work responsibilities. Cognition: oriented x3; attention and concentration impaired as noted; recent memory gaps reported. Insight: partial, acknowledges symptoms but minimizes impact.",
    "answers": {
      "age": 58,
      "ptsd_a1": "absent",
      "ptsd_a2": "absent",
      "ptsd_a3": "absent",
      "ptsd_a4": "present",
      "ptsd_b1": "present",
      "ptsd_b2": "absent",
      "ptsd_b3": "absent",
      "ptsd_b4": "absent",
      "ptsd_b5": "absent",
      "ptsd_c1": "absent",
      "ptsd_c2": "present",
      "ptsd_d1": "present",
      "ptsd_d2": "absent",
      "ptsd_d3": "present",
      "ptsd_d4": "absent",
      "ptsd_d5": "absent",
      "ptsd_d6": "absent",
      "ptsd_d7": "absent",
      "ptsd_e1": "present",
      "ptsd_e2": "absent",
      "ptsd_e3": "absent",
      "ptsd_e4": "absent",
      "ptsd_e5": "present",
      "ptsd_e6": "absent",
      "ptsd_exc_substance": "cleared",
      "ptsd_exc_medical": "cleared",
      "ptsd_exc_dissociative_substance": "cleared",
      "ptsd_exc_dissociative_medical": "cleared",
      "ptsd_subj_distress": "met",
      "ptsd_subj_trauma_quality": "met",
      "ptsd_subj_violent_accidental": "met",
      "duration_days": 37
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 430
    }
  },
  {
    "id": "vig_028_ptsd_preschool_ambiguous_5117cc5e",
    "ground_truth": [
      "ptsd_preschool"
    ],
    "difficulty": "AMBIGUOUS",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n4-year-old child brought by mother who reports \"I don't know if this is normal, but he keeps having bad dreams and won't play like he used to.\"\n\n2. HISTORY OF PRESENT ILLNESS\nMother reports changes beginning approximately 1 month ago after she told the child about a recent distressing event that happened to her. \"He asked lots of questions afterward, and since then he's been different.\" She describes recurrent nighttime awakenings: \"He wakes up crying from bad dreams — he won't tell me what they're about.\" Play has shifted from imaginative groups to solitary, quiet play; mother notes repetitive themes involving caregiving figures. Mother reports increased clinginess: \"He wants me with him all the time and cries when I go to another room.\" There are more frequent outbursts and difficulty calming; teacher reported trouble sitting through circle time and following directions. Eating mostly unchanged; recent brief return to occasional daytime wetting and more naps. Mother expresses uncertainty about severity and developmental norms.\n\n3. DEVELOPMENTAL HISTORY\nWalked by 12 months, first words around 12 months, two-word phrases by 24 months, toilet training completed by age 3 with recent occasional regression. No prior developmental evaluations; no prior concerns noted earlier.\n\n4. FAMILY HISTORY\nMother reports she has had treatment for mood-related concerns in the past; father has history of stress-related care.\n\n5. MEDICAL HISTORY\nFull-term vaginal birth without complications. No chronic medical conditions. Current medications: none prescribed; occasional acetaminophen for fever. Recent illnesses none. Substance use (caregiver): alcohol socially 1–2 times/week, no recreational drugs, daily coffee. Labs: TSH normal, metabolic panel unremarkable, toxicology negative.\n\n6. BEHAVIOURAL OBSERVATIONS / MENTAL STATUS EXAMINATION\nWell-groomed, age-appropriate clothing. Child sat close to mother throughout visit, intermittently reaching to be held. Eye contact variable; engaged briefly with toys but frequently returned to mother's lap. Affect constricted at times, tearful when discussing bedtime; flat and quiet during parts of play. Play was repetitive and focused on caregiving themes; limited pretend social play with examiner. Startle response exaggerated to loud noises in clinic (jumped, cried). Attention span limited for structured tasks; distracted by ambient noise, difficulty following simple multi-step requests. No language or gross motor delays observed; speech spontaneous, vocabulary appropriate for age. Attachment behaviors notable for clinginess and distress with brief separation. Caregiver denies direct experiencing of the event by the child. Caregiver denies witnessing the event in person. Caregiver denies recurrent, involuntary, and intrusive distressing memories. No dissociative reactions observed during session. Caregiver denies intense or prolonged distress at exposure to reminders. No marked physiological reactions to reminders reported. Caregiver denies avoidance of activities or places specifically to prevent reminders.",
    "answers": {
      "age": 4,
      "ptsd_a1_child": "absent",
      "ptsd_a2_child": "absent",
      "ptsd_a3_child": "present",
      "ptsd_b1_child": "absent",
      "ptsd_b2_child": "present",
      "ptsd_b3_child": "absent",
      "ptsd_b4_child": "absent",
      "ptsd_b5_child": "absent",
      "ptsd_c1_child": "absent",
      "ptsd_c2_child": "absent",
      "ptsd_c3_child": "absent",
      "ptsd_c4_child": "absent",
      "ptsd_c5_child": "present",
      "ptsd_c6_child": "absent",
      "ptsd_d1_child": "absent",
      "ptsd_d2_child": "absent",
      "ptsd_d3_child": "present",
      "ptsd_d4_child": "present",
      "ptsd_d5_child": "absent",
      "ptsd_exc_substance_child": "cleared",
      "ptsd_exc_medical_child": "cleared",
      "ptsd_exc_dissociative_substance_child": "cleared",
      "ptsd_exc_dissociative_medical_child": "cleared",
      "ptsd_subj_distress_child": "met",
      "ptsd_subj_trauma_quality_child": "met",
      "duration_days": 37
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 438
    }
  },
  {
    "id": "vig_029_asd_clear_77a96fd2",
    "ground_truth": [
      "asd"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n\"35-year-old software engineer presents with 'I have trouble with people and routines — it's getting worse'\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports an exacerbation of longstanding interpersonal and behavioral patterns over the past three weeks. \"I barely answer when someone says hello,\" he states, and describes withdrawing from conversations at work, often providing one-word answers or changing the subject abruptly. He gives concrete examples: avoids team lunches, does not join after-work gatherings, and ignores small talk. He reports repetitive behaviors during the day: \"I line up my pens in the same order every hour,\" and notes repeating phrases he has heard on podcasts when anxious. He describes marked distress with schedule changes: when his train was delayed three weeks ago he became visibly agitated and spent an hour reorganizing his bag to feel calm. He notes strong fixation on mechanical wristwatches, checking them repeatedly and researching specifications for hours. Timeline: long-standing patterns since early childhood with current intensification beginning roughly three weeks ago.\n\nDURATION\nSymptoms present for approximately 3 weeks; patient reports current worsening began about three weeks ago.\n\nONSET\nSymptoms first appeared around age 1.\n\nPERTINENT NEGATIVES\nDenies hallucinations. Denies suicidal ideation. Denies homicidal ideation. Denies recent illicit substance use.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history, no prior hospitalizations, no prior psychiatric medications.\n\n4. FAMILY HISTORY\nMother reported to be socially reserved; no known formal mental health treatment in family.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nNo significant medical history. No current medications. Denies tobacco use, alcohol use limited to social occasions, denies recreational drug use.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, neat. Behaviour: limited spontaneous gestures, lined up three pens on table during interview. Speech: low volume, monotonous, occasionally repeats phrases heard earlier. Mood (subjective): \"Okay, mostly annoyed.\" Affect (observed): constricted, limited range, minimal facial animation, poor eye contact. Thought process: concrete, literal, occasionally perseverative on routines. Cognition: oriented x3, attention adequate for tasks, short-term memory intact on testing. Insight: limited recognition of social difficulties and their impact.",
    "answers": {
      "age": 35,
      "asd_a1": "present",
      "asd_a2": "present",
      "asd_a3": "present",
      "asd_b1": "present",
      "asd_b2": "present",
      "asd_b3": "present",
      "asd_b4": "present",
      "asd_exc_intellectual_disability": "cleared",
      "asd_subj_impairment": "met",
      "asd_subj_early_onset": "met",
      "asd_subj_severity_social": "met",
      "asd_subj_severity_rrb": "met",
      "duration_days": 21,
      "onset_age": 1
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 338
    }
  },
  {
    "id": "vig_030_mdd_clear_3e0f991a",
    "ground_truth": [
      "mdd"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n64-year-old retired accountant presents with \"I feel worthless and can't get out of bed.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports a 3-week history beginning approximately 3 weeks ago after a minor argument with spouse. States, \"I cry all the time\" and \"I don't enjoy anything anymore.\" Describes depressed mood most of the day, nearly every day, appearing tearful in session. Reports marked loss of interest in hobbies: stopped attending weekly choir, no longer gardens or reads, stopped preparing meals. Reports 12 lb weight loss (~6% body weight) over three weeks without dieting and markedly decreased appetite. Reports difficulty initiating sleep and early morning awakening most nights. Family notes slowed movements and speech; examiner observed psychomotor retardation (slow gait, delayed responses). Describes pervasive fatigue, \"I have no energy to do laundry or pay bills.\" Reports pervasive feelings of worthlessness and excessive guilt: \"It's my fault my children are distant,\" described as excessive. Reports difficulty concentrating and making decisions (missed bills, unable to follow TV plots). Reports recurrent thoughts of death — \"I keep thinking about dying several times a day\" — and passive suicidal ideation without a specific plan; denies current intent. Two direct quotes above captured.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history, no prior psychiatric hospitalizations, no prior suicide attempts, no prior psychotropic medication trials.\n\n4. FAMILY HISTORY\nMother had long-standing episodes of low mood; sibling has history of alcohol problems.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nHypertension, hyperlipidemia. Substance use: drinks 1–2 glasses of wine nightly; denies recreational drug use; caffeine 1–2 cups coffee daily. TSH normal. Metabolic panel unremarkable. Toxicology negative. Medications: lisinopril 10 mg daily, atorvastatin 20 mg nightly, daily multivitamin, OTC melatonin as needed.\n\nPERTINENT NEGATIVES\nDenies hearing voices or seeing things. Denies periods of unusually high energy or decreased need for sleep. Denies recent head injury. Denies current suicidal plan or intent.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: older adult, slightly disheveled, decreased grooming. Behaviour: slowed movements. Speech: slowed, low volume, brief replies. Mood: reports feeling sad, empty, hopeless. Affect: constricted, tearful intermittently. Thought process: linear but slowed with poverty of spontaneous elaboration. Thought content: reports recurrent thoughts of death and passive suicidal ideation without a specific plan; no fixed false beliefs elicited. Perceptions: denies hallucinations. Insight: limited; recognizes change but minimizes severity.",
    "answers": {
      "age": 64,
      "mdd_a1": "present",
      "mdd_a2": "present",
      "mdd_a3": "present",
      "mdd_a4": "present",
      "mdd_a5": "present",
      "mdd_a6": "present",
      "mdd_a7": "present",
      "mdd_a8": "present",
      "mdd_a9": "present",
      "mdd_exc_substance": "cleared",
      "mdd_exc_medical": "cleared",
      "mdd_exc_psychotic": "cleared",
      "mdd_exc_bipolar": "cleared",
      "mdd_subj_clinical_significance": "met",
      "duration_days": 21
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 384
    }
  },
  {
    "id": "vig_031_gad_ptsd_comorbid_b88a103f",
    "ground_truth": [
      "gad",
      "ptsd"
    ],
    "difficulty": "COMORBID",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n60-year-old paramedic presents with \"I can't stop worrying and the memories keep coming back.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports a 6-month history of pervasive, excessive worry about work performance, family safety, and daily tasks, beginning after responding to a multi-vehicle collision in July 2025 during which his adult daughter was confirmed dead. He states, \"I go to work and replay every body I saw,\" and \"I jump at every noise at home.\" Describes repeated duty-related exposure to graphic injuries over many years and recent escalation after this incident. Reports recurrent intrusive images during the day, \"I get a flash of her face and it's like I'm back there,\" and nightmares several times per week that awaken him sweating. Describes dissociative episodes in which he momentarily feels transported back to the scene. Avoids driving past the highway where the collision occurred and declines ride-alongs; reports trying to push memories away but \"I can't control it.\" Reports persistent worry most days for approximately 6 months, difficulty controlling the worry, restlessness, feeling keyed up, easy fatigue, frequent irritability and angry outbursts at home, muscle tightness, difficulty falling and staying asleep, and frequent mind-blanking at work.\n\nDuration: Symptoms present for approximately 6 months; began July 2025 after the multi-vehicle collision and notification of daughter's death.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history. No prior psychiatric hospitalizations. No prior psychotherapy or psychotropic medication.\n\n4. FAMILY HISTORY\nFamily history notable for father's long-standing mood difficulties; no known formal psychiatric hospitalizations in close relatives.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nHypertension on lisinopril. Alcohol: 2–3 drinks on weekends. Recreational drugs: denies use. Caffeine: 2–3 cups coffee daily. Labs: TSH normal; metabolic panel unremarkable; toxicology negative. Medications: lisinopril 10 mg daily; melatonin 3 mg OTC nightly.\n\nPERTINENT NEGATIVES\nDenies visual or auditory hallucinations. Denies current suicidal ideation with plan or intent. Denies recreational drug use.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, slightly disheveled. Behavior: restless, fidgety, frequent startle. Mood: \"on edge, worn out.\" Affect: constricted, anxious. Thought content: intrusive memories and distressing dreams; reports flashback episodes; denies current suicidal ideation, no plan or intent; protective factors include spouse and employment responsibilities. Cognition: alert and oriented ×3, attention and concentration impaired with frequent mind-blanking. Insight: recognizes symptoms but attributes them to \"being a paramedic\" and expresses limited options for coping.",
    "answers": {
      "age": 60,
      "gad_a": "present",
      "gad_b": "present",
      "gad_c1": "present",
      "gad_c2": "present",
      "gad_c3": "present",
      "gad_c4": "present",
      "gad_c5": "present",
      "gad_c6": "present",
      "gad_exc_substance": "cleared",
      "gad_exc_medical": "cleared",
      "gad_exc_panic": "cleared",
      "gad_exc_social_anxiety": "cleared",
      "gad_exc_ocd": "cleared",
      "gad_exc_separation": "cleared",
      "gad_exc_ptsd": "cleared",
      "gad_exc_anorexia": "cleared",
      "gad_exc_somatic": "cleared",
      "gad_exc_bdd": "cleared",
      "gad_exc_illness_anxiety": "cleared",
      "gad_exc_psychotic": "cleared",
      "gad_subj_clinical_significance": "met",
      "gad_subj_excessive": "met",
      "duration_days": 194,
      "ptsd_a1": "present",
      "ptsd_a2": "present",
      "ptsd_a3": "present",
      "ptsd_a4": "present",
      "ptsd_b1": "present",
      "ptsd_b2": "present",
      "ptsd_b3": "present",
      "ptsd_b4": "present",
      "ptsd_b5": "present",
      "ptsd_c1": "present",
      "ptsd_c2": "present",
      "ptsd_d1": "present",
      "ptsd_d2": "present",
      "ptsd_d3": "present",
      "ptsd_d4": "present",
      "ptsd_d5": "present",
      "ptsd_d6": "present",
      "ptsd_d7": "present",
      "ptsd_e1": "present",
      "ptsd_e2": "present",
      "ptsd_e3": "present",
      "ptsd_e4": "present",
      "ptsd_e5": "present",
      "ptsd_e6": "present",
      "ptsd_exc_substance": "cleared",
      "ptsd_exc_medical": "cleared",
      "ptsd_exc_dissociative_substance": "cleared",
      "ptsd_exc_dissociative_medical": "cleared",
      "ptsd_subj_distress": "met",
      "ptsd_subj_trauma_quality": "met",
      "ptsd_subj_violent_accidental": "met"
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 389
    }
  },
  {
    "id": "vig_032_adhd_ambiguous_9f256fdc",
    "ground_truth": [
      "adhd"
    ],
    "difficulty": "AMBIGUOUS",
    "meets_criteria": false,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n38-year-old software engineer presents with \"I can't concentrate at work; I'm missing things and getting frustrated.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports longstanding problems beginning around age 24 but notes a clear worsening over the past 5 months. He states, \"I start tasks and then get sidetracked,\" and \"it's like my brain jumps around and I miss tiny things.\" Describes frequent careless errors in code reviews and documentation (overlooking variable names, missing edge cases), and several recent incidents where incomplete feature work required rework by colleagues. Reports avoiding lengthy code refactors or documentation, saying he \"puts it off until it's urgent.\" Gives examples of losing keys and misplacing his phone multiple times per week. Observed restlessness: taps foot in meetings, gets up frequently, and reports feeling driven to move when expected to sit through long standups. Notes interpersonal moments in meetings where he \"blurts out\" answers before questions completed and finds it difficult to wait his turn in discussions. Patient minimizes severity: \"I manage most days; it's annoying but not catastrophic.\" Timeline summarized: onset ~age 24, current exacerbation for approximately 5 months.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history and no prior psychiatric medications or hospitalizations reported.\n\n4. FAMILY HISTORY\nFather had episodes of prolonged low mood; no formal diagnoses reported in family.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nNo chronic medical conditions reported. Substance use: alcohol about 1–2 beers on weekends, denies recreational drug use, caffeine intake approximately 2–3 cups of coffee daily.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, well-groomed. Behaviour: restless in seat, frequent leg tapping, stands briefly during interview. Speech: normal rate and volume, occasionally interrupts interviewer. Mood: reports \"frustrated\" and \"tired of messing up.\" Affect: slightly constricted but appropriate to content. Thought process: generally goal-directed; occasional impulsive interjections and completion of others' sentences reported. Thought content: denies fixed false beliefs. Perceptions: denies hearing voices or other perceptual disturbances. Insight: acknowledges problems but minimizes impact and expresses uncertainty about need for formal help.\n\nPertinent negatives: Denies often not seeming to listen when spoken to directly. Denies often having difficulty organizing tasks and activities. Denies being easily distracted by extraneous stimuli. Denies being forgetful in daily activities.",
    "answers": {
      "age": 38,
      "adhd_a1a": "present",
      "adhd_a1b": "present",
      "adhd_a1c": "absent",
      "adhd_a1d": "present",
      "adhd_a1e": "absent",
      "adhd_a1f": "present",
      "adhd_a1g": "present",
      "adhd_a1h": "absent",
      "adhd_a1i": "absent",
      "adhd_a2a": "present",
      "adhd_a2b": "absent",
      "adhd_a2c": "present",
      "adhd_a2d": "present",
      "adhd_a2e": "present",
      "adhd_a2f": "absent",
      "adhd_a2g": "present",
      "adhd_a2h": "present",
      "adhd_a2i": "absent",
      "adhd_exc_psychotic": "cleared",
      "adhd_exc_mood": "cleared",
      "adhd_exc_anxiety": "cleared",
      "adhd_exc_dissociative": "cleared",
      "adhd_exc_personality": "cleared",
      "adhd_exc_substance": "cleared",
      "adhd_subj_functional_impairment": "not_met",
      "adhd_subj_developmental": "met",
      "adhd_subj_not_oppositional": "met",
      "duration_days": 177,
      "onset_age": 24
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 366
    }
  },
  {
    "id": "vig_033_ptsd_moderate_4ffad63b",
    "ground_truth": [
      "ptsd"
    ],
    "difficulty": "MODERATE",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n47-year-old delivery driver presents with \"I'm kind of stuck on it and I can't sleep\" as chief complaint.\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports direct involvement in a roadside assault approximately 5 weeks ago and states symptoms began shortly afterward. He describes \"I was there, I saw it happen to me, and it keeps coming back\" and \"sometimes I just try not to think about it — I kind of shut down.\" Since the event he reports recurrent, involuntary, intrusive memories of the incident (visual images and short sensory fragments) that interrupt daily tasks. He describes avoiding thinking or talking about the event, trying to stay busy to prevent memories. He endorses persistent negative statements about himself and others, saying \"I feel like I messed up and the world isn't safe\" and often blames himself for what occurred. Reports engaging in recklessly fast driving on a few occasions since the event and a recent episode of intentionally drinking to excess \"to numb things out.\" Sleep is disturbed; difficulty falling asleep, frequent awakenings, restless sleep, and daytime tiredness. Timeline: began approximately 5 weeks ago and has been ongoing.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\n4. FAMILY HISTORY\nFather alive, history of alcohol use noted by patient; no known psychiatric hospitalizations in family.\n\nPERTINENT NEGATIVES\nDenies witnessing, in person, the event(s) as it occurred to others.\nDenies learning that the traumatic event(s) occurred to a close family member or close friend (violent or accidental death).\nDenies experiencing repeated or extreme exposure to aversive details of the event(s) (e.g., work-related).\nDenies recurrent distressing dreams related to the event(s).\nDenies dissociative reactions/flashbacks in which the event seemed to recur.\nDenies intense or prolonged psychological distress at exposure to cues that symbolize the event(s).\nDenies marked physiological reactions to cues that symbolize the event(s).\nDenies avoidance of external reminders (people, places, conversations, activities, objects, situations) that arouse distressing memories.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nHypertension treated with lisinopril. Substance use: alcohol 3–4 times weekly with occasional heavy episodes; denies recreational drug use; caffeine 2–3 cups coffee daily. Labs: TSH normal; metabolic panel unremarkable; toxicology negative. Medications: lisinopril 10 mg daily; OTC ibuprofen PRN.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, slightly disheveled. Behavior: cooperative but restless. Mood: \"on edge\" reported. Affect: constricted, mood-congruent. Thought content: preoccupied with event; expresses self-blame; denies current plan or intent to harm others. Suicidal ideation: intermittent passive thoughts (\"sometimes I think it would be easier if I wasn't here\"), no plan, no intent; protective factors include children and close friend contact. Cognition: orientation intact/normal, attention and memory intact/normal. Insight: limited insight into severity but acknowledges functional impact.",
    "answers": {
      "age": 47,
      "ptsd_a1": "present",
      "ptsd_a2": "absent",
      "ptsd_a3": "absent",
      "ptsd_a4": "absent",
      "ptsd_b1": "present",
      "ptsd_b2": "absent",
      "ptsd_b3": "absent",
      "ptsd_b4": "absent",
      "ptsd_b5": "absent",
      "ptsd_c1": "present",
      "ptsd_c2": "absent",
      "ptsd_d1": "absent",
      "ptsd_d2": "present",
      "ptsd_d3": "present",
      "ptsd_d4": "absent",
      "ptsd_d5": "absent",
      "ptsd_d6": "absent",
      "ptsd_d7": "absent",
      "ptsd_e1": "absent",
      "ptsd_e2": "present",
      "ptsd_e3": "absent",
      "ptsd_e4": "absent",
      "ptsd_e5": "absent",
      "ptsd_e6": "present",
      "ptsd_exc_substance": "cleared",
      "ptsd_exc_medical": "cleared",
      "ptsd_exc_dissociative_substance": "cleared",
      "ptsd_exc_dissociative_medical": "cleared",
      "ptsd_subj_distress": "met",
      "ptsd_subj_trauma_quality": "met",
      "ptsd_subj_violent_accidental": "met",
      "duration_days": 37
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 445
    }
  },
  {
    "id": "vig_034_ptsd_preschool_moderate_e4f46b52",
    "ground_truth": [
      "ptsd_preschool"
    ],
    "difficulty": "MODERATE",
    "meets_criteria": true,
    "clinical_text": "5-year-old child brought by mother who reports \"He keeps playing the same scary house game and says 'it's happening again,'\" and \"He won't go into the garage or sleep alone anymore.\"\n\nHISTORY OF PRESENT ILLNESS\nMother reports that symptoms began approximately 1 month ago after the child was told that an incident happened to his father. \"He was told Daddy got hurt and since then he plays the same scene over and over,\" and \"Sometimes he just stares and doesn't hear me.\" Mother describes repetitive play in which the child positions figures to replay a scene of an adult being hurt and sometimes bangs toys loudly; at other times he becomes quiet and \"spaces out\" for several seconds. He refuses to enter the garage and declines visits to a neighbor's house that remind him of the event. Sleep problems: \"He says he has bad dreams and wakes up crying,\" and bedtime now requires prolonged rocking. Eating is slightly decreased; there has been one episode of daytime toileting accident in past two weeks. Increased clinginess to mother, more frequent tantrums, and trouble focusing on simple tasks such as puzzles or circle time at preschool.\n\nDEVELOPMENTAL HISTORY\nWalked at 12 months, first words by 12 months, combining words by 2 years; toilet trained during daytime by age 3. No prior early intervention or special education services.\n\nFAMILY HISTORY\nMother reports prior mental health treatment for herself; father denies current mental health treatment.\n\nMEDICAL HISTORY\nFull-term uncomplicated vaginal delivery. No chronic medical conditions. No current prescription medications; takes occasional acetaminophen as needed. Recent mild upper respiratory illness resolved. Substance use (caregiver): alcohol 1–2 times/week, denies recreational drug use, caffeine 1 cup coffee/day. Labs: TSH normal; metabolic panel unremarkable; toxicology negative.\n\nBEHAVIOURAL OBSERVATIONS / MENTAL STATUS EXAMINATION\nNeat, age-appropriate dress. Sat next to mother and hugged frequently; sought frequent reassurance. Eye contact variable; engaged with examiner intermittently. Affect tearful at times, flat during repetitive play. Play observed: narrow, repetitive reenactment of adult-injury scenes with loud noises and brief zoning episodes where child appeared detached. No observed verbal descriptions of memories. Startle response slightly exaggerated to loud sounds. Language and gross/fine motor skills developmentally appropriate. Concentration limited for structured tasks. Sleep disturbance and bedtime refusal reported.\n\nPertinent negatives: Caregiver denies child directly experiencing the event. Caregiver denies child witnessing the event in person. Caregiver denies recurrent, involuntary, and intrusive distressing memories. Caregiver denies recurrent distressing dreams explicitly linked to the event. Caregiver denies intense or prolonged psychological distress at exposure to cues. Caregiver denies marked physiological reactions to reminders. Caregiver denies avoidance of people, conversations, or interpersonal situations. Duration: Symptoms present for approximately 1 month(s).",
    "answers": {
      "age": 5,
      "ptsd_a1_child": "absent",
      "ptsd_a2_child": "absent",
      "ptsd_a3_child": "present",
      "ptsd_b1_child": "absent",
      "ptsd_b2_child": "absent",
      "ptsd_b3_child": "present",
      "ptsd_b4_child": "absent",
      "ptsd_b5_child": "absent",
      "ptsd_c1_child": "present",
      "ptsd_c2_child": "absent",
      "ptsd_c3_child": "absent",
      "ptsd_c4_child": "absent",
      "ptsd_c5_child": "absent",
      "ptsd_c6_child": "absent",
      "ptsd_d1_child": "absent",
      "ptsd_d2_child": "absent",
      "ptsd_d3_child": "absent",
      "ptsd_d4_child": "present",
      "ptsd_d5_child": "present",
      "ptsd_exc_substance_child": "cleared",
      "ptsd_exc_medical_child": "cleared",
      "ptsd_exc_dissociative_substance_child": "cleared",
      "ptsd_exc_dissociative_medical_child": "cleared",
      "ptsd_subj_distress_child": "met",
      "ptsd_subj_trauma_quality_child": "met",
      "duration_days": 37
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 440
    }
  },
  {
    "id": "vig_035_asd_clear_a09332db",
    "ground_truth": [
      "asd"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "38-year-old high school teacher presents with \"I get overwhelmed in groups and can't keep up a normal conversation.\"\n\nHISTORY OF PRESENT ILLNESS\nPatient reports a lifelong pattern of social and communication differences beginning around age 5. Symptoms have increased in frequency over the past three weeks, with current problems present for approximately 3 week(s) (began ~3 weeks ago). Patient describes: \"I talk about the same thing over and over,\" and \"I prefer to walk the same route and eat the same sandwich every day.\" Colleagues report patient rarely initiates conversations and often gives short, literal responses; patient admits to not returning texts from coworkers and says, \"I forget to answer unless it's about work tasks.\" Patient reports limited eye contact, stating \"I look at people's mouths because faces are hard to read.\" Patient demonstrates repetitive motor movements at the visit (finger tapping, flipping a pen) and reports lining up pens at the desk during planning periods. Patient uses brief echolalic phrases under stress, noting \"I'll repeat a question instead of answering it.\" Small changes to schedule cause marked distress; patient became highly agitated when a preferred classroom was reassigned two weeks ago. Patient reports intense preoccupation with timetables and a narrow interest in train schedules, spending several hours nightly reviewing routes. Reports heightened sensitivity to fluorescent lights and aversion to certain fabrics; notes little reaction to minor cuts, stating \"I barely notice when I burn my hand.\"\n\nPERTINENT NEGATIVES\nDenies suicidal ideation. Denies homicidal ideation. Denies auditory or visual hallucinations. Denies recent recreational substance use.\n\nPAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\nFAMILY HISTORY\nFather described as socially withdrawn; no formal behavioral treatment reported in family.\n\nMEDICAL HISTORY AND SUBSTANCES\nHistory of seasonal allergic rhinitis. Current medications: loratadine 10 mg daily. No prescribed psychotropic medications.\n\nMENTAL STATUS EXAMINATION\nAppearance: casually dressed, well-groomed. Behaviour: repetitive finger tapping, minimal spontaneous gestures. Speech: clear, literal, occasionally echolalic when anxious. Mood (subjective): \"frustrated.\" Affect (observed): restricted range, flat facial expression. Thought process: concrete, focused on routines; occasional perseveration on schedules. Cognition: alert and oriented ×3; attention variable on sustained tasks; immediate recall intact. Insight: limited regarding social impact of behaviors.",
    "answers": {
      "age": 38,
      "asd_a1": "present",
      "asd_a2": "present",
      "asd_a3": "present",
      "asd_b1": "present",
      "asd_b2": "present",
      "asd_b3": "present",
      "asd_b4": "present",
      "asd_exc_intellectual_disability": "cleared",
      "asd_subj_impairment": "met",
      "asd_subj_early_onset": "met",
      "asd_subj_severity_social": "met",
      "asd_subj_severity_rrb": "met",
      "duration_days": 21,
      "onset_age": 5
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 356
    }
  },
  {
    "id": "vig_036_mdd_ambiguous_b0aaf1b7",
    "ground_truth": [
      "mdd"
    ],
    "difficulty": "AMBIGUOUS",
    "meets_criteria": false,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n\"53-year-old high school teacher presents with \"I just don't enjoy anything anymore, not sure why.\"\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports a 1-week history of markedly reduced interest in activities that were previously pleasurable. \"I stopped going to my morning runs and I haven't opened my guitar in days,\" they state. Reports spending most of each day disengaged from hobbies and social invitations: \"I cancel plans and then tell people I'm busy.\" Patient notes a notable decrease in appetite over the past month with an estimated 6% body weight loss; weight loss reported began approximately four weeks ago, but the change in motivation and withdrawal began about 1 week ago. Describes difficulty concentrating at work and indecisiveness: misses details in lesson plans, needs to reread emails multiple times, and hesitates before making even routine decisions. Reports recurrent thoughts of death several times per day and acknowledges passive suicidal ideation without a specific plan or intent: \"Sometimes I think about not waking up, but I don't have a plan.\" Patient minimizes severity throughout interview, stating \"it's probably nothing\" and \"I'm just tired of things, I guess.\"\n\nPERTINENT NEGATIVES\nDenies depressed mood most of the day, nearly every day.\nDenies insomnia or hypersomnia nearly every day.\nDenies psychomotor agitation or retardation nearly every day.\nDenies fatigue or loss of energy nearly every day.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history. No past psychiatric hospitalizations or prior suicide attempts reported.\n\n4. FAMILY HISTORY\nFather had long-term alcohol use; no known family history of psychiatric hospitalization or suicide.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nHypertension managed by primary care.\nSubstance use: alcohol 1–2 drinks socially per week; denies recreational drug use; caffeine 2 cups coffee daily.\nLabs: TSH normal, metabolic panel unremarkable, toxicology negative.\nMedications: lisinopril 10 mg daily; occasional ibuprofen as needed.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, slightly underweight. Behaviour: cooperative, minimal psychomotor change observed. Speech: normal rate and volume. Mood: patient reports \"okay\" and minimizes distress. Affect: restricted range, mildly blunted. Thought process: linear but slowed in content generation; noted indecisiveness. Thought content: recurrent thoughts of death and passive suicidal ideation without plan; no delusional beliefs. Perceptions: denies hallucinations. Insight: limited; patient minimizes significance of symptoms.",
    "answers": {
      "age": 53,
      "mdd_a1": "absent",
      "mdd_a2": "present",
      "mdd_a3": "present",
      "mdd_a4": "absent",
      "mdd_a5": "absent",
      "mdd_a6": "absent",
      "mdd_a7": "absent",
      "mdd_a8": "present",
      "mdd_a9": "present",
      "mdd_exc_substance": "cleared",
      "mdd_exc_medical": "cleared",
      "mdd_exc_psychotic": "cleared",
      "mdd_exc_bipolar": "cleared",
      "mdd_subj_clinical_significance": "not_met",
      "duration_days": 11
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 372
    }
  },
  {
    "id": "vig_037_gad_ambiguous_2ac2f405",
    "ground_truth": [
      "gad"
    ],
    "difficulty": "AMBIGUOUS",
    "meets_criteria": false,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n35-year-old software engineer presents with \"I'm worrying a lot lately, but it's probably nothing.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports approximately 5 months of increasing excessive worry and apprehensive expectation, beginning around August 2025, occurring most days and focused primarily on work performance and upcoming deadlines. Reports difficulty controlling the worry: \"I can't shut my brain off about projects,\" and \"I keep imagining the worst-case scenario before every meeting.\" Provides concrete examples: spending 2–3 extra hours nightly reviewing code, repeatedly re-reading email threads, and over-preparing for presentations. Denies that this has completely stopped work: \"I still get things done, it just takes longer.\" States uncertainty about severity and minimises need for treatment at times: \"Maybe I'm just stressed, not sure it's a big deal.\" Symptoms interfere with ability to delegate tasks and cause avoidance of volunteering for new responsibilities.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\n4. FAMILY HISTORY\nMother experienced long-term worry and sought counseling in the past; no hospitalizations reported in family.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nNo significant medical conditions reported. Substance use: alcohol 1–2 drinks per week, no recreational drug use, caffeine 2–3 cups coffee daily. Labs: TSH normal; metabolic panel unremarkable; toxicology negative. Medications: no current prescription medications; OTC: occasional ibuprofen and melatonin.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: tidy, casually dressed. Behaviour: cooperative, engaged. Speech: normal rate and volume. Mood (subjective): \"a bit stressed, preoccupied.\" Affect (observed): mildly tense, appropriate to content. Thought process: linear and goal-directed but preoccupied with worry about performance and future events. Thought content: no delusional ideas; no suicidal or homicidal ideation expressed. Cognition: oriented x3; attention and concentration appear intact on bedside testing; immediate and delayed recall intact/normal. Insight: limited to fair; patient minimises severity and is uncertain about need for intervention.\n\nPertinent negatives: Denies restlessness or feeling keyed up or on edge. Denies being easily fatigued. Denies difficulty concentrating or mind going blank. Denies irritability.",
    "answers": {
      "age": 35,
      "gad_a": "present",
      "gad_b": "present",
      "gad_c1": "absent",
      "gad_c2": "absent",
      "gad_c3": "absent",
      "gad_c4": "absent",
      "gad_c5": "absent",
      "gad_c6": "absent",
      "gad_exc_substance": "cleared",
      "gad_exc_medical": "cleared",
      "gad_exc_panic": "cleared",
      "gad_exc_social_anxiety": "cleared",
      "gad_exc_ocd": "cleared",
      "gad_exc_separation": "cleared",
      "gad_exc_ptsd": "cleared",
      "gad_exc_anorexia": "cleared",
      "gad_exc_somatic": "cleared",
      "gad_exc_bdd": "cleared",
      "gad_exc_illness_anxiety": "cleared",
      "gad_exc_psychotic": "cleared",
      "gad_subj_clinical_significance": "met",
      "gad_subj_excessive": "not_met",
      "duration_days": 177
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 323
    }
  },
  {
    "id": "vig_038_adhd_moderate_8ef48dd4",
    "ground_truth": [
      "adhd"
    ],
    "difficulty": "MODERATE",
    "meets_criteria": true,
    "clinical_text": "37-year-old project manager presents with \"I can't keep track of anything and I can't stay focused; it's kind of ruining my work.\"\n\nHISTORY OF PRESENT ILLNESS\nPatient reports approximately 6 months of worsening problems with attention and organization, began about 6 months ago after a change in role at work; notes first onset of similar behaviors around age 4. States, \"I sometimes miss stuff on reports and my work ends up inaccurate,\" and \"I kind of fidget a lot and can't sit through long meetings.\" Describes frequent careless errors in documents, difficulty sustaining focus during long meetings and reading, and trouble organizing multi-step projects — \"my desk is messy and I lose deadlines.\" Avoids paperwork and lengthy forms, reports regularly misplacing keys, phone, and paperwork, and forgetting appointments and to pay bills. Endorses tapping hands/feet, getting up from seat in meetings, talking more than others, blurting answers in conversations, and interrupting colleagues. Timeline: steady baseline since onset, with noted escalation over past 6 months as job demands increased.\n\nPertinent negatives: Denies often does not seem to listen when spoken to directly. Denies often does not follow through on instructions and fails to finish tasks. Denies being easily distracted by extraneous stimuli. Denies running about or climbing in inappropriate situations.\n\nPAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\nFAMILY HISTORY\nFamily history notable for father who had long-standing difficulties with concentration and organization.\n\nMEDICAL HISTORY AND SUBSTANCES\nMedical history noncontributory. Alcohol: 1–2 drinks on weekends. Recreational drugs: denies regular use; occasional cannabis use monthly. Caffeine: 2–3 cups coffee daily.\n\nMENTAL STATUS EXAMINATION\nAppearance: casually dressed, slightly disheveled. Behavior: restless during interview, frequently taps foot and shifts in seat. Speech: slightly rapid, sometimes interrupts interviewer. Mood: \"frustrated and tired.\" Affect: mildly irritable, broadly congruent with mood. Thought process: goal-directed but occasionally premature responses and interruptive comments. Thought content: denies fixed false beliefs. Perceptions: denies hallucinations. Insight: acknowledges problems and expresses motivation to improve. No suicidal or homicidal ideation reported.",
    "answers": {
      "age": 37,
      "adhd_a1a": "present",
      "adhd_a1b": "present",
      "adhd_a1c": "absent",
      "adhd_a1d": "absent",
      "adhd_a1e": "present",
      "adhd_a1f": "present",
      "adhd_a1g": "present",
      "adhd_a1h": "absent",
      "adhd_a1i": "present",
      "adhd_a2a": "present",
      "adhd_a2b": "present",
      "adhd_a2c": "absent",
      "adhd_a2d": "present",
      "adhd_a2e": "absent",
      "adhd_a2f": "present",
      "adhd_a2g": "present",
      "adhd_a2h": "absent",
      "adhd_a2i": "present",
      "adhd_exc_psychotic": "cleared",
      "adhd_exc_mood": "cleared",
      "adhd_exc_anxiety": "cleared",
      "adhd_exc_dissociative": "cleared",
      "adhd_exc_personality": "cleared",
      "adhd_exc_substance": "cleared",
      "adhd_subj_functional_impairment": "met",
      "adhd_subj_developmental": "met",
      "adhd_subj_not_oppositional": "met",
      "duration_days": 187,
      "onset_age": 4
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 326
    }
  },
  {
    "id": "vig_039_ptsd_clear_b395ef39",
    "ground_truth": [
      "ptsd"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "61-year-old retired firefighter presents with \"I can't get the blast out of my head, I feel like I'm back there every time I close my eyes.\"\n\nHISTORY OF PRESENT ILLNESS\nPatient reports onset approximately one month ago after responding to a tanker explosion on 12/10/2025 in which he was on scene and suffered minor burns. He describes directly experiencing the event and witnessing coworkers and bystanders severely injured and one close friend pronounced dead on scene; he later learned his brother died in a related traffic accident that same night. Patient states, \"I smelled burning and I keep smelling it in my kitchen,\" and \"I wake up sweating and see the truck flipping again.\" Reports repeated exposure to graphic scenes as part of his role that night and in subsequent debriefings. Describes recurrent, involuntary images of people trapped and flames, recurrent nightmares replaying the explosion, and episodes in which he feels transported back to the scene (states he \"acts like I'm right there,\" freezes, and cannot hear others). Notes intense distress and palpitations when he hears sirens or passes the highway overpass; reports marked avoidance of the overpass, news about the event, and coworkers who talk about the night. Cannot recall specific moments immediately before the blast (gap in memory). Expresses persistent negative beliefs: \"I should have saved him,\" and \"the world is dangerous.\" Reports persistent guilt, numbness, withdrawal from volunteer fire station, frequent irritability with spouse (yelled and threw a toolbox last week), increased alcohol use some evenings, hypervigilance, pronounced startle to loud noises, poor concentration at home, and difficulty falling and staying asleep.\n\nPERTINENT NEGATIVES (explicitly deny these):\nDenies hearing voices; Denies seeing things that others do not; Denies current intent to harm others.\n\nDURATION: Symptoms present for approximately 1 month(s). Began on or about 12/10/2025.\n\nFUNCTIONAL IMPACT\n- Work/academic: Stopped attending volunteer shifts and training; avoids field-related tasks.\n- Relationships: Withdrawn from spouse and friends; several arguments; decreased participation in family events.\n- Daily activities: Avoids driving past incident site, skips community meetings, difficulty completing household tasks.\n\nPAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\nFAMILY HISTORY\nFather had alcohol problems; no known psychiatric hospitalizations in family.\n\nMEDICAL HISTORY AND SUBSTANCES\nHTN on lisinopril 10 mg qd, ibuprofen PRN. Alcohol: 3–4 beers most evenings recently; recreational drugs: denies; caffeine: two cups coffee daily. TSH normal; metabolic panel unremarkable; toxicology negative.\n\nMENTAL STATUS EXAMINATION\nAppears his stated age, mildly disheveled, guarded. Behavior anxious, repeatedly scanning room. Mood: \"on edge, guilty\"; affect constricted, tearful at times. Thought content: vivid intrusive memories; no delusional content elicited. Suicidal ideation: passive wishes reported one time in past week without plan or intent; protective factors: spouse support, children, religious involvement. Cognition: oriented x3; concentration impaired on serial 7s. Insight: acknowledges symptoms and relationship to event but limited understanding of coping strategies.",
    "answers": {
      "age": 61,
      "ptsd_a1": "present",
      "ptsd_a2": "present",
      "ptsd_a3": "present",
      "ptsd_a4": "present",
      "ptsd_b1": "present",
      "ptsd_b2": "present",
      "ptsd_b3": "present",
      "ptsd_b4": "present",
      "ptsd_b5": "present",
      "ptsd_c1": "present",
      "ptsd_c2": "present",
      "ptsd_d1": "present",
      "ptsd_d2": "present",
      "ptsd_d3": "present",
      "ptsd_d4": "present",
      "ptsd_d5": "present",
      "ptsd_d6": "present",
      "ptsd_d7": "present",
      "ptsd_e1": "present",
      "ptsd_e2": "present",
      "ptsd_e3": "present",
      "ptsd_e4": "present",
      "ptsd_e5": "present",
      "ptsd_e6": "present",
      "ptsd_exc_substance": "cleared",
      "ptsd_exc_medical": "cleared",
      "ptsd_exc_dissociative_substance": "cleared",
      "ptsd_exc_dissociative_medical": "cleared",
      "ptsd_subj_distress": "met",
      "ptsd_subj_trauma_quality": "met",
      "ptsd_subj_violent_accidental": "met",
      "duration_days": 37
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 467
    }
  },
  {
    "id": "vig_040_ptsd_preschool_clear_47a7dbd3",
    "ground_truth": [
      "ptsd_preschool"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "DEMOGRAPHICS AND CHIEF COMPLAINT\n4-year-old child brought by mother who reports \"He keeps replaying the bad day and won't sleep. He's scared all the time.\"\n\nHISTORY OF PRESENT ILLNESS\nMother reports symptoms began approximately 1 month ago after an incident at home where child directly experienced and witnessed a frightening event involving a caregiver. \"He was there when it happened and now plays it over and over,\" mother states. \"He screams if we talk about that room,\" she adds. \"Some nights he wakes up calling for me and says he had a bad dream.\" Changes noted: repetitive, graphic play reenactments of the incident; increased clinginess to mother; frequent, intense temper tantrums with kicking and hitting; reduced interest in previously enjoyed games. Sleep disrupted with multiple night wakings and reported \"bad dreams\" several times per week. Appetite mildly decreased; occasional stool accidents noted over the past two weeks. Mother reports episodes where child suddenly freezes and appears elsewhere in thought for several seconds. Duration: symptoms present for approximately 1 month, beginning after the household incident on [date approximate: 1 month prior].\n\nDEVELOPMENTAL HISTORY\nWalked at 12 months, first words at 10 months, combining words by age 2; age-appropriate fine and gross motor skills. No prior developmental evaluations; language and play development reportedly within expected range.\n\nFAMILY HISTORY\nMother reports prior engagement with mental health services for herself; no formal information about siblings.\n\nMEDICAL HISTORY\nFull-term vaginal birth without complications. No chronic medical conditions. No current prescription medications; occasional ibuprofen as needed. Caregiver reports no prenatal substance exposure. Caregiver substance use: alcohol rarely (social), no recreational drugs, uses caffeine daily. Labs: TSH normal, metabolic panel unremarkable, toxicology negative.\n\nPERTINENT NEGATIVES\nCaregiver denies suicidal or self-injurious behavior. Caregiver denies recent fevers or acute illness. No loss of motor skills observed. No prior hospitalizations for behavioral concerns.\n\nBEHAVIOURAL OBSERVATIONS / MENTAL STATUS EXAMINATION\nWell-groomed, age-appropriate dress. During play, child engaged in repetitive, trauma-themed reenactment with toy figures, frequently returning to the same scenario. Eye contact variable; alternated between clingy proximity to mother and withdrawing to corner. Affect flat to fearful when topic touched; tearful episodes when asked about home. Startle response exaggerated when door banged. Brief dissociative-looking pauses observed. Language goal-directed; speech age-appropriate. Play constricted and repetitive. Marked separation distress when mother briefly stepped away. Attention span shortened during tasks.",
    "answers": {
      "age": 4,
      "ptsd_a1_child": "present",
      "ptsd_a2_child": "present",
      "ptsd_a3_child": "present",
      "ptsd_b1_child": "present",
      "ptsd_b2_child": "present",
      "ptsd_b3_child": "present",
      "ptsd_b4_child": "present",
      "ptsd_b5_child": "present",
      "ptsd_c1_child": "present",
      "ptsd_c2_child": "present",
      "ptsd_c3_child": "present",
      "ptsd_c4_child": "present",
      "ptsd_c5_child": "present",
      "ptsd_c6_child": "present",
      "ptsd_d1_child": "present",
      "ptsd_d2_child": "present",
      "ptsd_d3_child": "present",
      "ptsd_d4_child": "present",
      "ptsd_d5_child": "present",
      "ptsd_exc_substance_child": "cleared",
      "ptsd_exc_medical_child": "cleared",
      "ptsd_exc_dissociative_substance_child": "cleared",
      "ptsd_exc_dissociative_medical_child": "cleared",
      "ptsd_subj_distress_child": "met",
      "ptsd_subj_trauma_quality_child": "met",
      "duration_days": 37
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 386
    }
  },
  {
    "id": "vig_041_asd_clear_069fc5dc",
    "ground_truth": [
      "asd"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n\"42-year-old software engineer presents with \"I can't keep up with people and routines make me panic.\"\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports difficulty with social interaction and strict routines for many years, with a recent increase in distress beginning approximately three weeks ago. Duration: Symptoms present for approximately 3 week(s); began about three weeks ago with more frequent upset episodes. Onset: Symptoms first appeared around age 2. He describes limited reciprocal conversation: \"I usually answer, but I don't know how to follow up,\" and gives examples of ending conversations abruptly when asked open-ended questions. Reports minimal sharing of emotions or interests; when excited about a topic he will speak at length without checking others' reactions: \"I talk about trains for 20 minutes and they stare.\" Observed deficits in nonverbal communication — poor eye contact, flat facial expression, and minimal gestures; he reports others interpret him as uninterested. He reports lining up objects at home and at work (arranging pens and cables in precise order) and repeating short phrases heard on podcasts. He insists on same route to work and same lunch; \"If someone moves my food I get very upset and can't focus.\" Reports intense preoccupation with timetables and mechanical parts, spending hours reading manuals. Describes sensitivity to certain sounds (vacuum, fluorescent buzz) and a tendency to stare at moving ceiling fans for extended periods. FUNCTIONAL IMPACT: At work he misses cues in meetings, is reprimanded for abrupt comments, and has difficulty with collaborative tasks; relationships limited to family and one coworker, reports difficulty making and keeping friends; daily routines require fixed rituals (meals, routes) that cause significant time loss and distress when disrupted.\n\nPERTINENT NEGATIVES\nDenies suicidal ideation. Denies homicidal ideation. Denies hearing voices or seeing things that others do not. Denies belief that others control thoughts. Denies current recreational drug use.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\n4. FAMILY HISTORY\nFather alive, no formal psychiatric treatment reported; maternal uncle reportedly had longstanding social difficulties.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nHypertension, on lisinopril 10 mg daily. No other chronic medical conditions. Drinks one beer weekly. Denies tobacco and illicit drug use.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: neatly dressed, groomed. Behavior: cooperative but limited initiation of social reciprocity. Speech: normal rate and volume, monotone at times. Mood (subjective): \"frustrated and tired.\" Affect (observed): restricted, minimal facial expression. Thought process: concrete, focused on specific topics, some perseveration. Cognition: oriented x3, attention intact for focused tasks, mild difficulty with abstract social inference. Insight: limited awareness of social impact of behaviors.",
    "answers": {
      "age": 42,
      "asd_a1": "present",
      "asd_a2": "present",
      "asd_a3": "present",
      "asd_b1": "present",
      "asd_b2": "present",
      "asd_b3": "present",
      "asd_b4": "present",
      "asd_exc_intellectual_disability": "cleared",
      "asd_subj_impairment": "met",
      "asd_subj_early_onset": "met",
      "asd_subj_severity_social": "met",
      "asd_subj_severity_rrb": "met",
      "duration_days": 21,
      "onset_age": 2
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 426
    }
  },
  {
    "id": "vig_042_mdd_moderate_0ab06be0",
    "ground_truth": [
      "mdd"
    ],
    "difficulty": "MODERATE",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n28-year-old graphic designer presents with \"I just don't enjoy anything anymore, kind of going through the motions.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports a change that began approximately 3 weeks ago. \"It started about three weeks back and it's kind of stayed the same,\" they state. They describe markedly reduced interest in usual activities — stopped attending a weekend art group, no longer listening to music they used to like, and avoiding social invitations: \"I sometimes push people away because I don't feel like showing up.\" They report decreased appetite with weight loss of approximately 6% of body weight over the past month without dieting, noting clothes feel looser. Sleep disturbance described as difficulty initiating sleep most nights, averaging 3–4 hours before waking and trouble returning to sleep. Persistent fatigue \"almost all day, every day,\" even after brief naps, is reported. Patient expresses frequent feelings of worthlessness and excessive guilt about small mistakes: \"I kind of feel like I'm a burden and it's my fault when things go wrong,\" stated twice. Duration: Approximately 3 week(s); began about three weeks ago. Denies depressed mood most of the day. Denies psychomotor agitation or retardation. Denies diminished ability to think or concentrate. Denies recurrent thoughts of death or suicidal ideation.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\n4. FAMILY HISTORY\nMother received counseling in the past for emotional difficulties; no other known family psychiatric treatment reported.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nMedical history otherwise noncontributory. Substance use: drinks alcohol socially, about 1–2 drinks on weekends; denies recreational drug use; consumes approximately 2 cups of coffee daily. Labs: TSH normal, metabolic panel unremarkable, toxicology negative. Medications: none prescribed; occasional OTC ibuprofen.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, well-groomed. Behaviour: cooperative, appropriate eye contact. Speech: normal rate and volume. Mood: patient reports \"not really into things\" and \"kind of tired all the time.\" Affect: constricted range, congruent with stated mood. Thought process: linear and goal-directed. Thought content: expresses pervasive feelings of worthlessness and excessive guilt; no fixed false beliefs elicited. Perceptions: denies hallucinations. Insight: limited — acknowledges change but minimizes need for help. No psychomotor agitation or retardation observed.",
    "answers": {
      "age": 28,
      "mdd_a1": "absent",
      "mdd_a2": "present",
      "mdd_a3": "present",
      "mdd_a4": "present",
      "mdd_a5": "absent",
      "mdd_a6": "present",
      "mdd_a7": "present",
      "mdd_a8": "absent",
      "mdd_a9": "absent",
      "mdd_exc_substance": "cleared",
      "mdd_exc_medical": "cleared",
      "mdd_exc_psychotic": "cleared",
      "mdd_exc_bipolar": "cleared",
      "mdd_subj_clinical_significance": "met",
      "duration_days": 21
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 362
    }
  },
  {
    "id": "vig_043_gad_clear_cc8e3967",
    "ground_truth": [
      "gad"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "34-year-old software engineer presents with \"I can't stop worrying about work and it's wrecking my sleep.\"\n\nHISTORY OF PRESENT ILLNESS:\nPatient reports a roughly 6-month history of pervasive worry beginning approximately July 2025, describing worry about multiple areas of life, primarily job performance, finances, and family responsibilities. \"I replay meetings and emails in my head for hours,\" and \"my mind just goes blank in meetings\" are reported verbatim. Worry occurs more days than not and the patient states it is difficult to control: spends 1–3 hours nightly ruminating, reviews tasks repeatedly, and avoids volunteering for presentations. Describes persistent restlessness (\"feel keyed up\"), easy fatigue despite naps, frequent muscle tightness in neck and shoulders, and episodes of irritability with partner (snapping over minor things). Sleep is disturbed: difficulty falling asleep (often >60 minutes), waking around 2–3 AM with racing thoughts, and unrefreshing sleep. Reports trouble concentrating at work, missed a project deadline and several small errors on routine code reviews attributed to mind going blank. Uses increased caffeine (3–4 cups/day) to counter fatigue.\n\nPERTINENT NEGATIVES:\nDenies suicidal ideation, homicidal ideation, self-harm behaviors. Denies visual or auditory hallucinations. Denies recent memory loss beyond intermittent concentration lapses. Denies current recreational drug use.\n\nPAST PSYCHIATRIC HISTORY:\nNo prior psychiatric history; no prior medications or hospitalizations for psychiatric reasons.\n\nFAMILY HISTORY:\nFather treated with long-term medication for persistent worry and sleep problems.\n\nMEDICAL HISTORY AND SUBSTANCES:\nMedical history otherwise unremarkable. Alcohol: 2–3 drinks weekly. Recreational drugs: denies. Caffeine: 3–4 cups coffee daily. Labs: TSH normal; metabolic panel unremarkable; toxicology negative. Medications: occasional ibuprofen, daily multivitamin.\n\nMENTAL STATUS EXAMINATION:\nAppearance: casually dressed, well-groomed. Behaviour: cooperative, slightly restless (fidgeting). Speech: normal rate and volume. Mood (reported): \"tense and tired.\" Affect (observed): constricted, anxious-appearing. Thought process: coherent, goal-directed but preoccupied with worry content. Cognition: alert, oriented x3; concentration impaired during testing (serial 7s challenging). Insight: recognizes symptoms and reports desire for help.",
    "answers": {
      "age": 34,
      "gad_a": "present",
      "gad_b": "present",
      "gad_c1": "present",
      "gad_c2": "present",
      "gad_c3": "present",
      "gad_c4": "present",
      "gad_c5": "present",
      "gad_c6": "present",
      "gad_exc_substance": "cleared",
      "gad_exc_medical": "cleared",
      "gad_exc_panic": "cleared",
      "gad_exc_social_anxiety": "cleared",
      "gad_exc_ocd": "cleared",
      "gad_exc_separation": "cleared",
      "gad_exc_ptsd": "cleared",
      "gad_exc_anorexia": "cleared",
      "gad_exc_somatic": "cleared",
      "gad_exc_bdd": "cleared",
      "gad_exc_illness_anxiety": "cleared",
      "gad_exc_psychotic": "cleared",
      "gad_subj_clinical_significance": "met",
      "gad_subj_excessive": "met",
      "duration_days": 187
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 314
    }
  },
  {
    "id": "vig_044_adhd_moderate_458b6246",
    "ground_truth": [
      "adhd"
    ],
    "difficulty": "MODERATE",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n19-year-old college student presents with \"I kind of can't stay focused in class and I'm always interrupting people.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports a long-standing history of concentration and activity-level difficulties, stating \"I guess it's been like this forever, since I was little, but it's been worse the past 6 months.\" Symptoms present for approximately 6 month(s), began approximately 6 months ago. Patient reports difficulty sustaining attention during lectures and long readings, saying \"I start reading and then my mind drifts and I have to re-read paragraphs.\" Describes frequent episodes of not seeming to listen when spoken to directly—\"people tell me my face is there but my mind is somewhere else, even when nothing else is happening.\" Avoids lengthy paperwork and report preparation, reports misplacing phone, keys, and notebooks several times per week. Notes being easily distracted by external stimuli and by unrelated thoughts. Describes internal restlessness and feeling \"on the go,\" uncomfortable sitting in lectures or restaurants; reports sometimes getting up inappropriately in group settings during adolescence and now feeling restless rather than climbing. Admits talking a lot, blurting answers before questions complete, difficulty waiting in line, and frequent interruptions in conversations. Timeline: symptoms first appeared around age 3; exacerbation and increased functional interference noted over past 6 months.\n\nPertinent negatives: Denies often fails to give close attention to details or makes careless mistakes in schoolwork; Denies often does not follow through on instructions and fails to finish tasks; Denies often has difficulty organizing tasks and activities; No fidgeting with or taps hands or feet or squirms in seat observed.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\n4. FAMILY HISTORY\nNo known family psychiatric history.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nNo chronic medical problems reported. Alcohol: social, approximately 1–2 drinks once weekly. Recreational drugs: denies current use. Caffeine: 2–3 cups coffee daily.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, grooming adequate. Behaviour: restless in chair, frequently shifts posture and stands once to retrieve bag. Speech: talkative, slightly rapid; interrupts at times. Mood: \"a bit frustrated.\" Affect: full range, appropriate. Thought process: goal-directed but occasionally premature answering and interrupting examiner. Thought content: denies fixed false beliefs. Perceptions: denies hallucinations. Insight: limited—acknowledges problems but minimizes some impact on functioning.",
    "answers": {
      "age": 19,
      "adhd_a1a": "absent",
      "adhd_a1b": "present",
      "adhd_a1c": "present",
      "adhd_a1d": "absent",
      "adhd_a1e": "absent",
      "adhd_a1f": "present",
      "adhd_a1g": "present",
      "adhd_a1h": "present",
      "adhd_a1i": "present",
      "adhd_a2a": "absent",
      "adhd_a2b": "absent",
      "adhd_a2c": "present",
      "adhd_a2d": "absent",
      "adhd_a2e": "present",
      "adhd_a2f": "present",
      "adhd_a2g": "present",
      "adhd_a2h": "present",
      "adhd_a2i": "present",
      "adhd_exc_psychotic": "cleared",
      "adhd_exc_mood": "cleared",
      "adhd_exc_anxiety": "cleared",
      "adhd_exc_dissociative": "cleared",
      "adhd_exc_personality": "cleared",
      "adhd_exc_substance": "cleared",
      "adhd_subj_functional_impairment": "met",
      "adhd_subj_developmental": "met",
      "adhd_subj_not_oppositional": "met",
      "duration_days": 187,
      "onset_age": 3
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 376
    }
  },
  {
    "id": "vig_045_ptsd_moderate_4c538a99",
    "ground_truth": [
      "ptsd"
    ],
    "difficulty": "MODERATE",
    "meets_criteria": true,
    "clinical_text": "28-year-old software engineer presents with \"I'm kind of on edge and I can't really enjoy anything since the crash.\"\n\nHISTORY OF PRESENT ILLNESS\nPatient reports involvement in a motor vehicle collision approximately 1 month ago, beginning around 12/10/2025. Patient states they directly experienced the event and were in the vehicle at the time. Since then they report being \"kind of jumpy around loud noises\" and that \"smells like gasoline or big trucks make me feel really bad.\" Describes persistent low mood and guilt—\"I feel angry and guilty a lot, like I should've done something differently\"—and an inability to feel pleasure from usual activities (stopped going to weekend hikes and says hobbies \"just aren't fun anymore\"). Reports avoidance of external reminders: avoids driving over the river bridge, declines social outings that involve passing the crash site, and leaves conversations that mention cars or accidents. Describes hypervigilance: checks locks repeatedly, scans parking lots, reports sleeping lightly and waking to small noises. Notes trouble concentrating at work with increased errors and missed deadlines; \"I kind of drift off in meetings and then it takes me longer to get back on track.\" Symptoms began after the incident and have been present for approximately 1 month.\n\nPERTINENT NEGATIVES\nDenies witnessing, in person, the event(s) as it occurred to others.\nDenies learning that the traumatic event(s) occurred to a close family member or close friend (violent or accidental death).\nDenies experiencing repeated or extreme exposure to aversive details of the traumatic event(s) (e.g., first responders; not through media unless work-related).\nDenies recurrent, involuntary, and intrusive distressing memories of the traumatic event(s).\nDenies recurrent distressing dreams in which the content and/or affect of the dream are related to the traumatic event(s).\nDenies dissociative reactions (e.g., flashbacks) in which the individual feels or acts as if the traumatic event(s) were recurring.\nDenies marked physiological reactions to internal or external cues that symbolize or resemble an aspect of the traumatic event(s).\nDenies avoidance of or efforts to avoid distressing memories, thoughts, or feelings about or closely associated with the traumatic event(s).\n\nPAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\nFAMILY HISTORY\nFamily history noncontributory.\n\nMEDICAL HISTORY AND SUBSTANCES\nNo chronic medical conditions reported. Alcohol: 1–2 drinks on weekends; recreational drugs: denies use; caffeine: ~2 cups coffee daily. TSH normal. Metabolic panel unremarkable. Toxicology negative. Medications: ibuprofen PRN, no current prescriptions.\n\nFUNCTIONAL IMPACT\nWork: reduced concentration, missed deadlines, decreased productivity.\nRelationships: increased irritability with partner, avoids shared activities that require driving.\nDaily activities: avoids specific routes and places, disrupted sleep, reduced engagement in self-care and hobbies.\n\nMENTAL STATUS EXAMINATION\nAppearance: casually dressed, hygiene adequate. Behavior: alert, slightly restless, repeatedly scans room. Mood: reports \"on edge, sad, guilty.\" Affect: constricted, mood-congruent. Thought content: denies suicidal ideation; no plan or intent; protective factors include partner and employment. Perception: no hallucinations reported. Cognition: oriented x3, attention and concentration impaired per patient and brief tasks (difficulty with serial 7s). Insight: acknowledges symptoms and impact; judgment intact.",
    "answers": {
      "age": 28,
      "ptsd_a1": "present",
      "ptsd_a2": "absent",
      "ptsd_a3": "absent",
      "ptsd_a4": "absent",
      "ptsd_b1": "absent",
      "ptsd_b2": "absent",
      "ptsd_b3": "absent",
      "ptsd_b4": "present",
      "ptsd_b5": "absent",
      "ptsd_c1": "absent",
      "ptsd_c2": "present",
      "ptsd_d1": "absent",
      "ptsd_d2": "absent",
      "ptsd_d3": "absent",
      "ptsd_d4": "present",
      "ptsd_d5": "absent",
      "ptsd_d6": "absent",
      "ptsd_d7": "present",
      "ptsd_e1": "absent",
      "ptsd_e2": "absent",
      "ptsd_e3": "present",
      "ptsd_e4": "absent",
      "ptsd_e5": "present",
      "ptsd_e6": "absent",
      "ptsd_exc_substance": "cleared",
      "ptsd_exc_medical": "cleared",
      "ptsd_exc_dissociative_substance": "cleared",
      "ptsd_exc_dissociative_medical": "cleared",
      "ptsd_subj_distress": "met",
      "ptsd_subj_trauma_quality": "met",
      "ptsd_subj_violent_accidental": "met",
      "duration_days": 37
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 491
    }
  },
  {
    "id": "vig_046_ptsd_preschool_moderate_fdae333c",
    "ground_truth": [
      "ptsd_preschool"
    ],
    "difficulty": "MODERATE",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n5-year-old child brought by mother who reports \"He won't stop acting like the night we were at the hospital\" and \"He screams and throws things for no reason.\"\n\n2. HISTORY OF PRESENT ILLNESS\nMother reports child was present and witnessed an incident in which she was injured at home approximately 1 month ago. \"He saw me on the floor and keeps playing that same scene with his toys,\" she states. Mother describes increased frequency of upset, fear, and shame: \"He looks scared for no reason and cries when he hears loud noises.\" Timeline: symptoms began about one month ago, shortly after the event. Child's play has shifted from simple pretend to repetitive reenactment of the incident (placing dolls in hurt positions, making siren noises). Sleep has become fragmented; mother notes frequent nights waking and reports \"he says he had bad dreams\" but cannot provide specific content. Appetite mildly decreased; occasional toileting accidents over past two weeks after being consistently dry. Attachment has changed — increased clinginess, refusing brief separations at preschool and at home. Emotional regulation impaired with frequent, intense temper outbursts (yelling, hitting walls, throwing toys) several times per week.\n\nCaregiver denies that the child directly experienced the event in the sense of being physically harmed. Caregiver denies that the child was only told about the event happening to a caregiver rather than witnessing it. Caregiver denies knowledge of recurrent distressing dreams with clear content linked to the incident. Caregiver denies observed episodes in which the child appears to lose touch with the present (no dissociative-like episodes reported). Caregiver denies intense or prolonged distress when exposed to reminders observed at home. Caregiver denies marked physical reactions (e.g., fainting, vomiting) to reminders. Caregiver denies a persistent pattern of avoiding all activities or places because of the event, though child has begun refusing specific situations.\n\n3. DEVELOPMENTAL HISTORY\nWalked at ~12 months, first words around 12 months, combining words by 2 years. No prior developmental evaluations; caregiver reports age-appropriate gross motor skills.\n\n4. FAMILY HISTORY\nMother reports prior treatment for episodic low mood; father no known mental health treatment.\n\n5. MEDICAL HISTORY\nFull-term birth, uncomplicated. No chronic medical conditions. No current prescription medications; occasional acetaminophen as needed. Substance use in household: mother drinks alcohol socially (1–2 drinks/week), no recreational drug use reported, limited caffeine. Labs: TSH normal, metabolic panel unremarkable, toxicology negative.\n\n6. BEHAVIOURAL OBSERVATIONS / MENTAL STATUS EXAMINATION\nWell-groomed, age-appropriate dress. During play, child repeatedly reenacted hurt/medical scenes with dolls, used loud siren noises, and returned to theme despite redirection. Made intermittent eye contact, often looked toward mother for reassurance. Affect variable: tearful and fearful when discussing loud noises, flat when asked about friends. Play was repetitive and thematically focused on injury; limited spontaneous imaginative play. Demonstrated clinginess, resisted brief separation from mother. Startle to a sudden door slam was exaggerated. Language fluent for age, sentences intact; fine and gross motor skills developmentally appropriate. No self-injurious behavior observed. Social interest toward examiner present but play with peers at preschool reportedly decreased.",
    "answers": {
      "age": 5,
      "ptsd_a1_child": "absent",
      "ptsd_a2_child": "present",
      "ptsd_a3_child": "absent",
      "ptsd_b1_child": "present",
      "ptsd_b2_child": "absent",
      "ptsd_b3_child": "absent",
      "ptsd_b4_child": "absent",
      "ptsd_b5_child": "absent",
      "ptsd_c1_child": "absent",
      "ptsd_c2_child": "absent",
      "ptsd_c3_child": "present",
      "ptsd_c4_child": "absent",
      "ptsd_c5_child": "absent",
      "ptsd_c6_child": "absent",
      "ptsd_d1_child": "present",
      "ptsd_d2_child": "present",
      "ptsd_d3_child": "absent",
      "ptsd_d4_child": "absent",
      "ptsd_d5_child": "absent",
      "ptsd_exc_substance_child": "cleared",
      "ptsd_exc_medical_child": "cleared",
      "ptsd_exc_dissociative_substance_child": "cleared",
      "ptsd_exc_dissociative_medical_child": "cleared",
      "ptsd_subj_distress_child": "met",
      "ptsd_subj_trauma_quality_child": "met",
      "duration_days": 37
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 506
    }
  },
  {
    "id": "vig_047_asd_ambiguous_91671a24",
    "ground_truth": [
      "asd"
    ],
    "difficulty": "AMBIGUOUS",
    "meets_criteria": false,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n62-year-old accountant presents with \"I don't really click with people much, it's not that bad.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports approximately one week of increasing difficulty with social interaction, beginning about one week ago after several brief encounters at work felt \"awkward.\" Patient states, \"I try to say something and the conversation just kind of dies,\" and later, \"Maybe I'm overthinking it, it's probably nothing.\" Describes failing to initiate conversations and often not responding to attempts at small talk; reports frequently not sharing emotions or interests spontaneously (\"I don't usually talk about my hobbies unless asked\"). Notes reduced eye contact and limited facial expressiveness during interactions, describing that others have told them they appear \"distant.\" Reports a strong, narrow preoccupation with a single hobby (collecting historical maps) that occupies most leisure time and thought (\"I read about maps all the time, it's just what I like\"). Timeline: symptoms present for approximately 1 week, began one week ago. Onset: symptoms first appeared around age 19. Pertinent negatives: Denies stereotyped or repetitive motor movements, use of objects, or speech (e.g., no lining up of objects, no echolalia); Denies insistence on sameness or ritualized patterns of behavior (no rigid daily routines or marked distress with small changes); Denies hyper- or hyporeactivity to sensory input or unusual sensory interests.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\n4. FAMILY HISTORY\nFamily history notable for mood symptoms in a first-degree relative (unspecified), otherwise noncontributory.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nHypertension, well controlled on lisinopril 10 mg daily. No current psychotropic medications. Drinks alcohol occasionally, denies recreational drug use and tobacco.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, well-groomed. Behavior: cooperative but reserved, minimal spontaneous gestures. Speech: normal rate and volume, brief answers. Mood (subjective): \"Okay, a bit annoyed.\" Affect (observed): constricted range, limited modulation. Thought process: linear, goal-directed. Cognition: oriented x3, attention and memory intact on bedside testing. Insight: limited; patient minimizes impact, stating \"I manage fine most days.\"",
    "answers": {
      "age": 62,
      "asd_a1": "present",
      "asd_a2": "present",
      "asd_a3": "present",
      "asd_b1": "absent",
      "asd_b2": "absent",
      "asd_b3": "present",
      "asd_b4": "absent",
      "asd_exc_intellectual_disability": "cleared",
      "asd_subj_impairment": "not_met",
      "asd_subj_early_onset": "not_met",
      "asd_subj_severity_social": "not_met",
      "asd_subj_severity_rrb": "met",
      "duration_days": 11,
      "onset_age": 19
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 331
    }
  },
  {
    "id": "vig_048_adhd_mdd_comorbid_ba8f0221",
    "ground_truth": [
      "adhd",
      "mdd"
    ],
    "difficulty": "COMORBID",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n27-year-old graphic designer presents with \"I can't focus, I'm always losing things, and I'm so tired all the time.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports a longstanding pattern of attention and activity symptoms, with noticeable worsening over the past 6 months. States symptoms first appeared around age 3. \"I was always the kid who couldn't finish homework and left my backpack everywhere,\" patient says. Over the past 6 months, reports frequent careless mistakes at work (overlooking color specs, sending files with missing pages), difficulty sustaining focus during client calls and long documents, and starting multiple projects without finishing. Notes difficulty following spoken instructions: \"People have to repeat themselves because my mind is elsewhere.\" Reports losing keys, phone, and sketchbooks multiple times per week. Describes restless motor behavior at work—tapping feet and standing up during meetings—and colleagues describe them as \"always on the go.\" Over the past 6 months also reports persistent low mood: \"I feel empty most days,\" diminished interest in hobbies, decreased appetite with 6% weight loss in one month, early morning insomnia, marked fatigue, feelings of worthlessness, trouble concentrating, and recurrent thoughts of death without a specific plan. Denies past suicide attempts. No recent trigger identified.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history. No prior psychiatric medications or hospitalizations.\n\n4. FAMILY HISTORY\nMother reported to have lifelong problems with attention and periodic low mood; paternal history noncontributory.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nNo chronic medical conditions reported. Alcohol: 1–2 drinks on weekends. Recreational drugs: denies current use. Caffeine: 2–3 cups coffee daily. TSH normal. Metabolic panel unremarkable. Toxicology negative. Medications: occasional OTC ibuprofen; no prescription medications.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, mildly disheveled. Behavior: fidgety, frequently shifts in chair, stands once during interview. Speech: rapid at times, talks excessively. Mood: reports \"empty\" and \"tired.\" Affect: constricted, euthymic range limited. Thought process: tangential at moments, frequent interruptions of interviewer. Thought content: reports recurrent thoughts of death and passive suicidal ideation without plan or intent; denies prior attempts. No delusional beliefs elicited. Perceptions: denies auditory or visual hallucinations. Insight: limited regarding impact of symptoms on functioning but acknowledges problems.  \n\nPertinent negatives: Denies drug intoxication, denies current suicidal plan or intent, denies history of self-harm.",
    "answers": {
      "age": 27,
      "adhd_a1a": "present",
      "adhd_a1b": "present",
      "adhd_a1c": "present",
      "adhd_a1d": "present",
      "adhd_a1e": "present",
      "adhd_a1f": "present",
      "adhd_a1g": "present",
      "adhd_a1h": "present",
      "adhd_a1i": "present",
      "adhd_a2a": "present",
      "adhd_a2b": "present",
      "adhd_a2c": "present",
      "adhd_a2d": "present",
      "adhd_a2e": "present",
      "adhd_a2f": "present",
      "adhd_a2g": "present",
      "adhd_a2h": "present",
      "adhd_a2i": "present",
      "adhd_exc_psychotic": "cleared",
      "adhd_exc_mood": "cleared",
      "adhd_exc_anxiety": "cleared",
      "adhd_exc_dissociative": "cleared",
      "adhd_exc_personality": "cleared",
      "adhd_exc_substance": "cleared",
      "adhd_subj_functional_impairment": "met",
      "adhd_subj_developmental": "met",
      "adhd_subj_not_oppositional": "met",
      "duration_days": 194,
      "onset_age": 3,
      "mdd_a1": "present",
      "mdd_a2": "present",
      "mdd_a3": "present",
      "mdd_a4": "present",
      "mdd_a5": "present",
      "mdd_a6": "present",
      "mdd_a7": "present",
      "mdd_a8": "present",
      "mdd_a9": "present",
      "mdd_exc_substance": "cleared",
      "mdd_exc_medical": "cleared",
      "mdd_exc_psychotic": "cleared",
      "mdd_exc_bipolar": "cleared",
      "mdd_subj_clinical_significance": "met"
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 373
    }
  },
  {
    "id": "vig_049_gad_clear_2f8aad71",
    "ground_truth": [
      "gad"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n46-year-old software engineer presents with \"I can't stop worrying and it's ruining my sleep and my work.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports a 6-month history of excessive worry and apprehensive expectation about work performance, family finances, and minor daily tasks, beginning approximately July 2025. \"I worry about every presentation and replay every meeting in my head,\" patient states. Worry occurs most days and is described as difficult to control: \"I try to tell myself to stop but it keeps coming back.\" Reports persistent restlessness and feeling \"keyed up,\" frequent muscle tightness in the neck and shoulders, and easy fatigability—\"I'm exhausted by mid-afternoon even if I sleep.\" Describes cognitive symptoms: difficulty concentrating at work, frequent episodes where the \"mind goes blank\" during meetings. Endorses irritability, snapping at partner over small issues. Sleep is disturbed with difficulty falling asleep, multiple nocturnal awakenings, and nonrestorative sleep—\"I lie awake for hours and then wake up tired.\" Provides concrete examples: missed two project deadlines last quarter because of difficulty focusing; canceled a weekend social event after a night of poor sleep. Uses multiple direct quotes above.\n\nDURATION\nSymptoms present for approximately 6 months, beginning around July 2025.\n\nPERTINENT NEGATIVES\nDenies suicidal ideation. Denies homicidal ideation. Denies auditory or visual hallucinations. Denies recent illicit drug use.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history; no prior psychiatric medications or hospitalizations.\n\n4. FAMILY HISTORY\nPatient reports mother had long periods of persistent worry and poor sleep, per family report.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nMedical history significant for well-controlled hypertension. Alcohol: 1–2 drinks 2–3×/week. Recreational drugs: denies use. Caffeine: 2–3 cups coffee/day. TSH normal. metabolic panel unremarkable. toxicology negative. Medications: lisinopril 10 mg daily; ibuprofen PRN.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: appropriately dressed, mild tremulousness of hands. Behavior: cooperative but fidgety, frequent shifting in chair. Speech: normal rate and volume. Mood (subjective): \"anxious and tired.\" Affect (observed): anxious, congruent with mood. Thought process: goal-directed but preoccupied with worries. Cognition: alert and oriented x3; attention and concentration impaired during testing; short-term memory intact. Insight: understands symptoms are problematic and sought help; judgement appears intact.",
    "answers": {
      "age": 46,
      "gad_a": "present",
      "gad_b": "present",
      "gad_c1": "present",
      "gad_c2": "present",
      "gad_c3": "present",
      "gad_c4": "present",
      "gad_c5": "present",
      "gad_c6": "present",
      "gad_exc_substance": "cleared",
      "gad_exc_medical": "cleared",
      "gad_exc_panic": "cleared",
      "gad_exc_social_anxiety": "cleared",
      "gad_exc_ocd": "cleared",
      "gad_exc_separation": "cleared",
      "gad_exc_ptsd": "cleared",
      "gad_exc_anorexia": "cleared",
      "gad_exc_somatic": "cleared",
      "gad_exc_bdd": "cleared",
      "gad_exc_illness_anxiety": "cleared",
      "gad_exc_psychotic": "cleared",
      "gad_subj_clinical_significance": "met",
      "gad_subj_excessive": "met",
      "duration_days": 187
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 353
    }
  }
]