[
  {
    "id": "vig_000_mdd_moderate_6d110b04",
    "ground_truth": [
      "mdd"
    ],
    "difficulty": "MODERATE",
    "meets_criteria": true,
    "clinical_text": "34-year-old software engineer presents with \"I just can't get out of this funk; I kind of feel like I'm drifting.\"\n\nHISTORY OF PRESENT ILLNESS\nPatient reports onset of symptoms approximately 3 weeks ago after a busy project cycle ended. \"I feel empty most days,\" and \"I don't even want to do the things I used to.\" Reports markedly decreased interest in hobbies and social activities — stopped attending weekend meetups and has not played guitar for several weeks. Reports unintentional weight loss of about 7 lb over the past 3 weeks (approximately 5% of body weight) with decreased appetite nearly every day. Partner and patient describe noticeable slowing: \"she's kind of moving slower and takes longer to get ready,\" and observations of reduced speech and slowed grooming. Patient endorses feelings of worthlessness and excessive self-blame nearly every day, stating \"I should be doing more; it's my fault things are falling apart,\" and was observed tearful during the interview. Symptoms began about 3 weeks ago and have been present most days since, interfering with usual routine.\n\nPERTINENT NEGATIVES\nDenies insomnia or hypersomnia nearly every day.\nDenies fatigue or loss of energy nearly every day.\nDenies diminished ability to think or concentrate, or indecisiveness nearly every day.\nDenies recurrent thoughts of death, suicidal ideation, suicide attempt, or specific plan.\n\nPAST PSYCHIATRIC HISTORY\nNo prior psychiatric history. No prior psychiatric medications or hospitalizations.\n\nFAMILY HISTORY\nMother reported to have longstanding low mood treated with medication in the past; father alive and well.\n\nMEDICAL HISTORY AND SUBSTANCES\nHypertension managed with lisinopril 10 mg daily. Alcohol: 2–3 drinks on weekends. Denies recreational drug use. Caffeine: 1–2 cups of coffee daily. TSH normal. Metabolic panel unremarkable. Toxicology negative. Medications: lisinopril 10 mg daily; OTC ibuprofen as needed.\n\nMENTAL STATUS EXAMINATION\nAppearance: casually dressed, slightly disheveled. Behavior: cooperative, psychomotor retardation observed (slowed movements, delayed initiation of tasks). Speech: soft, decreased rate. Mood: reports feeling \"sad, empty.\" Affect: restricted, tearful at times. Thought process: linear and goal-directed. Thought content (delusions): no delusional beliefs elicited. Perceptions (hallucinations): no hallucinations reported. Insight: partial — recognizes change but attributes it to personal failure rather than external factors.\n\nFUNCTIONAL IMPACT\nWork: decreased productivity, missed one deadline, slower coding and review. Relationships: withdrawn from partner and friends, reduced communication. Daily activities: difficulty initiating routine chores, decreased self-care and leisure activities.",
    "answers": {
      "mdd_a1": "present",
      "mdd_a2": "present",
      "mdd_a3": "present",
      "mdd_a4": "absent",
      "mdd_a5": "present",
      "mdd_a6": "absent",
      "mdd_a7": "present",
      "mdd_a8": "absent",
      "mdd_a9": "absent",
      "mdd_exc_substance": "cleared",
      "mdd_exc_medical": "cleared",
      "mdd_exc_psychotic": "cleared",
      "mdd_exc_bipolar": "cleared",
      "mdd_subj_clinical_significance": "met",
      "duration_days": 21
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 387
    }
  },
  {
    "id": "vig_001_adhd_gad_comorbid_b5c0c3e8",
    "ground_truth": [
      "adhd",
      "gad"
    ],
    "difficulty": "COMORBID",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n28-year-old graphic designer presents with \"I can't focus, I'm always restless, and I'm messing up projects\" (patient's words).\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports a long-standing pattern of inattention and high activity beginning in childhood; symptoms first appeared around age 9. Over the past approximately 6 months symptoms have intensified with missed deadlines and more frequent workplace errors. \"I start a task and then I get pulled away by everything,\" the patient said. Describes frequent careless mistakes (overlooks file details, produces inaccurate proofs), difficulty sustaining attention during meetings or when reading long briefs, and often appearing not to listen when colleagues speak — \"my mind is somewhere else even when someone is talking to me.\" Reports starting tasks but losing focus, leaving multiple projects incomplete, failing to return client calls and forgetting appointments. Notes chronic disorganization (messy desk, lost keys, misplaced external drives) and poor time management leading to reprimands at work. Describes being easily distracted by noises or stray thoughts, frequent fidgeting (tapping feet/hands), feeling internally restless and \"on the go,\" and speaking rapidly and often interrupting others. Reports blurting answers in meetings and difficulty waiting turns. Also endorses persistent excessive worry about work performance and future projects for months, difficulty controlling these worries, feeling keyed up, easy fatigue, muscle tightness, episodes of mind going blank, irritability, and restless, unrefreshing sleep. \"I lie awake replaying what I did wrong,\" patient said.\n\nPERTINENT NEGATIVES: Denies suicidal ideation, homicidal ideation, self-harm, hallucinations, and fixed false beliefs.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\n4. FAMILY HISTORY\nFamily history notable for a parent with substance use; no known psychiatric treatment in immediate family.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nNo significant medical illnesses. Alcohol: 1–2 drinks on weekends. Recreational drugs: denies use. Caffeine: 2–3 cups coffee daily. TSH normal. Metabolic panel unremarkable. Toxicology negative. Medications: none prescribed; uses OTC ibuprofen as needed.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, slightly disheveled. Behaviour: restless, frequent shifting in seat, taps foot. Speech: rapid, pressured at times. Mood: reports being \"stressed and keyed up.\" Affect: congruent, somewhat irritable. Thought process: linear but tangential at times with frequent interruptions. Thought content (delusions): denies fixed false beliefs. Perceptions (hallucinations): denies hallucinations. Insight: limited recognition of severity of work impact but willing to consider strategies.",
    "answers": {
      "adhd_a1a": "present",
      "adhd_a1b": "present",
      "adhd_a1c": "present",
      "adhd_a1d": "present",
      "adhd_a1e": "present",
      "adhd_a1f": "present",
      "adhd_a1g": "present",
      "adhd_a1h": "present",
      "adhd_a1i": "present",
      "adhd_a2a": "present",
      "adhd_a2b": "present",
      "adhd_a2c": "present",
      "adhd_a2d": "present",
      "adhd_a2e": "present",
      "adhd_a2f": "present",
      "adhd_a2g": "present",
      "adhd_a2h": "present",
      "adhd_a2i": "present",
      "adhd_exc_psychotic": "cleared",
      "adhd_exc_mood": "cleared",
      "adhd_exc_anxiety": "cleared",
      "adhd_exc_dissociative": "cleared",
      "adhd_exc_personality": "cleared",
      "adhd_exc_substance": "cleared",
      "adhd_subj_functional_impairment": "met",
      "adhd_subj_developmental": "met",
      "adhd_subj_not_oppositional": "met",
      "duration_days": 194,
      "onset_age": 9,
      "gad_a": "present",
      "gad_b": "present",
      "gad_c1": "present",
      "gad_c2": "present",
      "gad_c3": "present",
      "gad_c4": "present",
      "gad_c5": "present",
      "gad_c6": "present",
      "gad_exc_substance": "cleared",
      "gad_exc_medical": "cleared",
      "gad_exc_panic": "cleared",
      "gad_exc_social_anxiety": "cleared",
      "gad_exc_ocd": "cleared",
      "gad_exc_separation": "cleared",
      "gad_exc_ptsd": "cleared",
      "gad_exc_anorexia": "cleared",
      "gad_exc_somatic": "cleared",
      "gad_exc_bdd": "cleared",
      "gad_exc_illness_anxiety": "cleared",
      "gad_exc_psychotic": "cleared",
      "gad_subj_clinical_significance": "met",
      "gad_subj_excessive": "met"
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 383
    }
  },
  {
    "id": "vig_002_adhd_moderate_15f4ee36",
    "ground_truth": [
      "adhd"
    ],
    "difficulty": "MODERATE",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n24-year-old graduate student presents with \"I'm kind of all over the place and messing up my work sometimes.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports a roughly 6-month period of increased difficulties with day-to-day tasks and work performance, with current problems \"worse than usual.\" States symptoms began around age 10. Describes often overlooking details on assignments (\"I miss little things, so my reports end up inaccurate\") and frequently producing messy, disorganized work. Reports difficulty managing sequential tasks and time—\"I start things and then lose track; deadlines sneak up on me\"—and often avoids paperwork or long reviews because they feel effortful (\"I kind of put off the long reports\"). Gives concrete examples: repeatedly misplacing keys and phone, turning in an incomplete lab assignment, arriving late to meetings after losing papers, and forgetting to pay a bill. Notes being easily distracted by noises and by \"other thoughts that pop into my head,\" and acknowledges frequent tapping of hands/feet when seated and a tendency to get up during lectures or meetings. Describes blurting out answers in group discussions (\"I sometimes finish people's sentences\") and difficulty waiting in line without impatience. Timeline: problems intermittently present since childhood, more disruptive in the past 6 months with increased missed deadlines and relationship strain. Two direct quotes: \"I'm kind of embarrassed I keep losing things\" and \"I avoid paperwork because it's just draining.\"\n\nPertinent negatives: Denies difficulty sustaining attention in tasks or play activities (e.g., remaining focused during lectures, conversations, or lengthy reading). Denies not seeming to listen when spoken to directly. Denies not following through on instructions and failing to finish schoolwork, chores, or duties in the workplace. Denies being \"on the go,\" acting as if \"driven by a motor.\"\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history or formal mental health treatment.\n\n4. FAMILY HISTORY\nFamily history notable for a father who had difficulty with organization and restlessness; no known formal psychiatric treatment in family.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nNo significant medical history reported. Alcohol: social drinking 1–2 times/week. Recreational drugs: denies current illicit drug use. Caffeine: 2–3 cups coffee daily.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, somewhat disheveled. Behaviour: fidgety, frequently tapping foot and shifting in chair. Speech: normal volume, slightly hurried at times. Mood: reports feeling \"frustrated\" and \"embarrassed.\" Affect: mildly constricted, congruent with stated mood. Thought process: generally linear but intermittently interrupted by unrelated thoughts. Thought content: no delusional ideas reported. Perceptions: denies hallucinations. Insight: fair—recognizes difficulties and attributes some to personal habits.",
    "answers": {
      "adhd_a1a": "present",
      "adhd_a1b": "absent",
      "adhd_a1c": "absent",
      "adhd_a1d": "absent",
      "adhd_a1e": "present",
      "adhd_a1f": "present",
      "adhd_a1g": "present",
      "adhd_a1h": "present",
      "adhd_a1i": "present",
      "adhd_a2a": "present",
      "adhd_a2b": "present",
      "adhd_a2c": "present",
      "adhd_a2d": "present",
      "adhd_a2e": "absent",
      "adhd_a2f": "absent",
      "adhd_a2g": "present",
      "adhd_a2h": "present",
      "adhd_a2i": "absent",
      "adhd_exc_psychotic": "cleared",
      "adhd_exc_mood": "cleared",
      "adhd_exc_anxiety": "cleared",
      "adhd_exc_dissociative": "cleared",
      "adhd_exc_personality": "cleared",
      "adhd_exc_substance": "cleared",
      "adhd_subj_functional_impairment": "met",
      "adhd_subj_developmental": "met",
      "adhd_subj_not_oppositional": "met",
      "duration_days": 187,
      "onset_age": 10
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 418
    }
  },
  {
    "id": "vig_003_ptsd_clear_d5c317d9",
    "ground_truth": [
      "ptsd"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "DEMOGRAPHICS AND CHIEF COMPLAINT\n34-year-old paramedic presents with \"I can't get the images out of my head.\"\n\nHISTORY OF PRESENT ILLNESS\nPatient reports onset approximately 1 month ago after responding to a large apartment explosion on 2025-12-03. Describes directly experiencing the blast (\"I was thrown against a wall\"), witnessing multiple victims including a coworker who was burned and died at the scene, and later learning that his close friend (roommate) was killed in the same event. As a first responder he reports repeated exposure to grisly details while assisting with recovery: \"I kept opening bags and identifying people, it felt endless.\" He endorses recurrent, involuntary memories: \"They pop into my mind when I'm driving or when I close my eyes.\" Reports recurrent nightmares with the explosion and screams, and several dissociative episodes where he feels as if he is back at the scene, describing sensory re-experiencing and temporary loss of present surroundings. Notes marked distress and racing heart when passing the building or when hearing sirens, and an exaggerated startle when someone taps him. He avoids driving past the block, avoids talking about the event, and has difficulty recalling about 10–20 minutes immediately after the blast. Patient reports pervasive self-blame: \"I should have done more to save him,\" and says he now believes the world is unsafe and that he cannot trust his judgment. Endorses persistent fear, shame, anger, decreased interest in hobbies, withdrawal from friends, irritability with coworkers, one episode of reckless driving since the event, hypervigilance at night, trouble concentrating at work, and difficulty falling and staying asleep.\n\nPAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\nFAMILY HISTORY\nFamily history noncontributory; no known psychiatric diagnoses reported.\n\nPERTINENT NEGATIVES\nDenies auditory or visual hallucinations. Denies current suicidal ideation, plan, or intent. Denies homicidal ideation.\n\nMEDICAL HISTORY AND SUBSTANCES\nNo chronic medical conditions reported. Substance use: alcohol 1–2 beers on weekends, denies recreational drug use, caffeine 2–3 cups/day. TSH normal. Metabolic panel unremarkable. Toxicology negative. Medications: ibuprofen PRN, no prescriptions.\n\nMENTAL STATUS EXAMINATION\nAppearance: disheveled, wearing work uniform. Behavior: restless, repeatedly checks phone. Mood: \"on edge, numb.\" Affect: constricted, tearful at times, congruent with stated mood. Thought content: preoccupation with event, intrusive memories; denies suicidal/homicidal intent or active plans; protective factors include dependent children and intent to seek help. Cognition: alert and oriented x3; attention and concentration impaired on serial 7s; memory for remote events intact, recent memory with gaps regarding peri-event period. Insight: partial; recognizes symptoms but attributes them to personal failure.",
    "answers": {
      "ptsd_a1": "present",
      "ptsd_a2": "present",
      "ptsd_a3": "present",
      "ptsd_a4": "present",
      "ptsd_b1": "present",
      "ptsd_b2": "present",
      "ptsd_b3": "present",
      "ptsd_b4": "present",
      "ptsd_b5": "present",
      "ptsd_c1": "present",
      "ptsd_c2": "present",
      "ptsd_d1": "present",
      "ptsd_d2": "present",
      "ptsd_d3": "present",
      "ptsd_d4": "present",
      "ptsd_d5": "present",
      "ptsd_d6": "present",
      "ptsd_d7": "present",
      "ptsd_e1": "present",
      "ptsd_e2": "present",
      "ptsd_e3": "present",
      "ptsd_e4": "present",
      "ptsd_e5": "present",
      "ptsd_e6": "present",
      "ptsd_exc_substance": "cleared",
      "ptsd_exc_medical": "cleared",
      "ptsd_exc_dissociative_substance": "cleared",
      "ptsd_exc_dissociative_medical": "cleared",
      "ptsd_subj_distress": "met",
      "ptsd_subj_trauma_quality": "met",
      "ptsd_subj_violent_accidental": "met",
      "duration_days": 37
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 412
    }
  },
  {
    "id": "vig_004_asd_clear_6fdf7043",
    "ground_truth": [
      "asd"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "DEMOGRAPHICS AND CHIEF COMPLAINT\n18-year-old college student presents with \"I can't follow conversations and people think I'm rude.\"\n\nHISTORY OF PRESENT ILLNESS\nPatient reports a marked change over the past three weeks with increased social withdrawal and escalation of longstanding interpersonal difficulties that the patient reports began around age 16. \"I run out of things to say and then just stop,\" and \"I don't understand the faces people make; it feels like signals I can't read.\" Timeline: patient describes baseline difficulties with peers since age 16 but notes a recent exacerbation beginning approximately 3 weeks ago when they started avoiding study groups and missing classes. Examples: during a group project, patient reports failing to respond to classmates' questions, later repeating classmates' sentences aloud (echolalia) and lining up pens repeatedly to calm themselves. Patient describes rigid morning routine—must eat the same cereal and take the same route to campus; a small change (bus detour) produced a 45-minute meltdown. Reports intense preoccupation with train timetables and spends hours watching schedule apps, becoming agitated if interrupted. Sensory report: \"Certain cafeteria noises make me cover my ears,\" and avoids clothing with particular textures. Notes poor eye contact, limited facial expression, and frequent hand-flapping when anxious.\n\nPAST PSYCHIATRIC HISTORY\nNo prior psychiatric history or formal treatment reported.\n\nFAMILY HISTORY\nMother reportedly had longstanding difficulty regulating mood; no known formal psychiatric diagnoses in other relatives.\n\nMEDICAL HISTORY AND SUBSTANCES\nNo significant medical history. No current medications. Occasional caffeine. Denies tobacco, alcohol, and illicit drug use.\n\nPERTINENT NEGATIVES\nDenies hallucinations. Denies suicidal ideation or self-harm. Denies recent substance use.\n\nMENTAL STATUS EXAMINATION\nAppearance: casually dressed, neat. Behaviour: avoids eye contact, repetitive hand movements (finger flicking) noted. Speech: low volume, literal, occasional immediate echolalia. Mood (subjective): \"anxious and exhausted.\" Affect (observed): constricted, limited range. Thought process: concrete, perseverative on routines and timetables; no delusional content. Cognition: alert, oriented x3, attention intact though easily distracted by sensory input. Insight: limited awareness of social impact of behaviors, recognizes distress but attributes problems to others not understanding them.",
    "answers": {
      "asd_a1": "present",
      "asd_a2": "present",
      "asd_a3": "present",
      "asd_b1": "present",
      "asd_b2": "present",
      "asd_b3": "present",
      "asd_b4": "present",
      "asd_exc_intellectual_disability": "cleared",
      "asd_subj_impairment": "met",
      "asd_subj_early_onset": "met",
      "asd_subj_severity_social": "met",
      "asd_subj_severity_rrb": "met",
      "duration_days": 21,
      "onset_age": 16
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 337
    }
  },
  {
    "id": "vig_005_adhd_mdd_comorbid_a7563885",
    "ground_truth": [
      "adhd",
      "mdd"
    ],
    "difficulty": "COMORBID",
    "meets_criteria": true,
    "clinical_text": "29-year-old graphic designer presents with \"I can't keep my mind on anything; I keep missing deadlines.\"\n\nHISTORY OF PRESENT ILLNESS:\nPatient reports ~6 months of worsening concentration and energy. \"I start a project and then I'm off to something else,\" and \"I can't sit through meetings without getting up.\" Timeline: symptoms began insidiously in July 2025 and have been persistent since. Patient describes frequent careless errors on client files (overlooked image layers, wrong color codes), missing deadlines on three recent projects, and handing in incomplete work after losing focus. Describes difficulty sustaining attention during lectures and long documents, mind \"elsewhere\" even without distractions; often does not appear to listen when colleagues speak. Reports starting tasks then quickly becoming sidetracked (e.g., begins a report, spends an hour on unrelated emails, then abandons it). Avoids paperwork and lengthy reviews, saying \"I put it off until it's due and then panic.\" Frequently misplaces keys, phone, and paperwork; missed a scheduled dentist appointment and a client call. Reports feeling restless—tapping feet, leaving seat during meetings to pace, and feeling \"driven\" and uncomfortable sitting still. Talks quickly in meetings and often interrupts or blurts answers. Sleep reduced to 4–5 hours some nights with early morning awakening; appetite decreased with 6 lb weight loss in past month. Describes pervasive low mood, tearfulness, feelings of worthlessness and excessive guilt about work performance: \"I feel like I'm failing everyone.\" Reports recurrent thoughts of death without a concrete plan; denies recent attempts. Symptoms present for approximately 6 month(s). Symptoms first appeared around age 9.\n\nPERTINENT NEGATIVES:\nDenies current suicidal plan or intent; denies history of suicide attempts. Denies visual or auditory hallucinations. No delusional ideas reported.\n\nPAST PSYCHIATRIC HISTORY:\nNo prior psychiatric history; no prior psychotherapy or medication trials.\n\nFAMILY HISTORY:\nFather with chronic mood difficulties; mother alive and well.\n\nMEDICAL HISTORY AND SUBSTANCES:\nNo chronic medical conditions. Alcohol: 1–2 drinks socially per month. Recreational drugs: denies use. Caffeine: 2–3 cups coffee daily. TSH normal; metabolic panel unremarkable; toxicology negative. Medications: no prescriptions; takes OTC ibuprofen as needed.\n\nMENTAL STATUS EXAMINATION:\nAppearance: casually dressed, mildly disheveled. Behaviour: restless, frequently shifts in seat. Speech: rapid, sometimes interrupts. Mood: \"down, frustrated.\" Affect: constricted, tearful at times. Thought process: tangential at points, distractible. Thought content: passive thoughts of death; no delusions. Perceptions: denies hallucinations. Insight: limited; judgment appears impaired in planning and time management.",
    "answers": {
      "adhd_a1a": "present",
      "adhd_a1b": "present",
      "adhd_a1c": "present",
      "adhd_a1d": "present",
      "adhd_a1e": "present",
      "adhd_a1f": "present",
      "adhd_a1g": "present",
      "adhd_a1h": "present",
      "adhd_a1i": "present",
      "adhd_a2a": "present",
      "adhd_a2b": "present",
      "adhd_a2c": "present",
      "adhd_a2d": "present",
      "adhd_a2e": "present",
      "adhd_a2f": "present",
      "adhd_a2g": "present",
      "adhd_a2h": "present",
      "adhd_a2i": "present",
      "adhd_exc_psychotic": "cleared",
      "adhd_exc_mood": "cleared",
      "adhd_exc_anxiety": "cleared",
      "adhd_exc_dissociative": "cleared",
      "adhd_exc_personality": "cleared",
      "adhd_exc_substance": "cleared",
      "adhd_subj_functional_impairment": "met",
      "adhd_subj_developmental": "met",
      "adhd_subj_not_oppositional": "met",
      "duration_days": 194,
      "onset_age": 9,
      "mdd_a1": "present",
      "mdd_a2": "present",
      "mdd_a3": "present",
      "mdd_a4": "present",
      "mdd_a5": "present",
      "mdd_a6": "present",
      "mdd_a7": "present",
      "mdd_a8": "present",
      "mdd_a9": "present",
      "mdd_exc_substance": "cleared",
      "mdd_exc_medical": "cleared",
      "mdd_exc_psychotic": "cleared",
      "mdd_exc_bipolar": "cleared",
      "mdd_subj_clinical_significance": "met"
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 392
    }
  },
  {
    "id": "vig_006_gad_clear_37bab702",
    "ground_truth": [
      "gad"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n\"34-year-old high school teacher presents with \"I'm worrying all the time and can't switch my brain off.\"\" \n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports approximately six months of persistent, excessive worry about work performance, classroom management, and future evaluations. Symptoms began around July 2025. Patient states, \"I replay every lesson in my head and imagine every mistake,\" and \"I can't stop thinking about what could go wrong.\" Worry occurs most days, often starting in the morning and worsening in evenings. Patient describes difficulty controlling the worry, reporting repeated attempts to reassure self that are unsuccessful. Endorses feeling constantly keyed up and restless, with muscle tightness in the neck and shoulders and jaw clenching. Reports being easily fatigued despite spending extra hours awake; \"I can get through the day but by 3 PM I'm exhausted.\" Describes concentration lapses in meetings with episodes of mind going blank and forgetting students' names. Reports increased irritability—short temper with partner and coworkers—resulting in heated exchanges. Sleep is disrupted: difficulty falling asleep, waking several times, and nonrestorative sleep. Uses direct examples: double-checking emails late at night, arriving late to grade papers because of rumination, and cancelling a weekend staff event due to worry.\n\nPERTINENT NEGATIVES (explicitly deny these):\nDenies suicidal ideation. Denies homicidal ideation. Denies hearing voices or seeing things. Denies current recreational drug use. Denies recent hospitalization for psychiatric reasons.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history. No prior psychotherapy or psychotropic medications.\n\n4. FAMILY HISTORY\nMother has longstanding excessive worry and takes an unspecified psychiatric medication.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nNo major medical illnesses reported. Alcohol: 1–2 drinks on weekends. Recreational drugs: none. Caffeine: 2–3 cups coffee daily. 'TSH normal', 'metabolic panel unremarkable', 'toxicology negative'. Medications: occasional ibuprofen, melatonin PRN.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, slightly fatigued. Behavior: fidgety, frequently shifts in chair. Speech: fluent, slightly rapid, coherent. Mood (subjective): \"tense and tired.\" Affect (observed): constricted, anxious-appearing. Thought process: linear but ruminative, preoccupied with future problems. Cognition: oriented to person/place/time, attention fluctuates with occasional blanking. Insight: acknowledges problem and expresses desire for help.",
    "answers": {
      "gad_a": "present",
      "gad_b": "present",
      "gad_c1": "present",
      "gad_c2": "present",
      "gad_c3": "present",
      "gad_c4": "present",
      "gad_c5": "present",
      "gad_c6": "present",
      "gad_exc_substance": "cleared",
      "gad_exc_medical": "cleared",
      "gad_exc_panic": "cleared",
      "gad_exc_social_anxiety": "cleared",
      "gad_exc_ocd": "cleared",
      "gad_exc_separation": "cleared",
      "gad_exc_ptsd": "cleared",
      "gad_exc_anorexia": "cleared",
      "gad_exc_somatic": "cleared",
      "gad_exc_bdd": "cleared",
      "gad_exc_illness_anxiety": "cleared",
      "gad_exc_psychotic": "cleared",
      "gad_subj_clinical_significance": "met",
      "gad_subj_excessive": "met",
      "duration_days": 187
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 348
    }
  },
  {
    "id": "vig_007_adhd_moderate_97994ac9",
    "ground_truth": [
      "adhd"
    ],
    "difficulty": "MODERATE",
    "meets_criteria": true,
    "clinical_text": "24-year-old graduate student presents with \"I'm kind of all over the place and can't focus on anything.\"\n\nHISTORY OF PRESENT ILLNESS:\nPatient reports a roughly 6-month course of increasing difficulties with attention and activity that began about 6 months ago and first appeared around age 10. States, \"I start things and don't finish them,\" and \"I lose my phone or my keys all the time,\" and \"I'm kind of always tapping my foot or moving.\" Describes frequent careless mistakes in coursework and research notes—overlooking details on data sheets and submitting inaccurate calculations. Reports difficulty sustaining attention during long lectures and readings; \"my mind sort of wanders even when I want to follow along.\" Notes appearing not to listen when spoken to directly; says people tell them their \"mind seemed elsewhere\" in meetings. Describes trouble following through on tasks (starts literature reviews then moves on to other tasks), disorganized materials and missed deadlines, and frequently misplacing notebooks and glasses. Observes motor restlessness: fidgets with hands, taps feet, leaves seat in seminars, and feels \"on the go\" in social settings. Reports talking a lot in group meetings and sometimes interrupting peers or starting to use others' materials without asking. Symptoms reported as present daily and impairing for approximately 6 months.\n\nFunctional impact:\n- Work/academic: Missed deadlines, repeated errors in lab data, decreased productivity in assistantship duties.\n- Relationships: Strained peer collaborations due to interrupting and taking over tasks; friends note impatience.\n- Daily activities: Misplaces keys/phone multiple times weekly, difficulty organizing bills and papers at home.\n\nPERTINENT NEGATIVES:\nDenies often avoids, dislikes, or is reluctant to engage in tasks that require sustained mental effort. Denies is often easily distracted by extraneous stimuli. Denies is often forgetful in daily activities. Denies often unable to play or engage in leisure activities quietly.\n\nPAST PSYCHIATRIC HISTORY:\nNo prior psychiatric history; no prior medications or psychotherapy reported.\n\nFAMILY HISTORY:\nMother described as having longstanding difficulties with restlessness and was treated with medication for \"nerves.\"\n\nMEDICAL HISTORY AND SUBSTANCES:\nNo significant medical problems reported. Alcohol: 1–2 drinks socially weekly. Recreational drugs: denies regular use. Caffeine: 2–3 cups coffee daily.\n\nMENTAL STATUS EXAMINATION:\nAppearance: casually dressed, slightly unkempt. Behaviour: frequently fidgeted, tapped hands/feet, shifted in chair. Speech: spontaneous, somewhat rapid, often interrupts interviewer. Mood: \"a bit stressed, kind of frustrated.\" Affect: reactive, range present but restless. Thought process: goal-directed but frequently shifts topics and occasionally jumps between subjects. Thought content (delusions): Denies fixed false beliefs. Perceptions (hallucinations): Denies hallucinations. Insight: acknowledges problems with attention and organization but attributes much to poor time management and stress.",
    "answers": {
      "adhd_a1a": "present",
      "adhd_a1b": "present",
      "adhd_a1c": "present",
      "adhd_a1d": "present",
      "adhd_a1e": "present",
      "adhd_a1f": "absent",
      "adhd_a1g": "present",
      "adhd_a1h": "absent",
      "adhd_a1i": "absent",
      "adhd_a2a": "present",
      "adhd_a2b": "present",
      "adhd_a2c": "present",
      "adhd_a2d": "absent",
      "adhd_a2e": "present",
      "adhd_a2f": "present",
      "adhd_a2g": "absent",
      "adhd_a2h": "absent",
      "adhd_a2i": "present",
      "adhd_exc_psychotic": "cleared",
      "adhd_exc_mood": "cleared",
      "adhd_exc_anxiety": "cleared",
      "adhd_exc_dissociative": "cleared",
      "adhd_exc_personality": "cleared",
      "adhd_exc_substance": "cleared",
      "adhd_subj_functional_impairment": "met",
      "adhd_subj_developmental": "met",
      "adhd_subj_not_oppositional": "met",
      "duration_days": 187,
      "onset_age": 10
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 427
    }
  },
  {
    "id": "vig_008_ptsd_clear_6041dda1",
    "ground_truth": [
      "ptsd"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n34-year-old paramedic presents with \"I keep reliving the crash and I can't sleep\" and \"Everything smells like gasoline and blood when it happens again.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports onset approximately 1 month ago after responding to a multi-vehicle collision on 12/02/2025 in which his ambulance was struck. He describes directly experiencing the collision (\"I felt the whole rig flip, my face hit the glass\"), witnessing coworkers and bystanders injured and one colleague die at the scene, and later learning that a close friend who had been in a different crash died two weeks after the event. As a first responder he reports repeated exposure to gruesome details during extrication and at the hospital. He reports recurrent, involuntary memories: \"I see the metal folding over and hear her scream over and over\" and recurrent nightmares in which he is back in the vehicle and trapped. He describes episodes in public where he feels transported back to the scene, drops to the floor, and perceives the same sounds and smells; during these episodes he experiences pounding heart, sweat, and shaking. Notes marked distress when exposed to ambulance sirens, the route where the crash occurred, or conversations about vehicle accidents; reports avoidance of driving that route, refusing highway shifts at work, and avoiding colleagues who were at the scene. Patient cannot recall parts of the event, specifically a 10–15 minute interval before extrication. Reports persistent feelings of guilt and that \"it was my fault,\" pervasive fear and numbness, decreased interest in recreational running, increasing distance from spouse, irritability with loud noises, one episode of reckless speeding the week prior, hypervigilance when on duty, excessive startle to door slams, difficulty concentrating, and trouble falling and staying asleep. Duration: Symptoms present for approximately 1 month; began after 12/02/2025 event.\n\nPERTINENT NEGATIVES\nDenies current hearing voices; denies seeing things that others do not; denies current intent to harm others.\n\nFUNCTIONAL IMPACT\nWork: Avoids highway calls, called out sick 4 times in past month, decreased performance during shifts due to concentration lapses. Relationships: Reports growing distance from spouse, irritability and withdrawal from friends and coworkers. Daily activities: Stopped running, avoids driving certain routes, difficulty completing household tasks due to sleep loss and intrusive memories.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\n4. FAMILY HISTORY\nMother alive, no known psychiatric treatment; father deceased, history of alcohol problems.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nNo chronic medical conditions reported. Substance use: drinks alcohol 2–3 times per week (2–3 beers per occasion), denies recreational drugs, uses caffeine daily (2–3 coffees). Labs: TSH normal, metabolic panel unremarkable, toxicology negative. Medications: OTC ibuprofen PRN.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, hygiene appropriate. Behavior: cooperative but frequently looks away, at times visibly trembling. Mood: \"on edge, guilty.\" Affect: constricted, reactive to trauma content. Thought content: intrusive memories and preoccupation with event; denies current suicidal ideation; reports fleeting passive wish \"I wish it had been me\" twice in past two weeks, no plan, no intent; protective factors include spouse and employment. Cognition: oriented x3, concentration impaired by intrusive recollections. Insight: recognizes symptoms relate to the event and wishes to get help.",
    "answers": {
      "ptsd_a1": "present",
      "ptsd_a2": "present",
      "ptsd_a3": "present",
      "ptsd_a4": "present",
      "ptsd_b1": "present",
      "ptsd_b2": "present",
      "ptsd_b3": "present",
      "ptsd_b4": "present",
      "ptsd_b5": "present",
      "ptsd_c1": "present",
      "ptsd_c2": "present",
      "ptsd_d1": "present",
      "ptsd_d2": "present",
      "ptsd_d3": "present",
      "ptsd_d4": "present",
      "ptsd_d5": "present",
      "ptsd_d6": "present",
      "ptsd_d7": "present",
      "ptsd_e1": "present",
      "ptsd_e2": "present",
      "ptsd_e3": "present",
      "ptsd_e4": "present",
      "ptsd_e5": "present",
      "ptsd_e6": "present",
      "ptsd_exc_substance": "cleared",
      "ptsd_exc_medical": "cleared",
      "ptsd_exc_dissociative_substance": "cleared",
      "ptsd_exc_dissociative_medical": "cleared",
      "ptsd_subj_distress": "met",
      "ptsd_subj_trauma_quality": "met",
      "ptsd_subj_violent_accidental": "met",
      "duration_days": 37
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 526
    }
  },
  {
    "id": "vig_009_asd_clear_127c909a",
    "ground_truth": [
      "asd"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "19-year-old college student presents with \"I don't know how to talk to people; I like my routines.\"\n\nHISTORY OF PRESENT ILLNESS\nPatient reports long-standing difficulties beginning in mid-adolescence with a clear recent exacerbation. \"I have liked lining things up since I was a kid,\" and \"If my bus is different I get really upset.\" Symptoms first became noticeable around age 16 and have increased in intensity over the last three weeks. Duration: Symptoms present for approximately 3 week(s). They began as a clearer worsening of longstanding patterns that started at age 16. Patient describes limited back-and-forth in conversation: when asked about school, responds with factual monologues about train schedules rather than answering questions or asking reciprocal questions. Often does not initiate greetings and sometimes does not respond when others speak; staff report patient will sit quietly and not return a greeting. Nonverbal communication is limited—poor eye contact, minimal facial expression, rigid posture; patient describes not understanding gestures and frequently misreads tone. Repetitive behaviors include lining up pens by length, frequent hand-flapping when anxious, and repeating phrases heard on television. Reports extreme distress when routine is altered (missed bus route led to crying and leaving class early), and insists on same route to campus and same meal each day. Interests are narrow and intense (detailed knowledge of public transit schedules; spends hours collecting timetable printouts). Sensory features reported: adverse reaction to loud cafeteria noise, excessive smelling of clothing fabric for reassurance, and prolonged visual fixation on ceiling fans.\n\nPAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\nFAMILY HISTORY\nMother reported to have long-standing difficulties with mood and social withdrawal; no other family mental health history reported.\n\nPERTINENT NEGATIVES\nDenies suicidal ideation. Denies self-harm. Denies auditory or visual hallucinations. Denies recent substance use.\n\nMEDICAL HISTORY AND SUBSTANCES\nNo significant medical history. No current medications.\n\nMENTAL STATUS EXAMINATION\nAppearance: casually dressed, neat. Behavior: repetitive hand movements noted throughout interview, limited reciprocal gestures. Speech: monotone, concrete, occasionally echolalic phrases. Mood (subjective): \"anxious when plans change.\" Affect (observed): constricted, minimal range. Thought process: concrete, perseverative, occasional tangential focus on special interests. Cognition: oriented x3, attention adequate though easily distracted by sensory stimuli. Insight: limited regarding social difficulties and impact on functioning.\n\nFUNCTIONAL IMPACT\nWork/academic: Missed classes due to rigid travel routine and sensory overwhelm; difficulty participating in group projects. Relationships: Few peer friendships, difficulty sustaining reciprocal interactions, avoids social invitations. Daily activities: Daily meal and travel routines dominate schedule; distress and functional disruption with minor changes.",
    "answers": {
      "asd_a1": "present",
      "asd_a2": "present",
      "asd_a3": "present",
      "asd_b1": "present",
      "asd_b2": "present",
      "asd_b3": "present",
      "asd_b4": "present",
      "asd_exc_intellectual_disability": "cleared",
      "asd_subj_impairment": "met",
      "asd_subj_early_onset": "met",
      "asd_subj_severity_social": "met",
      "asd_subj_severity_rrb": "met",
      "duration_days": 21,
      "onset_age": 16
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 410
    }
  },
  {
    "id": "vig_010_mdd_moderate_241acc52",
    "ground_truth": [
      "mdd"
    ],
    "difficulty": "MODERATE",
    "meets_criteria": true,
    "clinical_text": "DEMOGRAPHICS AND CHIEF COMPLAINT\n34-year-old software engineer presents with \"I kind of don't enjoy anything anymore\" and \"I'm having trouble getting through the day.\"\n\nHISTORY OF PRESENT ILLNESS\nSymptoms began approximately 3 weeks ago after a project deadline passed. Patient reports \"I just don't want to do hobbies I used to like — even gaming or cooking feels empty,\" and \"I can't focus on work; it's like my brain is foggy.\" Patient describes a noticeable weight loss of about 8% over the past month attributed to eating less: \"I sometimes forget to eat or only nibble.\" Sleep is disrupted nearly every night with initial insomnia and early morning awakening: \"I lie awake for hours and sometimes nap in the afternoon but don't feel rested.\" Patient reports pervasive feelings of worthlessness and excessive guilt: \"I feel like I'm useless and like I've let everyone down,\" and sometimes expresses belief that they are responsible for others' problems despite contrary evidence. Patient notes marked indecisiveness and diminished concentration affecting routine tasks.\n\nPAST PSYCHIATRIC HISTORY\nNo prior psychiatric history. No prior psychiatric medications or hospitalizations.\n\nFAMILY HISTORY\nMother has a history of long-term treatment for mood symptoms; no other known psychiatric history.\n\nMEDICAL HISTORY AND SUBSTANCES\nNo significant medical illnesses reported. Substance use: alcohol 1–2 drinks on weekends, denies daily alcohol use; denies recreational drug use; caffeine: 2–3 cups coffee per day. Labs: TSH normal, metabolic panel unremarkable, toxicology negative. Medications: occasional OTC ibuprofen; no prescribed medications.\n\nPERTINENT NEGATIVES\nDenies depressed mood most of the day, nearly every day. Denies psychomotor agitation or retardation observed by others. Denies fatigue or loss of energy nearly every day. Denies recurrent thoughts of death, suicidal ideation, suicide attempts, or a plan.\n\nMENTAL STATUS EXAMINATION\nAppearance: casually dressed, slight weight loss evident. Behavior: cooperative, sits quietly. Speech: soft, slightly hesitant, normal rate. Mood: reports feeling \"kind of numb\" at times; denies pervasive sadness. Affect: constricted range, appropriate to content. Thought process: goal-directed but slowed by frequent pauses and indecisiveness. Thought content: expresses pervasive feelings of worthlessness and excessive guilt; holds some overgeneralized beliefs about responsibility for others' problems. Perceptions: denies hallucinations. Insight: limited; recognizes symptoms but attributes them to personal failure.",
    "answers": {
      "mdd_a1": "absent",
      "mdd_a2": "present",
      "mdd_a3": "present",
      "mdd_a4": "present",
      "mdd_a5": "absent",
      "mdd_a6": "absent",
      "mdd_a7": "present",
      "mdd_a8": "present",
      "mdd_a9": "absent",
      "mdd_exc_substance": "cleared",
      "mdd_exc_medical": "cleared",
      "mdd_exc_psychotic": "cleared",
      "mdd_exc_bipolar": "cleared",
      "mdd_subj_clinical_significance": "met",
      "duration_days": 21
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 363
    }
  },
  {
    "id": "vig_011_gad_moderate_70b950d5",
    "ground_truth": [
      "gad"
    ],
    "difficulty": "MODERATE",
    "meets_criteria": true,
    "clinical_text": "29-year-old software engineer presents with \"I'm kind of worried about everything, especially work, and I can't turn it off.\"\n\nHISTORY OF PRESENT ILLNESS\nPatient reports a roughly 6-month history of pervasive worry that began around July 2025. Worry occurs more days than not and focuses on multiple domains, primarily work performance and upcoming evaluations, but also occasionally social and financial situations. Patient states, \"I spend hours going over what I said in meetings,\" and \"sometimes I wake up already thinking about the day and can't stop.\" Reports difficulty controlling the worry: attempts to distract or problem-solve only partially helpful and worries return. Describes persistent muscle tension with tightness in the neck and shoulders and frequent jaw clenching. Endorses increased time spent double-checking code and emails, leading to longer workdays. Duration approximately 6 months.\n\nPAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\nFAMILY HISTORY\nMother had episodes of long-standing low mood treated in the past; father has hypertension.\n\nMEDICAL HISTORY AND SUBSTANCES\nNo significant medical conditions reported. Substance use: alcohol 1–2 drinks once weekly, denies recreational drug use, caffeine 2–3 cups coffee daily. Labs: TSH normal, metabolic panel unremarkable, toxicology negative. Medications: no current prescription medications; OTC ibuprofen PRN.\n\nMENTAL STATUS EXAMINATION\nAppearance: casually dressed, slightly hunched posture with hands often on shoulders. Behavior: cooperative, engaged but somewhat tense. Speech: normal rate and volume. Mood (subjective): \"a little on edge, kind of worried most days.\" Affect (observed): anxious, restricted range at times. Thought process: linear and goal-directed but preoccupied with future events and performance concerns. Thought content: no suicidal or homicidal ideation reported; no perceptual disturbances. Cognition: oriented to person, place, time; memory intact on bedside testing. Insight: recognizes worries are excessive and reports difficulty controlling them. Denies restlessness or feeling keyed up or on edge. Denies being easily fatigued. Denies difficulty concentrating or mind going blank. Denies irritability.\n\nFUNCTIONAL IMPACT\nWork: decreased efficiency, longer work hours, missed deadlines from repeated checking and reworking tasks. Relationships: withdraws from partners/friends when rumination is heavy, declines social invitations. Daily activities: delays household tasks, spends evening hours ruminating, reports muscle tightness interferes with comfortable sleep position.",
    "answers": {
      "gad_a": "present",
      "gad_b": "present",
      "gad_c1": "absent",
      "gad_c2": "absent",
      "gad_c3": "absent",
      "gad_c4": "absent",
      "gad_c5": "present",
      "gad_c6": "absent",
      "gad_exc_substance": "cleared",
      "gad_exc_medical": "cleared",
      "gad_exc_panic": "cleared",
      "gad_exc_social_anxiety": "cleared",
      "gad_exc_ocd": "cleared",
      "gad_exc_separation": "cleared",
      "gad_exc_ptsd": "cleared",
      "gad_exc_anorexia": "cleared",
      "gad_exc_somatic": "cleared",
      "gad_exc_bdd": "cleared",
      "gad_exc_illness_anxiety": "cleared",
      "gad_exc_psychotic": "cleared",
      "gad_subj_clinical_significance": "met",
      "gad_subj_excessive": "met",
      "duration_days": 187
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 351
    }
  },
  {
    "id": "vig_012_adhd_mdd_comorbid_ca95b66b",
    "ground_truth": [
      "adhd",
      "mdd"
    ],
    "difficulty": "COMORBID",
    "meets_criteria": true,
    "clinical_text": "27-year-old software engineer presents with \"I can't focus at work, I start things and never finish them, and lately I feel sad all the time.\"\n\nHISTORY OF PRESENT ILLNESS\nPatient reports ~6 months of worsening concentration and low mood. \"I miss details in code reviews and miss deadlines,\" and \"my mind just drifts in meetings — I hear things but it's like I'm not there.\" Symptoms present for approximately 6 month(s); began around July 2025. Patient describes lifelong patterns of distractibility, noting \"this started when I was a kid,\" and states, \"I remember having trouble sitting still in class.\" Symptoms first appeared around age 9. Timeline: childhood inattentive behaviors reported, relatively managed until 6 months ago when workload increased and low mood and sleep disturbance emerged. Reports difficulty sustaining attention during lectures, long documents, and conversations; often does not seem to listen when spoken to directly (mind elsewhere). Describes frequent careless mistakes at work, losing keys and paperwork multiple times per week, and starting tasks but quickly becoming sidetracked. Reports avoiding tasks that require prolonged effort (performance reviews, expense reports). Notes increased restlessness (tapping feet, rising from seat in meetings), talking more than usual, interrupting colleagues, and answering before questions completed. Also reports feeling sad most days, diminished pleasure in hobbies, decreased appetite with 6 lb weight loss over one month, early insomnia, low energy, feelings of worthlessness, and marked difficulty concentrating. Denies current thoughts of harming self or others.\n\nPAST PSYCHIATRIC HISTORY\nNo prior psychiatric history; no prior hospitalizations, no prior therapy or psychiatric medications reported.\n\nFAMILY HISTORY\nMother reported to have long-standing low mood and received counseling; no known hospitalizations.\n\nMEDICAL HISTORY AND SUBSTANCES\nNo chronic medical conditions. Substance use: alcohol socially 1–2 times/week, denies recreational drug use, caffeine 2–3 cups coffee daily. TSH normal. Metabolic panel unremarkable. Toxicology negative. Medications: no current prescriptions; OTC multivitamin, occasional ibuprofen.\n\nPERTINENT NEGATIVES\nDenies hallucinations. No delusions reported. Denies current suicidal ideation, intent, or plans. No homicidal ideation.\n\nMENTAL STATUS EXAMINATION\nAppearance: casually dressed, slightly disheveled. Behavior: restless, frequently shifts in seat, taps foot. Speech: normal rate, somewhat pressured at times. Mood: reports \"sad, tired.\" Affect: constricted, tearful at times. Thought process: tangential at times, frequent interruptions, answers before questions completed. Thought content: no fixed false beliefs elicited. Perceptions: no hallucinations reported. Insight: fair; recognizes problems but attributes largely to workload.",
    "answers": {
      "adhd_a1a": "present",
      "adhd_a1b": "present",
      "adhd_a1c": "present",
      "adhd_a1d": "present",
      "adhd_a1e": "present",
      "adhd_a1f": "present",
      "adhd_a1g": "present",
      "adhd_a1h": "present",
      "adhd_a1i": "present",
      "adhd_a2a": "present",
      "adhd_a2b": "present",
      "adhd_a2c": "present",
      "adhd_a2d": "present",
      "adhd_a2e": "present",
      "adhd_a2f": "present",
      "adhd_a2g": "present",
      "adhd_a2h": "present",
      "adhd_a2i": "present",
      "adhd_exc_psychotic": "cleared",
      "adhd_exc_mood": "cleared",
      "adhd_exc_anxiety": "cleared",
      "adhd_exc_dissociative": "cleared",
      "adhd_exc_personality": "cleared",
      "adhd_exc_substance": "cleared",
      "adhd_subj_functional_impairment": "met",
      "adhd_subj_developmental": "met",
      "adhd_subj_not_oppositional": "met",
      "duration_days": 194,
      "onset_age": 9,
      "mdd_a1": "present",
      "mdd_a2": "present",
      "mdd_a3": "present",
      "mdd_a4": "present",
      "mdd_a5": "present",
      "mdd_a6": "present",
      "mdd_a7": "present",
      "mdd_a8": "present",
      "mdd_a9": "present",
      "mdd_exc_substance": "cleared",
      "mdd_exc_medical": "cleared",
      "mdd_exc_psychotic": "cleared",
      "mdd_exc_bipolar": "cleared",
      "mdd_subj_clinical_significance": "met"
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 390
    }
  },
  {
    "id": "vig_013_ptsd_clear_8159e0a2",
    "ground_truth": [
      "ptsd"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n34-year-old paramedic presents with \"I can't stop seeing the crash and I feel like I'm back there all the time.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports involvement in a multi-vehicle collision while on duty approximately 1 month ago (began 2025-12-02). States he was crushed in the cab briefly and \"felt the metal closing around me,\" and watched a young child in a neighboring vehicle die at the scene. He learned later that a close fellow paramedic and friend died from injuries sustained that night. Patient describes repeated on-scene exposure to injured bodies and blood while working multiple recovery shifts in the days after the incident. \"I smell gasoline and I'm back in the cab,\" he says. Reports recurrent, involuntary, intrusive memories throughout the day: visual flashbacks of the child's face, tactile memory of being trapped, and dissociative episodes in which he feels as if the event is happening again, including trembling and transient tunnel vision. Reports distressing dreams multiple nights per week that replay the scene: \"I wake up sweating and can't tell what is now.\" Avoids driving the route of the crash, avoids coworkers who were at the scene, and has stopped attending department debriefs. Reports difficulty remembering some minutes immediately before extrication. Describes persistent feelings of guilt and shame, frequent anger outbursts at home, withdrawal from partner, diminished enjoyment of previously valued activities, hypervigilance when hearing sirens, exaggerated startle to loud noises, difficulty concentrating at work, and restless fragmented sleep.\n\nDuration: Symptoms present for approximately 1 month(s). Began 2025-12-02 following the workplace multi-vehicle collision.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\n4. FAMILY HISTORY\nFather with history of heavy alcohol use; no known psychiatric treatment in immediate family.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nNo chronic medical conditions reported.\nSubstance use: alcohol 3–4 beers twice weekly; denies recreational drug use; caffeine ~3 cups coffee/day.\nTSH normal; metabolic panel unremarkable; toxicology negative.\nMedications: no current prescriptions; OTC ibuprofen PRN.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: disheveled, wearing uniform jacket; good hygiene.\nBehavior: guarded, fidgety, frequently scanning room.\nMood: \"on edge\" and \"numb.\"\nAffect: constricted, tearful at times.\nThought content: preoccupied with crash details; recurrent intrusive images; denies current suicidal plan or intent; endorses passive thoughts of wishing to \"be somewhere else\" once weekly; protective factors include partner and team support. Denies homicidal ideation.\nCognition: oriented x3; concentration impaired by intrusive memories.\nInsight: recognizes symptoms relate to the incident but blames self for not doing more at scene.\nPERTINENT NEGATIVES\nDenies auditory hallucinations. Denies visual hallucinations outside of intrusive memories/flashbacks. Denies current suicidal plan or intent. Denies recreational drug use.",
    "answers": {
      "ptsd_a1": "present",
      "ptsd_a2": "present",
      "ptsd_a3": "present",
      "ptsd_a4": "present",
      "ptsd_b1": "present",
      "ptsd_b2": "present",
      "ptsd_b3": "present",
      "ptsd_b4": "present",
      "ptsd_b5": "present",
      "ptsd_c1": "present",
      "ptsd_c2": "present",
      "ptsd_d1": "present",
      "ptsd_d2": "present",
      "ptsd_d3": "present",
      "ptsd_d4": "present",
      "ptsd_d5": "present",
      "ptsd_d6": "present",
      "ptsd_d7": "present",
      "ptsd_e1": "present",
      "ptsd_e2": "present",
      "ptsd_e3": "present",
      "ptsd_e4": "present",
      "ptsd_e5": "present",
      "ptsd_e6": "present",
      "ptsd_exc_substance": "cleared",
      "ptsd_exc_medical": "cleared",
      "ptsd_exc_dissociative_substance": "cleared",
      "ptsd_exc_dissociative_medical": "cleared",
      "ptsd_subj_distress": "met",
      "ptsd_subj_trauma_quality": "met",
      "ptsd_subj_violent_accidental": "met",
      "duration_days": 37
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 435
    }
  },
  {
    "id": "vig_014_asd_ambiguous_dfa6d193",
    "ground_truth": [
      "asd"
    ],
    "difficulty": "AMBIGUOUS",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n21-year-old college student presents with \"I just don't click with people, but it's not that big a deal.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports a 3-week worsening of social difficulty that began after starting a new seminar; notes similar problems first appeared around age 16. Patient describes difficulty with back-and-forth conversation, often speaking at length about narrow topics and not noticing when others disengage: \"I can talk for 20 minutes about trains and not realize they're bored.\" Patient reports reduced sharing of emotions and interests with others: \"I don't really talk about how I feel; it's awkward.\" Observed behaviors include limited spontaneous initiation of social contact, delayed or absent responses to conversational bids, minimal reciprocal questioning, and avoidance of group interactions. Nonverbal communication described as limited — poor eye contact, little facial animation, and infrequent use of gestures. Reports repetitive speech and motor patterns: repeats phrases heard on television and flips a coin repeatedly when anxious. Describes one intensely focused interest (collecting timetables and online forums about transit) occupying multiple hours per day. Timeline: symptoms present for approximately 3 week(s), began ~3 weeks ago with current exacerbation; patient notes similar features intermittently since age 16.\n\nDenies insistence on sameness, inflexible adherence to routines, or ritualized patterns of verbal or nonverbal behavior. Denies hyper- or hyporeactivity to sensory input or unusual interest in sensory aspects of the environment.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history; no previous therapy or psychotropic medication use reported.\n\n4. FAMILY HISTORY\nFamily history notable for a parent who has received unspecified psychiatric treatment.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nNo significant medical history. No current medications. Drinks alcohol socially (1–2 times/week), denies recreational drug use.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, hygiene adequate. Behaviour: minimal reciprocal gestures, repetitive finger-tapping observed. Speech: normal rate, monotone, often literal. Mood (subjective): \"I'm okay, it's manageable.\" Affect (observed): restricted, blunted range. Thought process: concrete, tangential when discussing special interests, occasional echolalic phrasing. Cognition: oriented ×3, attention and short-term memory intact on bedside testing. Insight: limited; patient minimizes impact on functioning. Functional impact: decreased participation in group projects and class discussions, few peer relationships and increasing isolation with roommates, daily routines intact but time-consuming special interests interfere with study and social obligations.",
    "answers": {
      "asd_a1": "present",
      "asd_a2": "present",
      "asd_a3": "present",
      "asd_b1": "present",
      "asd_b2": "absent",
      "asd_b3": "present",
      "asd_b4": "absent",
      "asd_exc_intellectual_disability": "cleared",
      "asd_subj_impairment": "met",
      "asd_subj_early_onset": "met",
      "asd_subj_severity_social": "met",
      "asd_subj_severity_rrb": "met",
      "duration_days": 21,
      "onset_age": 16
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 378
    }
  },
  {
    "id": "vig_015_mdd_clear_934b1b51",
    "ground_truth": [
      "mdd"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n   \"34-year-old elementary school teacher presents with 'I can't shake this hopelessness and want to die sometimes'\"\n\n2. HISTORY OF PRESENT ILLNESS\n   Patient reports a three-week history of progressively worsening low mood beginning approximately 3 weeks ago around December 15, 2025. States, \"I feel empty all the time\" and \"things that used to make me happy just don't anymore.\" Describes marked loss of interest in previously enjoyed activities (stopped attending weekend art classes, no longer plays with children in classroom). Reports a 12-pound weight loss since onset without dieting and a noticeable decrease in appetite: \"I skip meals because food just tastes like nothing.\" Sleep has been disrupted with early morning awakening and overall poor sleep quality most nights. Observers (partner, colleagues) report slowed movements and slowed speech; patient admits feeling slowed and shows delayed responses in interview. Endorses near-daily fatigue: \"I have no energy to get through the day.\" Describes pervasive feelings of worthlessness and excessive guilt: \"I deserve this, it's my fault everything's going wrong.\" Reports difficulty concentrating at work and indecisiveness; recent errors in lesson plans and missed deadlines. Reports recurrent thoughts of death, stating \"I keep thinking about not waking up\" but denies any specific plan; \"I haven't made a plan.\" Two prior quotes recorded: \"I can't shake this empty feeling\" and \"I've been thinking about not waking up lately.\" Symptoms present for approximately 3 weeks.\n\nPERTINENT NEGATIVES\n   Denies current suicidal plan or intent. Denies homicidal ideation. Denies hearing voices or seeing things. Denies recent manic-like periods.\n\n3. PAST PSYCHIATRIC HISTORY\n   No prior psychiatric history.\n\n4. FAMILY HISTORY\n   Mother had long-standing mood problems and a history of hospitalization for suicidal thoughts.\n\n5. MEDICAL HISTORY AND SUBSTANCES\n   No significant medical problems reported. Substance use: drinks alcohol 1–2 times weekly (1–2 drinks), no recreational drug use, caffeine 1–2 cups coffee daily. TSH normal. Metabolic panel unremarkable. Toxicology negative. Medications: no prescription medications; uses OTC melatonin occasionally and ibuprofen as needed.\n\n6. MENTAL STATUS EXAMINATION\n   Appearance: casually dressed, mild weight loss evident. Behavior: psychomotor retardation with slowed gait and delayed movements. Speech: slowed, low volume. Mood: subjectively \"hopeless, empty.\" Affect: restricted, tearful at times. Thought process: slowed, concrete, occasional ruminative loops. Thought content: preoccupation with death; no fixed false beliefs reported. Perceptions: denies hallucinations. Insight: limited; acknowledges problem but attributes entirely to personal failure.",
    "answers": {
      "mdd_a1": "present",
      "mdd_a2": "present",
      "mdd_a3": "present",
      "mdd_a4": "present",
      "mdd_a5": "present",
      "mdd_a6": "present",
      "mdd_a7": "present",
      "mdd_a8": "present",
      "mdd_a9": "present",
      "mdd_exc_substance": "cleared",
      "mdd_exc_medical": "cleared",
      "mdd_exc_psychotic": "cleared",
      "mdd_exc_bipolar": "cleared",
      "mdd_subj_clinical_significance": "met",
      "duration_days": 21
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 389
    }
  },
  {
    "id": "vig_016_gad_clear_c1f5370b",
    "ground_truth": [
      "gad"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "29-year-old software engineer presents with \"I worry about everything and I can't turn it off.\"\n\nHISTORY OF PRESENT ILLNESS\nSymptoms present for approximately 6 months, beginning July 2025. Patient reports excessive, persistent worry about work performance, upcoming meetings, finances, and family health occurring more days than not. States, \"I lie awake thinking about every mistake I've made at work,\" and \"I wake up at 3 a.m. and my brain won't stop.\" Describes an inability to control the worry: attempts to problem-solve escalate the worry rather than stop it. Reports feeling \"keyed up\" and restless throughout the day, frequent muscle tightness in neck and shoulders, and becoming easily fatigued despite not engaging in additional activity. Notes difficulty concentrating and episodes where their \"mind goes blank\" during presentations, leading to increased avoidance of speaking in meetings. Reports increased irritability with partner and coworkers over minor issues. Sleep is disturbed—difficulty falling asleep and multiple overnight awakenings with nonrestorative sleep. Denies suicidal ideation, intent, or plan. Denies hearing voices or seeing things, and denies paranoid beliefs.\n\nPAST PSYCHIATRIC HISTORY\nNo prior psychiatric history. No prior psychiatric medications or hospitalizations.\n\nFAMILY HISTORY\nMother has longstanding excessive worry and takes medication intermittently; no known hospitalizations in family.\n\nMEDICAL HISTORY AND SUBSTANCES\nMedical history notable for seasonal allergies; otherwise well. Alcohol: 1–2 drinks on weekends. Recreational drugs: denies current or recent use. Caffeine: 2–3 cups coffee daily. TSH normal, metabolic panel unremarkable, toxicology negative. Current medications: none prescription; OTC ibuprofen as needed and daily multivitamin.\n\nMENTAL STATUS EXAMINATION\nAppearance: casually dressed, mildly disheveled. Behavior: restless, repeatedly shifts in seat and rubs shoulders. Speech: normal volume, slightly rapid. Mood (subjective): \"on edge,\" \"overwhelmed.\" Affect (observed): tense, constricted range. Thought process: logical but preoccupied with worries. Thought content: preoccupation with work/family concerns; denies suicidal or homicidal ideation, denies perceptual disturbance. Cognition: oriented x3; attention and concentration decreased with intermittent blanking. Insight: recognizes symptoms and seeks help; motivation for change present.",
    "answers": {
      "gad_a": "present",
      "gad_b": "present",
      "gad_c1": "present",
      "gad_c2": "present",
      "gad_c3": "present",
      "gad_c4": "present",
      "gad_c5": "present",
      "gad_c6": "present",
      "gad_exc_substance": "cleared",
      "gad_exc_medical": "cleared",
      "gad_exc_panic": "cleared",
      "gad_exc_social_anxiety": "cleared",
      "gad_exc_ocd": "cleared",
      "gad_exc_separation": "cleared",
      "gad_exc_ptsd": "cleared",
      "gad_exc_anorexia": "cleared",
      "gad_exc_somatic": "cleared",
      "gad_exc_bdd": "cleared",
      "gad_exc_illness_anxiety": "cleared",
      "gad_exc_psychotic": "cleared",
      "gad_subj_clinical_significance": "met",
      "gad_subj_excessive": "met",
      "duration_days": 187
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 321
    }
  },
  {
    "id": "vig_017_adhd_ambiguous_6110c579",
    "ground_truth": [
      "adhd"
    ],
    "difficulty": "AMBIGUOUS",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n\"27-year-old graphic designer presents with 'I can't focus and it's making work messy, but it's not that big a deal.'\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports a long-standing pattern of attention and impulsivity that he first noticed around age 10; current difficulties have been more disruptive over the past 6 months. He states, \"I used to be able to get by, but lately I'm missing small things on projects,\" and gives examples of overlooking color codes on client files and submitting print-ready art with typographical errors. Reports difficulty sustaining attention during staff meetings and lengthy emails: \"I zone out in meetings and miss instructions.\" Also describes frequent failure to follow through on multi-step tasks — starting design revisions but quickly shifting to other tasks and leaving items incomplete. Avoids long tasks such as preparing client reports, saying he \"puts it off until the last minute.\" Frequently loses items needed for work and daily life (keys, stylus, a notebook). Describes leaving his seat during office training sessions and difficulty remaining quiet at informal team gatherings, often talking excessively and interrupting coworkers; gives examples of blurting out answers in brainstorming meetings and taking another person's laptop cable without asking. Symptoms present for approximately 6 month(s).\n\nPertinent negatives: Denies difficulty organizing tasks and activities. Denies being often easily distracted by extraneous stimuli. Denies being often forgetful in daily activities. Denies fidgeting, tapping hands or feet, or squirming in seat.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\n4. FAMILY HISTORY\nFather with history of heavy alcohol use; no known hospitalizations for mental health in close relatives.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nNo significant medical history. Alcohol: 1–2 drinks socially on weekends. Recreational drugs: denies current or past illicit drug use. Caffeine: 2 cups of coffee daily.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, well-groomed. Behaviour: cooperative but frequently shifts posture and gestures when speaking. Speech: normal rate and volume, at times tangential. Mood: reports feeling \"fine\" and \"a bit stressed.\" Affect: full range, mildly constricted at times. Thought process: goal-directed but with occasional tangential remarks and impulsive interjections. Thought content: denies delusional ideas. Perceptions: denies hallucinations. Insight: limited; patient minimizes impact of symptoms and states \"I manage most of the time.\"",
    "answers": {
      "adhd_a1a": "present",
      "adhd_a1b": "present",
      "adhd_a1c": "present",
      "adhd_a1d": "present",
      "adhd_a1e": "absent",
      "adhd_a1f": "present",
      "adhd_a1g": "present",
      "adhd_a1h": "absent",
      "adhd_a1i": "absent",
      "adhd_a2a": "absent",
      "adhd_a2b": "present",
      "adhd_a2c": "absent",
      "adhd_a2d": "present",
      "adhd_a2e": "absent",
      "adhd_a2f": "present",
      "adhd_a2g": "present",
      "adhd_a2h": "present",
      "adhd_a2i": "present",
      "adhd_exc_psychotic": "cleared",
      "adhd_exc_mood": "cleared",
      "adhd_exc_anxiety": "cleared",
      "adhd_exc_dissociative": "cleared",
      "adhd_exc_personality": "cleared",
      "adhd_exc_substance": "cleared",
      "adhd_subj_functional_impairment": "met",
      "adhd_subj_developmental": "met",
      "adhd_subj_not_oppositional": "met",
      "duration_days": 187,
      "onset_age": 10
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 374
    }
  },
  {
    "id": "vig_018_ptsd_clear_4c1daf02",
    "ground_truth": [
      "ptsd"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "DEMOGRAPHICS AND CHIEF COMPLAINT\n34-year-old paramedic presents with \"I can't stop seeing it and I can't sleep.\"\n\nHISTORY OF PRESENT ILLNESS\nPatient reports onset approximately 1 month ago after responding to a multi-vehicle highway collision in which they were injured, witnessed multiple victims, and later learned that a close friend (also a first responder) died from injuries sustained at the scene. Patient states, \"I still hear the metal and smell the gasoline,\" and \"I see him on the side of the road — it feels like it's happening again.\" Describes repeated occupational exposure to graphic injury scenes over the past month while working extra shifts. Endorses recurrent, involuntary visual memories and intrusive images several times per day, recurrent nightmares with the same crash content multiple nights weekly, and episodic dissociative reactions during which they feel transported back to the scene (\"I will be driving and suddenly I'm there, like I'm back at the wreck\"). Reports intense distress and heart racing when hearing sirens or passing the stretch of highway; avoids driving that route and declines to speak about the event with colleagues. Describes inability to recall the moment when the friend died, saying \"there's a blank where it should be.\" Reports persistent feelings of guilt (\"I should have done more\"), shame, numbness toward things that used to bring joy, frequent irritability and shouting at family, one episode of speeding through an intersection without regard for safety, hypervigilance in crowds, exaggerated startle to loud noises, trouble concentrating at work with one near-miss handling equipment, and difficulty falling and staying asleep with frequent night awakenings.\n\nPERTINENT NEGATIVES\nDenies hearing voices or seeing things that are not present. Denies current use of recreational drugs. Denies prior suicide attempts.\n\nPAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\nFAMILY HISTORY\nFather with history of alcohol use; otherwise noncontributory.\n\nMEDICAL HISTORY AND SUBSTANCES\nNo significant medical conditions. Substance use: alcohol 2–3 drinks 2–3 times/week, no recreational drug use, caffeine 2–3 cups/day. TSH normal. Metabolic panel unremarkable. Toxicology negative. Medications: ibuprofen PRN, no prescribed psychotropic medications.\n\nMENTAL STATUS EXAMINATION\nAppearance: casually dressed, somewhat disheveled; hygiene adequate. Behavior: guarded, restless, scans room. Mood: \"terrified, guilty.\" Affect: constricted, tearful at times, congruent to content. Thought content: preoccupied with intrusive memories; occasional passive wish not to wake up reported about once weekly, no plan or intent, protective factors include spouse and dependent child. No homicidal ideation reported. Cognition: alert and oriented ×3, concentration impaired. Insight: acknowledges symptoms and desire for help.",
    "answers": {
      "ptsd_a1": "present",
      "ptsd_a2": "present",
      "ptsd_a3": "present",
      "ptsd_a4": "present",
      "ptsd_b1": "present",
      "ptsd_b2": "present",
      "ptsd_b3": "present",
      "ptsd_b4": "present",
      "ptsd_b5": "present",
      "ptsd_c1": "present",
      "ptsd_c2": "present",
      "ptsd_d1": "present",
      "ptsd_d2": "present",
      "ptsd_d3": "present",
      "ptsd_d4": "present",
      "ptsd_d5": "present",
      "ptsd_d6": "present",
      "ptsd_d7": "present",
      "ptsd_e1": "present",
      "ptsd_e2": "present",
      "ptsd_e3": "present",
      "ptsd_e4": "present",
      "ptsd_e5": "present",
      "ptsd_e6": "present",
      "ptsd_exc_substance": "cleared",
      "ptsd_exc_medical": "cleared",
      "ptsd_exc_dissociative_substance": "cleared",
      "ptsd_exc_dissociative_medical": "cleared",
      "ptsd_subj_distress": "met",
      "ptsd_subj_trauma_quality": "met",
      "ptsd_subj_violent_accidental": "met",
      "duration_days": 37
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 410
    }
  },
  {
    "id": "vig_019_mdd_ptsd_comorbid_212a8c8c",
    "ground_truth": [
      "mdd",
      "ptsd"
    ],
    "difficulty": "COMORBID",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n34-year-old paramedic presents with \"I can't stop reliving what happened and I feel numb and worthless.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports symptoms began approximately 1 month ago after responding to a large multi-vehicle collision on duty. \"I keep seeing them in my head, even when I'm trying to sleep,\" and \"I feel like I failed everyone.\" Reports nearly daily low mood described as sadness, emptiness and hopelessness; observed tearfulness in clinic. Describes markedly reduced interest or pleasure in formerly enjoyed activities (no longer visits friends, stopped running). Reports 7% weight loss over the past month with decreased appetite. Sleeping 3–4 hours/night with frequent nightmares about the incident; also reports episodes of sudden dissociative re-experiencing where he feels as if the event is occurring (\"I snap back into it and can't tell what is real for a minute\"). Reports slowed movements noted by partner and coworkers and intermittent restlessness. Describes persistent fatigue, excessive guilt (\"I should have done more\"), poor concentration at work with recent near-miss on scene. Reports recurrent thoughts of death and passive suicidal ideation without a specific plan; denies intent. Avoids routes and locations associated with the incident and feels detached from family. Reports increased irritability and one episode of throwing a phone during an argument. Describes hypervigilance, exaggerated startle response, intrusive memories and recurrent distressing dreams.\n\n3. PERTINENT NEGATIVES\nDenies past suicidal attempts. Denies current intent or a specific plan for self-harm. Denies current use of illicit drugs. Denies visual or auditory hallucinations. No homicidal ideation reported.\n\n4. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history. No prior psychiatric medications or therapy.\n\n5. FAMILY HISTORY\nFather with history of alcohol problems; no known psychiatric hospitalizations in first-degree relatives.\n\n6. MEDICAL HISTORY AND SUBSTANCES\nPMH: none significant. Substance use: alcohol 2–3 drinks 2–3 times/week, denies recreational drug use, caffeine 2 cups/day. Labs: 'TSH normal', 'metabolic panel unremarkable', 'toxicology negative'. Medications: OTC ibuprofen PRN.\n\n7. MENTAL STATUS EXAMINATION\nAppearance: disheveled, weight decreased. Behavior: cooperative but slowed motor movements. Speech: soft, mildly slowed. Mood: \"empty, overwhelmed.\" Affect: constricted, tearful. Thought process: linear but ruminative. Thought content: passive death wishes, no delusional ideation. Perceptions: no hallucinations. Insight: limited; recognizes symptoms but attributes them to personal failure. Judgment: impaired by poor concentration and fatigue.\n\nDURATION\nSymptoms present for approximately 1 month, beginning after the occupational traumatic event.\n\nFUNCTIONAL IMPACT\nWork: decreased attention and near-miss at work, took sick days and pending leave. Relationships: withdrawn from partner and friends, frequent arguments. Daily activities: decreased self-care, stopped exercise and social activities, difficulty driving past the scene.",
    "answers": {
      "mdd_a1": "present",
      "mdd_a2": "present",
      "mdd_a3": "present",
      "mdd_a4": "present",
      "mdd_a5": "present",
      "mdd_a6": "present",
      "mdd_a7": "present",
      "mdd_a8": "present",
      "mdd_a9": "present",
      "mdd_exc_substance": "cleared",
      "mdd_exc_medical": "cleared",
      "mdd_exc_psychotic": "cleared",
      "mdd_exc_bipolar": "cleared",
      "mdd_subj_clinical_significance": "met",
      "duration_days": 44,
      "ptsd_a1": "present",
      "ptsd_a2": "present",
      "ptsd_a3": "present",
      "ptsd_a4": "present",
      "ptsd_b1": "present",
      "ptsd_b2": "present",
      "ptsd_b3": "present",
      "ptsd_b4": "present",
      "ptsd_b5": "present",
      "ptsd_c1": "present",
      "ptsd_c2": "present",
      "ptsd_d1": "present",
      "ptsd_d2": "present",
      "ptsd_d3": "present",
      "ptsd_d4": "present",
      "ptsd_d5": "present",
      "ptsd_d6": "present",
      "ptsd_d7": "present",
      "ptsd_e1": "present",
      "ptsd_e2": "present",
      "ptsd_e3": "present",
      "ptsd_e4": "present",
      "ptsd_e5": "present",
      "ptsd_e6": "present",
      "ptsd_exc_substance": "cleared",
      "ptsd_exc_medical": "cleared",
      "ptsd_exc_dissociative_substance": "cleared",
      "ptsd_exc_dissociative_medical": "cleared",
      "ptsd_subj_distress": "met",
      "ptsd_subj_trauma_quality": "met",
      "ptsd_subj_violent_accidental": "met"
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 428
    }
  },
  {
    "id": "vig_020_mdd_clear_64a5507f",
    "ground_truth": [
      "mdd"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n   \"34-year-old software engineer presents with 'I can't get out of this fog'\"\n\n2. HISTORY OF PRESENT ILLNESS\n   Patient reports a 3-week history of pervasive low mood beginning approximately three weeks ago after a project deadline missed at work. States, \"I feel sad and empty most of the day,\" and \"I don't enjoy anything anymore.\" Describes markedly decreased interest in previously enjoyed activities: stopped running (used to run 4–5x/week), stopped meeting friends for weekly board games, and has not opened a guitar in over two weeks. Reports a 12-pound weight loss since onset without dieting and states appetite is \"barely there.\" Sleep disturbed: falls asleep late and wakes early with difficulty returning to sleep; also reports naps during day that leave him unrefreshed. Colleagues note he appears slowed in movement and speech; patient reports feeling slowed, taking longer to complete simple tasks and needing frequent rests. Endorses near-daily fatigue and says, \"I don't have the energy to do anything.\" Describes excessive guilt, stating he \"ruins everything\" and is \"a burden\" on family. Reports difficulty concentrating at work, missing details in code reviews, and recent indecision about routine choices. Admits recurrent thoughts of death, stating \"Sometimes I think about not waking up,\" without an active plan; has had one prior passive thought of self-harm last week but denies any attempts.\n\nPERTINENT NEGATIVES\n   Denies current intent or formulated plan to harm self. Denies intent to harm others. Denies auditory or visual experiences. Denies recent recreational substance use to cope. Denies periods of markedly elevated energy or decreased need for sleep.\n\n3. PAST PSYCHIATRIC HISTORY\n   No prior psychiatric history. No prior psychiatric medications or hospitalizations.\n\n4. FAMILY HISTORY\n   Mother with history of mood-related treatment; father alive, no known psychiatric history.\n\n5. MEDICAL HISTORY AND SUBSTANCES\n   Hypertension treated with lisinopril. Substance use: alcohol 1–2 drinks on weekends, no recreational drugs, caffeine 2 cups/day. Labs: TSH normal, metabolic panel unremarkable, toxicology negative. Medications: lisinopril 10 mg daily; OTC multivitamin.\n\n6. MENTAL STATUS EXAMINATION\n   Appearance: disheveled, 34-year-old male. Behavior: cooperative but psychomotor slowing observed (slow gait, delayed responses). Speech: low volume, slowed rate. Mood: subjectively \"sad, empty.\" Affect: restricted, tearful at times. Thought process: linear but slowed. Thought content: expresses excessive guilt; recurrent thoughts of death without active plan. Perceptions: denies hallucinations. Insight: limited to fair; acknowledges problem but minimizes severity.",
    "answers": {
      "mdd_a1": "present",
      "mdd_a2": "present",
      "mdd_a3": "present",
      "mdd_a4": "present",
      "mdd_a5": "present",
      "mdd_a6": "present",
      "mdd_a7": "present",
      "mdd_a8": "present",
      "mdd_a9": "present",
      "mdd_exc_substance": "cleared",
      "mdd_exc_medical": "cleared",
      "mdd_exc_psychotic": "cleared",
      "mdd_exc_bipolar": "cleared",
      "mdd_subj_clinical_significance": "met",
      "duration_days": 21
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 389
    }
  },
  {
    "id": "vig_021_mdd_gad_comorbid_ac1ddf67",
    "ground_truth": [
      "mdd",
      "gad"
    ],
    "difficulty": "COMORBID",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n   \"34-year-old software engineer presents with 'I can't get out of this cloud'\"\n\n2. HISTORY OF PRESENT ILLNESS\n   Patient reports a gradual worsening of symptoms beginning approximately July 2025. \"I feel sad all day, like an empty weight,\" and \"I can't enjoy anything anymore\" are repeated themes. Describes most days feeling low from morning to night, appearing tearful during interview and reported by partner. Reports marked loss of interest in previously enjoyed activities (no longer goes mountain biking or meets friends). Appetite has decreased with an observed 7% body weight loss over the past month after no intentional dieting. Reports difficulty falling asleep and frequent early-morning awakening; naps leave patient unrefreshed. Partner notes slowed movements and delayed responses; patient admits to speaking more slowly and moving more deliberately most days. Describes pervasive fatigue and low energy interfering with routine. Reports recurrent thoughts of death and recurrent suicidal ideation without a specific plan, stating \"Sometimes I wish I wouldn't wake up,\" but denies any current intent to act. Endorses pervasive feelings of worthlessness and excessive guilt, saying \"I ruined my team's project because of how slow I am.\" Reports marked difficulty concentrating, frequent mind-blanking at work, and trouble making even small decisions.\n\n3. DURATION\n   Symptoms present for approximately 6 month(s). Began around July 2025 and have been persistent and progressively impairing.\n\n4. FUNCTIONAL IMPACT\n   Work: Frequent missed deadlines, decreased productivity, errors in coding, two recent sick days for inability to function. Relationships: Withdrawing from partner, increased irritability, fewer social contacts, partner reports frequent arguments. Daily activities: Neglects household chores, decreased self-care (skipping showers 3–4 times/week), no longer engages in exercise or hobbies.\n\n5. PAST PSYCHIATRIC HISTORY\n   No prior psychiatric history; no prior psychotropic medication trials; no prior hospitalizations.\n\n6. FAMILY HISTORY\n   Father with long-standing mood symptoms treated intermittently; mother alive, no known psychiatric treatment.\n\n7. MEDICAL HISTORY AND SUBSTANCES\n   Substance use: Alcohol 1–2 drinks on weekends; denies recreational drug use; caffeine 2–3 cups/day.\n   Labs: TSH normal; metabolic panel unremarkable; toxicology negative.\n   Medications: No prescription medications; OTC occasional ibuprofen, daily multivitamin.\n\n8. PERTINENT NEGATIVES\n   Denies current intent or specific plan to harm self; Denies auditory or visual hallucinations; Denies paranoid or fixed false beliefs.\n\n9. MENTAL STATUS EXAMINATION\n   Appearance: casually dressed, mildly disheveled. Behaviour: cooperative but slowed movements. Speech: speech rate decreased, monotone. Mood: reports depressed, hopeless. Affect: constricted, tearful at times. Thought process: goal-directed but slowed, with frequent latency. Thought content: passive suicidal ideation without plan; excessive self-blame and worthlessness; no delusional content elicited. Perceptions: Denies hallucinations. Insight: limited; recognizes problem but attributes entirely to personal failure.",
    "answers": {
      "mdd_a1": "present",
      "mdd_a2": "present",
      "mdd_a3": "present",
      "mdd_a4": "present",
      "mdd_a5": "present",
      "mdd_a6": "present",
      "mdd_a7": "present",
      "mdd_a8": "present",
      "mdd_a9": "present",
      "mdd_exc_substance": "cleared",
      "mdd_exc_medical": "cleared",
      "mdd_exc_psychotic": "cleared",
      "mdd_exc_bipolar": "cleared",
      "mdd_subj_clinical_significance": "met",
      "duration_days": 194,
      "gad_a": "present",
      "gad_b": "present",
      "gad_c1": "present",
      "gad_c2": "present",
      "gad_c3": "present",
      "gad_c4": "present",
      "gad_c5": "present",
      "gad_c6": "present",
      "gad_exc_substance": "cleared",
      "gad_exc_medical": "cleared",
      "gad_exc_panic": "cleared",
      "gad_exc_social_anxiety": "cleared",
      "gad_exc_ocd": "cleared",
      "gad_exc_separation": "cleared",
      "gad_exc_ptsd": "cleared",
      "gad_exc_anorexia": "cleared",
      "gad_exc_somatic": "cleared",
      "gad_exc_bdd": "cleared",
      "gad_exc_illness_anxiety": "cleared",
      "gad_exc_psychotic": "cleared",
      "gad_subj_clinical_significance": "met",
      "gad_subj_excessive": "met"
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 430
    }
  },
  {
    "id": "vig_022_adhd_clear_fee6e789",
    "ground_truth": [
      "adhd"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n29-year-old graphic designer presents with \"I can't focus and I'm constantly losing things.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports a lifelong pattern of inattentive and hyperactive behaviors first noticed around age 10; symptoms have been particularly impairing for approximately 6 months with increased work errors and missed deadlines. \"I will start a project and three things pull me away — then I forget where I left the files.\" \"At meetings my mind goes elsewhere and I miss the instructions.\" Patient gives concrete examples: recent client layout had multiple alignment errors because she overlooked measurements; misplaced a USB drive containing deliverables and missed a submission deadline two weeks ago. Describes difficulty sustaining attention during long briefs and reading design specs, often rereading pages without comprehension. Reports frequently not listening when colleagues speak, stating \"people tell me I look like I'm somewhere else even when they are right in front of me.\" Notes avoidance of long paperwork and tax forms, and that filing and workspace are messy with scattered sketches and unpaid bills. Over past 6 months reports increased restlessness—tapping feet, fidgeting with pens, leaving desk to walk around when expected to sit. Colleagues describe her as talkative, interrupting meetings and blurting answers before questions are finished.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history; no prior formal treatment or medications.\n\n4. FAMILY HISTORY\nMother alive, supportive; father had persistent heavy alcohol use during patient's childhood.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nMedical history noncontributory. Alcohol: 1–2 drinks weekly. Recreational drugs: denies current or past use. Caffeine: 2–3 cups coffee daily.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, slightly disheveled workspace items visible at bedside. Behaviour: restless, taps foot and fingers frequently, rose from chair once during interview. Speech: rapid at times, verbose, interrupts interviewer; occasionally completes sentences for others. Mood: \"frustrated and embarrassed about mistakes.\" Affect: reactive, mildly anxious. Thought process: tangential at times, frequently shifts topics, tendencies to blurt responses. Thought content: Denies suicidal or homicidal ideation; Denies delusional beliefs. Perceptions: Denies auditory or visual hallucinations. Insight: limited—acknowledges problems but attributes most difficulties to external chaos rather than internal patterns.",
    "answers": {
      "adhd_a1a": "present",
      "adhd_a1b": "present",
      "adhd_a1c": "present",
      "adhd_a1d": "present",
      "adhd_a1e": "present",
      "adhd_a1f": "present",
      "adhd_a1g": "present",
      "adhd_a1h": "present",
      "adhd_a1i": "present",
      "adhd_a2a": "present",
      "adhd_a2b": "present",
      "adhd_a2c": "present",
      "adhd_a2d": "present",
      "adhd_a2e": "present",
      "adhd_a2f": "present",
      "adhd_a2g": "present",
      "adhd_a2h": "present",
      "adhd_a2i": "present",
      "adhd_exc_psychotic": "cleared",
      "adhd_exc_mood": "cleared",
      "adhd_exc_anxiety": "cleared",
      "adhd_exc_dissociative": "cleared",
      "adhd_exc_personality": "cleared",
      "adhd_exc_substance": "cleared",
      "adhd_subj_functional_impairment": "met",
      "adhd_subj_developmental": "met",
      "adhd_subj_not_oppositional": "met",
      "duration_days": 187,
      "onset_age": 10
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 355
    }
  },
  {
    "id": "vig_023_ptsd_moderate_2a07d37d",
    "ground_truth": [
      "ptsd"
    ],
    "difficulty": "MODERATE",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n32-year-old retail manager presents with \"I'm kind of not handling what happened — I'm on edge, I keep trying not to think about it.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports directly experiencing a violent home invasion approximately 1 month ago; symptoms began in early December 2025. States, \"I was there when it happened — it felt like my whole life flipped,\" and, \"I sometimes can't even tell you exactly how I got out of the house.\" Patient describes intense psychological distress when encountering reminders: seeing a similar car make causes them to feel overwhelmed and to leave the area. They report avoiding the neighborhood, avoiding friends who know details, and declining social invitations: \"I just don't go back to that part of town, I kind of avoid talking about it.\" Patient reports a gap in memory for a 20–30 minute period during the event and cannot recall how a specific injury occurred. Describes persistent negative beliefs about self and others, e.g., \"I'm weak\" and \"people aren't safe.\" Reports increased irritability with frequent verbal outbursts at coworkers and one episode of punching a wall; acknowledges recent speeding and driving late at night \"to clear my head\" and occasional heavy drinking \"a few nights a week.\" Duration: Symptoms present for approximately 1 month; began immediately after the event.\n\nPertinent negatives: Denies witnessing, in person, the event as it occurred to others. Denies learning the event occurred to a close family member or close friend. Denies repeated or extreme exposure to aversive details through work. Denies recurrent, involuntary, and intrusive distressing memories. Denies recurrent distressing dreams related to the event. Denies dissociative reactions in which the event feels recurring. Denies marked physiological reactions to cues. Denies avoidance of distressing memories, thoughts, or feelings about or closely associated with the event.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\n4. FAMILY HISTORY\nMother with history of mood difficulties; no known hospitalizations in family.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nNo chronic medical conditions reported. Substance use: alcohol several times per week with occasional heavy episodes, denies recreational drug use, caffeine 2–3 cups/day. Labs: TSH normal, metabolic panel unremarkable, toxicology negative. Medications: ibuprofen as needed; no prescription psychotropic medications.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, mildly disheveled. Behaviour: cooperative but restless, frequently shifts in chair. Mood: \"on edge\" and irritable. Affect: constricted, reactive to topic. Thought content: preoccupied with event, persistent negative beliefs about self/others; denies suicidal ideation or plan; protective factors include employment and contact with supportive sibling. Cognition: oriented x3, attention intact; reports patchy memory for event. Insight: limited awareness of connection between behavior and stress. No psychotic symptoms observed.",
    "answers": {
      "ptsd_a1": "present",
      "ptsd_a2": "absent",
      "ptsd_a3": "absent",
      "ptsd_a4": "absent",
      "ptsd_b1": "absent",
      "ptsd_b2": "absent",
      "ptsd_b3": "absent",
      "ptsd_b4": "present",
      "ptsd_b5": "absent",
      "ptsd_c1": "absent",
      "ptsd_c2": "present",
      "ptsd_d1": "present",
      "ptsd_d2": "present",
      "ptsd_d3": "absent",
      "ptsd_d4": "absent",
      "ptsd_d5": "absent",
      "ptsd_d6": "absent",
      "ptsd_d7": "absent",
      "ptsd_e1": "present",
      "ptsd_e2": "present",
      "ptsd_e3": "absent",
      "ptsd_e4": "absent",
      "ptsd_e5": "absent",
      "ptsd_e6": "absent",
      "ptsd_exc_substance": "cleared",
      "ptsd_exc_medical": "cleared",
      "ptsd_exc_dissociative_substance": "cleared",
      "ptsd_exc_dissociative_medical": "cleared",
      "ptsd_subj_distress": "met",
      "ptsd_subj_trauma_quality": "met",
      "ptsd_subj_violent_accidental": "met",
      "duration_days": 37
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 443
    }
  },
  {
    "id": "vig_024_asd_clear_1ba247f5",
    "ground_truth": [
      "asd"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n22-year-old graduate student presents with \"I can't keep conversations going and people think I'm rude.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports a gradual pattern of social difficulty that has intensified recently. \"I often don't answer when someone talks to me because I don't know what to say,\" and \"If my bus route changes, I get completely panicked.\" Symptoms present for approximately 3 week(s). They began approximately three weeks ago with a marked increase in avoidance of group activities after returning to campus. Patient states these behaviors were first noticed by family and teachers around age 16 and have been present in various degrees since then. Describes frequent one-sided exchanges: allowing others to speak but failing to contribute follow-up questions or share feelings. Reports difficulty interpreting gestures and facial cues—\"I stare at the floor because I don't know where to look\"—and limited spontaneous sharing of interests. Gives concrete examples: does not respond to classmates' invitations, did not wave back to a neighbor last week, and did not express sympathy when a friend injured themselves. Reports repetitive behaviors: aligns pencils in identical order before study sessions, repeats phrases heard on podcasts (silent echolalia), and sometimes rocks his upper body when anxious. Describes strict routines: must eat the same sandwich daily and travel the same route to campus; small changes trigger distress and prolonged reorganizing. Reports an intense, narrow interest in train schedules, spending hours researching timetables. Notes heightened sensitivity to certain sounds (coffee grinder causes covering of ears) and visual fixation on fluorescent lights. Denies suicidal ideation, homicidal ideation, hallucinations, and delusional beliefs. Denies recent illicit substance use.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\n4. FAMILY HISTORY\nMother has a history of mood difficulties; no detailed psychiatric diagnoses reported in family.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nNo chronic medical conditions reported. Not taking regular medications. Occasional alcohol use, no tobacco, denies recreational drug use.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: neatly dressed, hair groomed. Behaviour: minimal spontaneous social reciprocity, repetitive hand tapping observed. Speech: soft, literal, occasionally delayed responses. Mood (subjective): \"a bit stressed and frustrated.\" Affect (observed): restricted range, limited facial expressivity. Thought process: linear but concrete, perseverative on routine details. Cognition: oriented x3, attention mildly variable during interview. Insight: limited recognition of social impact of behaviors; acknowledges problems but minimizes emotional significance.",
    "answers": {
      "asd_a1": "present",
      "asd_a2": "present",
      "asd_a3": "present",
      "asd_b1": "present",
      "asd_b2": "present",
      "asd_b3": "present",
      "asd_b4": "present",
      "asd_exc_intellectual_disability": "cleared",
      "asd_subj_impairment": "met",
      "asd_subj_early_onset": "met",
      "asd_subj_severity_social": "met",
      "asd_subj_severity_rrb": "met",
      "duration_days": 21,
      "onset_age": 16
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 389
    }
  },
  {
    "id": "vig_025_mdd_moderate_86437d5b",
    "ground_truth": [
      "mdd"
    ],
    "difficulty": "MODERATE",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n34-year-old accountant presents with \"I just feel kind of empty and sad most days, like I can't shake it.\"\n\n2. HISTORY OF PRESENT ILLNESS\nSymptoms began approximately 3 weeks ago after a busy quarter-end at work. Patient reports, \"I wake up and it feels heavy, like I'm already tired,\" and \"sometimes I cry for no reason.\" Partner notes patient has been tearful at home and slower in movements. Patient describes decreased appetite nearly every day with an unintended weight loss of about 6% over the past month. Reports feeling \"kind of useless\" and \"responsible for things that go wrong at work,\" stating this occurs nearly every day. Observed psychomotor slowing noted by coworker (walks slowly, delayed responding) and occasional pacing at home noted by partner; patient acknowledges being noticeably slower or fidgety on different days. Endorses fatigue or loss of energy nearly every day, describing difficulty initiating routine tasks. Symptoms have been present continuously for roughly 3 weeks.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\n4. FAMILY HISTORY\nMother had episodes of low mood and received unspecified outpatient treatment.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nNo significant medical problems reported. Substance use: drinks alcohol socially (1–2 drinks on weekends), denies regular recreational drug use, caffeine intake ~2 cups coffee daily. TSH normal. Metabolic panel unremarkable. Toxicology negative. Medications: no current prescription medications; OTC: multivitamin, ibuprofen PRN.\n\n6. PERTINENT NEGATIVES\nDenies markedly diminished interest or pleasure in almost all activities most of the day, nearly every day. Denies insomnia or hypersomnia nearly every day. Denies diminished ability to think or concentrate, or indecisiveness nearly every day. Denies recurrent thoughts of death, suicidal ideation, plans, or attempts.\n\n7. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, slightly disheveled. Behaviour: cooperative, psychomotor slowing observed. Speech: soft, slowed rate. Mood: reports feeling \"sad, empty, hopeless.\" Affect: constricted, tearful at times. Thought process: linear but slowed. Thought content: no delusional content elicited; expresses excessive self-blame. Perceptions: no hallucinations reported. Insight: limited; acknowledges symptoms but attributes them to personal failure.",
    "answers": {
      "mdd_a1": "present",
      "mdd_a2": "absent",
      "mdd_a3": "present",
      "mdd_a4": "absent",
      "mdd_a5": "present",
      "mdd_a6": "present",
      "mdd_a7": "present",
      "mdd_a8": "absent",
      "mdd_a9": "absent",
      "mdd_exc_substance": "cleared",
      "mdd_exc_medical": "cleared",
      "mdd_exc_psychotic": "cleared",
      "mdd_exc_bipolar": "cleared",
      "mdd_subj_clinical_significance": "met",
      "duration_days": 21
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 337
    }
  },
  {
    "id": "vig_026_gad_clear_76960f8d",
    "ground_truth": [
      "gad"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n28-year-old elementary school teacher presents with \"I'm constantly worrying and it's ruining my sleep.\"\n\n2. HISTORY OF PRESENT ILLNESS\nSymptoms present for approximately 6 month(s); began around July 2025 with gradual worsening over several weeks. Patient reports pervasive, excessive worry about work performance, student evaluations, and \"everything that could go wrong\" at home. States, \"My heart races at staff meetings and I can't stop picturing every possible mistake\" and \"I lie awake until 3 a.m., then wake at 5 and can't get back to sleep.\" Describes inability to control the worry despite trying distraction and problem lists. Endorses restlessness—pacing around the house, feeling \"keyed up,\" and frequent muscle tightness in neck and shoulders. Reports being easily fatigued, falling asleep briefly at desk after lunch, and needing naps on days off. Notes difficulty concentrating with episodes where her \"mind just goes blank\" during classroom presentations, leading to missed points and hesitancy to volunteer. Reports increased irritability: \"I snap at my partner over small things\" and reports tension in interpersonal interactions. Sleep described as restless and nonrestorative with frequent nighttime awakenings. Denies suicidal ideation, homicidal ideation, auditory or visual hallucinations, and recent loss of consciousness.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history; no prior psychiatric medications or hospitalizations.\n\n4. FAMILY HISTORY\nMother reportedly experienced long-standing excessive worry and engaged in outpatient counseling; no known hospitalizations in family.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nMedical history noncontributory. Substance use: alcohol 2–3 drinks on weekends, denies recreational drug use, consumes 2–3 cups of coffee daily. TSH normal. Metabolic panel unremarkable. Toxicology negative. Medications: none prescribed; OTC multivitamin and occasional ibuprofen.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, appears fatigued. Behavior: fidgety, shifts position frequently. Speech: clear, slightly rapid but coherent. Mood (subjective): \"anxious and tired.\" Affect (observed): tense, constricted range. Thought process: linear and goal-directed but preoccupied with worries about work and performance. Thought content: preoccupation with future events and performance concerns; denies suicidal or homicidal ideation, hallucinations, or paranoid ideation. Cognition: oriented to person, place, time; attention and concentration reduced as evidenced by difficulty performing serial tasks and reported blanking during tasks. Insight: recognizes symptoms are problematic and seeks help to manage them.",
    "answers": {
      "gad_a": "present",
      "gad_b": "present",
      "gad_c1": "present",
      "gad_c2": "present",
      "gad_c3": "present",
      "gad_c4": "present",
      "gad_c5": "present",
      "gad_c6": "present",
      "gad_exc_substance": "cleared",
      "gad_exc_medical": "cleared",
      "gad_exc_panic": "cleared",
      "gad_exc_social_anxiety": "cleared",
      "gad_exc_ocd": "cleared",
      "gad_exc_separation": "cleared",
      "gad_exc_ptsd": "cleared",
      "gad_exc_anorexia": "cleared",
      "gad_exc_somatic": "cleared",
      "gad_exc_bdd": "cleared",
      "gad_exc_illness_anxiety": "cleared",
      "gad_exc_psychotic": "cleared",
      "gad_subj_clinical_significance": "met",
      "gad_subj_excessive": "met",
      "duration_days": 187
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 365
    }
  },
  {
    "id": "vig_027_adhd_ambiguous_5ae11509",
    "ground_truth": [
      "adhd"
    ],
    "difficulty": "AMBIGUOUS",
    "meets_criteria": false,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n\"22-year-old university student (part-time barista) presents with \"I can't focus like I used to, but it's not that bad.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports difficulties with attention and activity level for approximately 5 months, beginning around late July 2025; patient states similar problems first appeared around age 17. Describes frequent overlooking of details in coursework and at work: \"I hand in essays with small mistakes and my boss points out errors in orders,\" and reports work being labelled \"inaccurate\" by supervisors. Endorses trouble sustaining attention during lectures and reading: \"I zone out halfway through pages and have to re-read.\" Reports appearing not to listen when spoken to directly; says mind is often \"elsewhere even when no one is distracting me.\" Describes difficulty organizing tasks and managing time: messy notes, late for deadlines, difficulty keeping sequential tasks on track. Avoids tasks requiring sustained mental effort (long reports, forms). Reports motor restlessness in settings requiring stillness (unable to sit through long seminars; paces during study breaks) and feels \"on the go\" most days. Notes excessive talking, blurting answers before questions are finished, and interrupting peers: \"I answer before people finish and then feel bad about it.\" Patient minimizes severity: \"It's annoying but I get most things done.\" Denies failing to follow through on instructions or frequently not finishing tasks. Denies often losing necessary items. Denies being easily distracted by external stimuli. Denies being forgetful in daily activities.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history; no prior medications or therapy reported.\n\n4. FAMILY HISTORY\nMother has history of mood difficulties; no hospitalizations reported in family.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nNo chronic medical conditions reported. Alcohol: social drinking approximately 1–2 times/week. Recreational drugs: denies current use. Caffeine: 2–3 cups coffee daily.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, slightly dishevelled. Behaviour: restless, frequently shifts position, interrupts examiner. Speech: rapid, verbose at times. Mood: \"fine\"; Affect: mildly animated, congruent. Thought process: tangential at times, frequently completes examiner's sentences/blurts responses. Thought content: denies fixed false beliefs. Perceptions: denies hallucinations. Insight: limited; patient downplays impact of symptoms.",
    "answers": {
      "adhd_a1a": "present",
      "adhd_a1b": "present",
      "adhd_a1c": "present",
      "adhd_a1d": "absent",
      "adhd_a1e": "present",
      "adhd_a1f": "present",
      "adhd_a1g": "absent",
      "adhd_a1h": "absent",
      "adhd_a1i": "absent",
      "adhd_a2a": "absent",
      "adhd_a2b": "present",
      "adhd_a2c": "present",
      "adhd_a2d": "absent",
      "adhd_a2e": "present",
      "adhd_a2f": "present",
      "adhd_a2g": "present",
      "adhd_a2h": "absent",
      "adhd_a2i": "present",
      "adhd_exc_psychotic": "cleared",
      "adhd_exc_mood": "cleared",
      "adhd_exc_anxiety": "cleared",
      "adhd_exc_dissociative": "cleared",
      "adhd_exc_personality": "cleared",
      "adhd_exc_substance": "cleared",
      "adhd_subj_functional_impairment": "not_met",
      "adhd_subj_developmental": "met",
      "adhd_subj_not_oppositional": "met",
      "duration_days": 177,
      "onset_age": 17
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 349
    }
  },
  {
    "id": "vig_028_ptsd_moderate_2826a7f0",
    "ground_truth": [
      "ptsd"
    ],
    "difficulty": "MODERATE",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n32-year-old elementary school teacher presents with \"I keep seeing his face and I can't stop thinking about it, it's kind of taking over.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports that symptoms began approximately 1 month ago after learning that a close friend died in a single-car accident. States, \"I got the call and then it's like the call keeps replaying in my head,\" and \"sometimes I'll be fine and then a picture will just pop into my mind and I'm right back there.\" Describes recurrent, involuntary, distressing memories of details from the phone call and images of the friend's last photo. Notes active efforts to avoid external reminders: avoids driving on the stretch of road near where the accident occurred, stopped going to the coffee shop they frequented together, and declines invitations to gatherings where mutual friends will be present. Reports a shift toward negative beliefs: \"I kind of feel like people aren't safe\" and \"I keep thinking I should have done more.\" States markedly diminished interest in activities she once enjoyed (no longer attends weekend soccer league and rarely meets friends). Describes increased irritability with frequent verbal outbursts at home (\"I've been snapping at my partner, sometimes yelling, sometimes slamming doors\") and occasional throwing of an object when anger escalates. Notes problems with concentration at work—missing an email yesterday and difficulty grading papers. Symptoms present for approximately 1 month.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\n4. FAMILY HISTORY\nMother had prior mental health treatment; no other known psychiatric history in immediate family.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nNo significant medical history reported. Alcohol: 1–2 drinks on weekends. Recreational drugs: denies current use. Caffeine: two cups of coffee daily. TSH normal. Metabolic panel unremarkable. Toxicology negative. Medications: occasional ibuprofen as needed.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, hygiene adequate. Behaviour: cooperative but restless, pacing during interview. Mood: \"upset, kind of on edge.\" Affect: constricted, reactive. Thought content: preoccupation with memories of the event; denies suicidal ideation, no plan or intent; protective factors include partner support and job. Perception: denies hallucinations. Cognition: oriented to person/place/time; attention and concentration decreased (difficulty with serial tasks and organizing work). Insight: limited recognition of how symptoms are affecting functioning. Pertinent negatives: Denies directly experiencing the traumatic event(s). Denies witnessing, in person, the event(s) as it occurred to others. Denies experiencing repeated or extreme exposure to aversive details of the traumatic event(s) (e.g., first responders; not through media unless work-related). Denies recurrent distressing dreams related to the event(s). Denies dissociative reactions (e.g., flashbacks). Denies intense or prolonged psychological distress at exposure to cues that symbolize the event(s). Denies marked physiological reactions to cues that symbolize the event(s). Denies avoidance of or efforts to avoid distressing memories, thoughts, or feelings about or closely associated with the traumatic event(s).",
    "answers": {
      "ptsd_a1": "absent",
      "ptsd_a2": "absent",
      "ptsd_a3": "present",
      "ptsd_a4": "absent",
      "ptsd_b1": "present",
      "ptsd_b2": "absent",
      "ptsd_b3": "absent",
      "ptsd_b4": "absent",
      "ptsd_b5": "absent",
      "ptsd_c1": "absent",
      "ptsd_c2": "present",
      "ptsd_d1": "absent",
      "ptsd_d2": "present",
      "ptsd_d3": "absent",
      "ptsd_d4": "absent",
      "ptsd_d5": "present",
      "ptsd_d6": "absent",
      "ptsd_d7": "absent",
      "ptsd_e1": "present",
      "ptsd_e2": "absent",
      "ptsd_e3": "absent",
      "ptsd_e4": "absent",
      "ptsd_e5": "present",
      "ptsd_e6": "absent",
      "ptsd_exc_substance": "cleared",
      "ptsd_exc_medical": "cleared",
      "ptsd_exc_dissociative_substance": "cleared",
      "ptsd_exc_dissociative_medical": "cleared",
      "ptsd_subj_distress": "met",
      "ptsd_subj_trauma_quality": "met",
      "ptsd_subj_violent_accidental": "met",
      "duration_days": 37
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 470
    }
  },
  {
    "id": "vig_029_asd_clear_44959497",
    "ground_truth": [
      "asd"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n\"18-year-old college student presents with 'I can't seem to talk to people the way I used to'\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports a clear change over the past three weeks with increasing withdrawal and unusual communication patterns. \"I mostly nod and say a few words, then I just stop,\" he stated. He reports poor back-and-forth in conversation: when classmates ask open questions he gives brief, concrete replies and often does not return questions. He describes avoiding greeting peers and teachers, sometimes failing to respond when addressed. \"If someone changes the plan I get really upset — I can't do it,\" he said, describing extreme distress when a morning bus route was altered last week and leaving campus early. Reports repetitive behaviors: lines up pens in precise order each morning and repeats short phrases heard on television. Reports a narrow preoccupation with train schedules, checking them multiple times per day and becoming enraged if prevented from doing so. Describes minimal facial expression and infrequent gestures; avoids eye contact and often stares at ceiling fans. Reports aversion to certain sounds (loud cafeteria announcements) and covers ears; reports fascination with flashing lights in a nearby building.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\n4. FAMILY HISTORY\nMaternal uncle received long-term outpatient psychiatric treatment.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nNo chronic medical conditions. Not taking any medications. Occasional caffeine use. Denies recreational drug use.\n\nPERTINENT NEGATIVES\nDenies suicidal ideation, self-harm, auditory or visual hallucinations, and recent mood swings reported by patient.\n\nDURATION\nSymptoms present for approximately 3 week(s); patient reports escalation began about three weeks ago.\n\nONSET\nSymptoms first appeared around age 16.\n\nFUNCTIONAL IMPACT\nWork/academic: Attendance affected by leaving campus early; difficulty participating in group projects and class discussions. Relationships: Few peer interactions, reports no close friendships and routinely does not respond to social approaches. Daily activities: Rigid morning routines (lining pens, checking schedules), marked distress with small changes, interference with meal choices and commuting.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: Neat, casual dress. Behaviour: Repetitive hand movements during interview, limited reciprocal gestures. Speech: Soft, monotone, concrete answers. Mood (subjective): \"Frustrated and tired.\" Affect (observed): Restricted, flat facial expression. Thought process: Linear but narrowly focused on routines and schedules. Cognition: Alert, oriented x3; attention variable with brief distractibility. Insight: Limited recognition of social impact of behaviors.",
    "answers": {
      "asd_a1": "present",
      "asd_a2": "present",
      "asd_a3": "present",
      "asd_b1": "present",
      "asd_b2": "present",
      "asd_b3": "present",
      "asd_b4": "present",
      "asd_exc_intellectual_disability": "cleared",
      "asd_subj_impairment": "met",
      "asd_subj_early_onset": "met",
      "asd_subj_severity_social": "met",
      "asd_subj_severity_rrb": "met",
      "duration_days": 21,
      "onset_age": 16
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 390
    }
  },
  {
    "id": "vig_030_mdd_ambiguous_67aa769e",
    "ground_truth": [
      "mdd"
    ],
    "difficulty": "AMBIGUOUS",
    "meets_criteria": false,
    "clinical_text": "DEMOGRAPHICS AND CHIEF COMPLAINT\n28-year-old software engineer presents with \"I don't really care about anything lately\" and \"I've been having thoughts about not waking up.\"\n\nHISTORY OF PRESENT ILLNESS\nPatient reports a 1-week history of markedly reduced interest in almost all activities. \"I stopped playing guitar, I haven't opened my art supplies in days,\" and \"I don't feel like going out with friends, even when they call.\" Notes spending most of the day scrolling on phone or lying in bed, rarely initiating previously enjoyed tasks. Sleep disrupted with difficulty falling asleep and early morning awakening nearly every night since symptoms began approximately 1 week ago after a critical argument with partner and a stressful project deadline. \"I get up at 3–4 a.m. and can't get back to sleep.\" Expresses pervasive feelings of worthlessness: \"I feel like I'm useless and I deserve this,\" and reports excessive guilt about perceived failures at work and in relationship. Describes recurrent thoughts of death over the past week—frequent passive ideas of not waking up and recurrent suicidal thoughts without a specific plan or intent; states \"I think about dying sometimes, but I haven't planned anything.\" Patient minimizes severity throughout, saying \"It's probably not that bad\" and \"I can handle it.\"\n\nPAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\nFAMILY HISTORY\nMother alive, no known psychiatric hospitalization; father with history of mood problems per patient.\n\nMEDICAL HISTORY AND SUBSTANCES\nNo chronic medical conditions reported. Alcohol: 1–2 drinks weekly. Recreational drugs: denies current use. Caffeine: two cups of coffee daily. TSH normal. Metabolic panel unremarkable. Toxicology negative. Medications: none prescribed; OTC melatonin PRN for sleep, occasional ibuprofen.\n\nMENTAL STATUS EXAMINATION\nAppearance: casually dressed, mildly unkempt. Behaviour: cooperative, sits appropriately. Speech: normal rate and volume. Mood (subjective): \"okay\" / minimizing. Affect: constricted, congruent with stated mood. Thought process: linear and goal-directed. Thought content: pervasive selfblame and worthlessness; recurrent passive death thoughts and suicidal ideation without plan; no fixed false beliefs identified. Perceptions: no hallucinations reported. Insight: limited; patient downplays severity and expresses uncertainty about need for help.",
    "answers": {
      "mdd_a1": "absent",
      "mdd_a2": "present",
      "mdd_a3": "absent",
      "mdd_a4": "present",
      "mdd_a5": "absent",
      "mdd_a6": "absent",
      "mdd_a7": "present",
      "mdd_a8": "absent",
      "mdd_a9": "present",
      "mdd_exc_substance": "cleared",
      "mdd_exc_medical": "cleared",
      "mdd_exc_psychotic": "cleared",
      "mdd_exc_bipolar": "cleared",
      "mdd_subj_clinical_significance": "not_met",
      "duration_days": 11
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 338
    }
  },
  {
    "id": "vig_031_gad_moderate_0c06b9b2",
    "ground_truth": [
      "gad"
    ],
    "difficulty": "MODERATE",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n35-year-old software engineer presents with \"I'm kind of worrying all the time and it's getting in the way of work.\"\n\n2. HISTORY OF PRESENT ILLNESS\nSymptoms began approximately 6 months ago (July 2025), after taking on a new project lead role. Patient reports \"I worry about everything, like meetings, code reviews, and whether I'm performing well,\" and says this occurs most days. Patient states the worry is difficult to stop: \"I try to tell myself it's fine, but I can't switch it off.\" Describes frequent apprehensive expectation about multiple areas of life (work performance, deadlines, future planning). Reports difficulty concentrating at work and that the \"mind sometimes goes blank during presentations,\" leading to avoidance of public speaking and longer time to complete tasks. Denies restlessness or feeling keyed up or on edge. Denies being easily fatigued. Denies irritability. Denies muscle tension.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\n4. FAMILY HISTORY\nMother had periods of low mood and received counseling in her 40s; no known history of inpatient care in immediate family.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nNo chronic medical conditions reported. Alcohol: 1–2 drinks on weekends. Recreational drugs: denies use. Caffeine: 2–3 cups coffee daily. Labs: TSH normal; metabolic panel unremarkable; toxicology negative. Medications: no current prescription medications; takes OTC ibuprofen as needed and a daily multivitamin.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, well-groomed. Behavior: cooperative, engaged but occasionally fidgets with pen. Speech: normal rate and volume. Mood (subjective): \"worried\" and \"kind of tense sometimes.\" Affect (observed): mildly constricted, appropriate to content. Thought process: linear and goal-directed though repeatedly returns to themes of worry about work and future. Thought content: preoccupied with performance concerns; denies suicidal or homicidal ideation. Cognition: alert and oriented x3; attention and concentration impaired on bedside testing with frequent lapses and reports that mind goes blank during stress; recent and remote memory intact. Insight: fair; recognizes that worry is excessive and wants help to manage it.",
    "answers": {
      "gad_a": "present",
      "gad_b": "present",
      "gad_c1": "absent",
      "gad_c2": "absent",
      "gad_c3": "present",
      "gad_c4": "absent",
      "gad_c5": "absent",
      "gad_c6": "absent",
      "gad_exc_substance": "cleared",
      "gad_exc_medical": "cleared",
      "gad_exc_panic": "cleared",
      "gad_exc_social_anxiety": "cleared",
      "gad_exc_ocd": "cleared",
      "gad_exc_separation": "cleared",
      "gad_exc_ptsd": "cleared",
      "gad_exc_anorexia": "cleared",
      "gad_exc_somatic": "cleared",
      "gad_exc_bdd": "cleared",
      "gad_exc_illness_anxiety": "cleared",
      "gad_exc_psychotic": "cleared",
      "gad_subj_clinical_significance": "met",
      "gad_subj_excessive": "met",
      "duration_days": 187
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 328
    }
  },
  {
    "id": "vig_032_adhd_clear_448b5aa9",
    "ground_truth": [
      "adhd"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n28-year-old marketing coordinator presents with \"I can't focus, I forget everything, and I'm making mistakes at work.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports a roughly 6-month worsening of concentration and activity regulation, with symptoms present for approximately 6 month(s), beginning around July 2025. States symptoms first appeared around age 10. Reports: \"I start reports and never finish them — I'll do the intro then get sidetracked and never go back,\" and \"I lose my keys and phone almost every day; I spend 20 minutes looking for them.\" Describes frequent careless errors: missed numbers on spreadsheets, overlooked attachments in emails, and incomplete edits returned by supervisors. Notes difficulty sustaining attention in meetings and while reading long documents: \"I zone out in lectures and half the time don't remember what was discussed.\" Describes not seeming to listen: \"My partner will tell me something and I realize I wasn't hearing them at all.\" Describes starting tasks and rapidly shifting focus: begins household chores then abandons them to check social media. Reports chronic disorganization and poor time management: messy desk, missed deadlines, late arrivals to appointments. Avoids tasks requiring prolonged mental effort (annual reports, tax forms). Frequently loses items (wallet, glasses, phone). Easily distracted by noises and internal thoughts. Reports motor restlessness: taps hands and feet, gets up from chair in meetings, feels \"on the go\" and uncomfortable sitting through dinners. Describes talking excessively, interrupting others, and blurting answers: \"I finish people's sentences and then later realize I interrupted.\" Timeline: symptoms present continuously for past 6 months, with lifelong patterns since age 10 but intensified recently.\n\nPERTINENT NEGATIVES\nDenies suicidal ideation. Denies homicidal ideation. Denies hearing voices or seeing things. Denies fixed false beliefs.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history. No prior psychiatric medications.\n\n4. FAMILY HISTORY\nMother reports she \"always struggled to sit still as a kid\"; no formal family psychiatric treatment reported.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nNo significant medical history. Alcohol: 1–2 drinks weekly. Recreational drugs: denies use. Caffeine: 2–3 cups coffee daily.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, slightly disheveled. Behaviour: restless, frequent shifting in chair, taps foot. Speech: rapid at times, voluble, interrupts examiner. Mood: reports \"frustrated and embarrassed.\" Affect: broad, reactive. Thought process: tangential at times with frequent topic shifts. Thought content: Denies delusions. Perceptions: Denies hallucinations. Insight: acknowledges problems but attributes some to laziness; insight limited.",
    "answers": {
      "adhd_a1a": "present",
      "adhd_a1b": "present",
      "adhd_a1c": "present",
      "adhd_a1d": "present",
      "adhd_a1e": "present",
      "adhd_a1f": "present",
      "adhd_a1g": "present",
      "adhd_a1h": "present",
      "adhd_a1i": "present",
      "adhd_a2a": "present",
      "adhd_a2b": "present",
      "adhd_a2c": "present",
      "adhd_a2d": "present",
      "adhd_a2e": "present",
      "adhd_a2f": "present",
      "adhd_a2g": "present",
      "adhd_a2h": "present",
      "adhd_a2i": "present",
      "adhd_exc_psychotic": "cleared",
      "adhd_exc_mood": "cleared",
      "adhd_exc_anxiety": "cleared",
      "adhd_exc_dissociative": "cleared",
      "adhd_exc_personality": "cleared",
      "adhd_exc_substance": "cleared",
      "adhd_subj_functional_impairment": "met",
      "adhd_subj_developmental": "met",
      "adhd_subj_not_oppositional": "met",
      "duration_days": 187,
      "onset_age": 10
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 398
    }
  },
  {
    "id": "vig_033_mdd_gad_comorbid_10591358",
    "ground_truth": [
      "mdd",
      "gad"
    ],
    "difficulty": "COMORBID",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n34-year-old graphic designer presents with \"I feel empty and can't focus on anything\" and \"I keep thinking about not wanting to wake up.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports progressive low mood and pervasive worry for approximately 6 months, beginning after a job relocation in July 2025. States \"most days I feel sad and hopeless\" and \"I can't get out of bed some mornings.\" Reports marked loss of interest in formerly enjoyed activities (stopped attending weekend art groups, no longer goes running). Describes 8 lb weight loss over the past month without dieting and decreased appetite \"I barely want to eat.\" Reports sleeping 3–4 hours/night with early morning awakening and feels unrefreshed. Partner reports patient appears slowed in movements and speech over past several months; clinician observed psychomotor retardation during interview. Endorses near-daily fatigue, feelings of worthlessness (\"I am a burden\"), frequent difficulty concentrating at work and indecisiveness. Reports recurrent thoughts of death and passive suicidal ideation without a specific plan; denies recent attempt. Also reports excessive worry occurring most days for the past 6 months about work performance and finances, difficult to control: \"I'm always worried something will go wrong.\" Describes restlessness, easy fatigability, irritability, muscle tension, and racing blank moments at work.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\n4. FAMILY HISTORY\nFather had long-standing low mood and mother received treatment years ago for chronic worry and sleep problems.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nSubstance use: Alcohol 2–3 drinks/week; denies recreational drug use; caffeine ~2 cups coffee/day. TSH normal. Metabolic panel unremarkable. Toxicology negative. Medications: no current prescriptions; takes OTC multivitamin and ibuprofen PRN.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, mildly disheveled. Behavior: cooperative but slowed movements. Speech: soft, slowed rate. Mood: subjectively \"sad, empty.\" Affect: restricted, tearful at times. Thought process: logical but slowed and circumstantial at times. Thought content: passive death ideation; denies plan to harm self at present. Perceptions: denies hallucinations. Insight: limited regarding severity of symptoms.\n\nPERTINENT NEGATIVES (explicitly deny these):\nDenies hallucinations. Denies recent illicit drug use. Denies current plan for suicide. Denies episodes of markedly increased energy or decreased need for sleep.\n\nDURATION:\nSymptoms present for approximately 6 month(s). Began around July 2025.\n\nFUNCTIONAL IMPACT:\nWork: Frequent missed deadlines, decreased productivity, errors from poor concentration, recent leave requested. Relationships: Withdrawal from partner and friends, increased conflict due to irritability. Daily activities: Stopped exercising, decreased self-care, difficulty initiating household tasks.",
    "answers": {
      "mdd_a1": "present",
      "mdd_a2": "present",
      "mdd_a3": "present",
      "mdd_a4": "present",
      "mdd_a5": "present",
      "mdd_a6": "present",
      "mdd_a7": "present",
      "mdd_a8": "present",
      "mdd_a9": "present",
      "mdd_exc_substance": "cleared",
      "mdd_exc_medical": "cleared",
      "mdd_exc_psychotic": "cleared",
      "mdd_exc_bipolar": "cleared",
      "mdd_subj_clinical_significance": "met",
      "duration_days": 194,
      "gad_a": "present",
      "gad_b": "present",
      "gad_c1": "present",
      "gad_c2": "present",
      "gad_c3": "present",
      "gad_c4": "present",
      "gad_c5": "present",
      "gad_c6": "present",
      "gad_exc_substance": "cleared",
      "gad_exc_medical": "cleared",
      "gad_exc_panic": "cleared",
      "gad_exc_social_anxiety": "cleared",
      "gad_exc_ocd": "cleared",
      "gad_exc_separation": "cleared",
      "gad_exc_ptsd": "cleared",
      "gad_exc_anorexia": "cleared",
      "gad_exc_somatic": "cleared",
      "gad_exc_bdd": "cleared",
      "gad_exc_illness_anxiety": "cleared",
      "gad_exc_psychotic": "cleared",
      "gad_subj_clinical_significance": "met",
      "gad_subj_excessive": "met"
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 405
    }
  },
  {
    "id": "vig_034_asd_clear_c9491d99",
    "ground_truth": [
      "asd"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n\"19-year-old college student presents with \"I can't have a normal conversation and I don't fit in.\"\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports a change in social behavior beginning approximately 3 weeks ago, when he withdrew from group study sessions and began leaving class early. He states these behaviors have been present in milder form since age 16. He describes: \"I don't know how to take turns talking — I either talk too long or don't answer,\" and \"People think I'm rude because I stare at my phone instead of looking at them.\" He gives concrete examples: interrupts peers to recite facts about a favored video game, lines up pens on his desk during lectures, and repeats phrases heard in videos (\"echoing short lines\") when anxious. He reports marked distress when daily routines are altered — \"If the bus is late I can't finish my homework that day\" — and will refuse alternate routes. Denies suicidal ideation, denies homicidal ideation, denies auditory or visual hallucinations.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history, no past hospitalizations, no prior medications.\n\n4. FAMILY HISTORY\nNo known family psychiatric history; parents report limited extended family contact.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nNo significant medical history. Current medications: none. Denies alcohol use, denies tobacco use, denies illicit drug use.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, well-groomed. Behaviour: seated rigidly, repetitive finger-tapping observed; occasionally lines up notebook edges. Speech: low volume, monotone, concrete language, occasional echolalic repetition of interviewer phrases. Mood (subjective): \"I feel fine but tired.\" Affect (observed): constricted, limited range, minimal facial expression. Thought process: goal-directed but literal; perseverative on specific topics. Cognition: alert and oriented x3, attention variably engaged, short-term recall intact, difficulty with inference. Insight: limited — recognizes some social difficulties but attributes them to others' expectations rather than own behavior.\n\nFUNCTIONAL IMPACT\nWork/academic performance: missed class participation, late assignments, difficulty in group projects due to interrupting and not responding to peers. Relationships: few close friends, frequent misunderstandings with classmates, strained family interactions around routines. Daily activities: rigid meal and travel routines, significant distress with minor schedule changes, avoidance of crowded dining halls due to sensitivity to noise and textures.",
    "answers": {
      "asd_a1": "present",
      "asd_a2": "present",
      "asd_a3": "present",
      "asd_b1": "present",
      "asd_b2": "present",
      "asd_b3": "present",
      "asd_b4": "present",
      "asd_exc_intellectual_disability": "cleared",
      "asd_subj_impairment": "met",
      "asd_subj_early_onset": "met",
      "asd_subj_severity_social": "met",
      "asd_subj_severity_rrb": "met",
      "duration_days": 21,
      "onset_age": 16
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 365
    }
  },
  {
    "id": "vig_035_mdd_gad_comorbid_cc50c52f",
    "ground_truth": [
      "mdd",
      "gad"
    ],
    "difficulty": "COMORBID",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n32-year-old accountant presents with \"I can't seem to feel anything anymore and I keep thinking about not waking up.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports a gradual onset of symptoms beginning approximately July 2025. \"Most days I wake up empty and hopeless,\" and \"I used to enjoy running and seeing friends but I stopped months ago.\" Over the past six months he reports low mood most of the day nearly every day, markedly decreased interest in nearly all activities, and frequent tearfulness observed by his partner. He describes a 7% unintentional weight loss over one month with reduced appetite and reports sleeping 3–4 hours per night or oversleeping on some days. Patient reports slowed movements and speech noted by coworkers and, at other times, pacing and hand-wringing in the evening. He endorses pervasive fatigue, difficulty concentrating at work, and indecisiveness: \"My mind goes blank in meetings.\" He reports recurrent thoughts of death without a specific plan and passive suicidal ideation. He also reports excessive, uncontrollable worry about job performance and finances for the past 6+ months with muscle tension and restlessness.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history. No prior psychiatric hospitalizations or outpatient therapy reported.\n\n4. FAMILY HISTORY\nFather had long-standing problems with mood and expressive guilt; mother alive, no psychiatric treatment reported.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nMedical history: seasonal allergies. Substance use: drinks alcohol 2–3 beers on weekends, denies regular recreational drug use, consumes 2–3 cups of coffee daily. Labs: TSH normal, metabolic panel unremarkable, toxicology negative. Medications: occasional ibuprofen, OTC melatonin as needed.\n\nPERTINENT NEGATIVES\nDenies prior suicide attempts. Denies current homicidal intent. Denies current use of recreational drugs. Denies recent head injury or seizures. Denies auditory or visual hallucinations.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: appropriately dressed, slightly disheveled. Behavior: reduced eye contact, periods of hand-wringing; slowed gait. Speech: soft, slowed rate. Mood: subjectively \"empty, hopeless.\" Affect: constricted, tearful during interview. Thought process: slowed, goal-directed but with attentional lapses. Thought content: frequent preoccupation with death and pervasive self-reproach; no fixed false beliefs elicited. Perceptions: no hallucinations reported. Insight: partial—recognizes decline but attributes much to work stress.",
    "answers": {
      "mdd_a1": "present",
      "mdd_a2": "present",
      "mdd_a3": "present",
      "mdd_a4": "present",
      "mdd_a5": "present",
      "mdd_a6": "present",
      "mdd_a7": "present",
      "mdd_a8": "present",
      "mdd_a9": "present",
      "mdd_exc_substance": "cleared",
      "mdd_exc_medical": "cleared",
      "mdd_exc_psychotic": "cleared",
      "mdd_exc_bipolar": "cleared",
      "mdd_subj_clinical_significance": "met",
      "duration_days": 194,
      "gad_a": "present",
      "gad_b": "present",
      "gad_c1": "present",
      "gad_c2": "present",
      "gad_c3": "present",
      "gad_c4": "present",
      "gad_c5": "present",
      "gad_c6": "present",
      "gad_exc_substance": "cleared",
      "gad_exc_medical": "cleared",
      "gad_exc_panic": "cleared",
      "gad_exc_social_anxiety": "cleared",
      "gad_exc_ocd": "cleared",
      "gad_exc_separation": "cleared",
      "gad_exc_ptsd": "cleared",
      "gad_exc_anorexia": "cleared",
      "gad_exc_somatic": "cleared",
      "gad_exc_bdd": "cleared",
      "gad_exc_illness_anxiety": "cleared",
      "gad_exc_psychotic": "cleared",
      "gad_subj_clinical_significance": "met",
      "gad_subj_excessive": "met"
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 357
    }
  },
  {
    "id": "vig_036_gad_clear_eb46e453",
    "ground_truth": [
      "gad"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n   \"32-year-old software engineer presents with 'I can't stop worrying; I'm on edge all the time.'\"\n\n2. HISTORY OF PRESENT ILLNESS\n   Patient reports approximately 6 months of nearly daily excessive worry and apprehensive expectation focused primarily on job performance, upcoming meetings, finances and minor social interactions. Began around July 2025 after a reorganization at work. \"I replay every conversation and worry I'll mess up the next presentation.\" \"I feel like my mind goes blank in meetings and then I worry about it for days.\" Patient states the worry is difficult to control and often lasts several hours per day. Reports feeling restless and \"keyed up,\" easily fatigued by mid-afternoon, and having persistent muscle tightness in neck and shoulders. Describes frequent irritability with partner over small issues. Concentration is poor — \"I lose my train of thought and make mistakes in code.\" Sleep is disrupted: difficulty falling asleep, multiple awakenings, and nonrestorative sleep. Functional impact: at work, decreased productivity, missed deadlines, avoids volunteering for presentations; in relationships, increased conflict and withdrawal from social plans; daily activities such as grocery shopping and exercise reduced due to low energy and preoccupation. DURATION: Symptoms present for approximately 6 month(s), began July 2025. PERTINENT NEGATIVES: Denies suicidal ideation. Denies homicidal ideation. Denies hearing voices or seeing things not present. Denies recent recreational drug use.\n\n3. PAST PSYCHIATRIC HISTORY\n   No prior psychiatric history and no previous psychotherapy or psychotropic medication reported.\n\n4. FAMILY HISTORY\n   Mother has history of mood difficulties and sought counseling years ago; father healthy.\n\n5. MEDICAL HISTORY AND SUBSTANCES\n   Medical history notable for seasonal allergic rhinitis. Substance use: alcohol 1–2 drinks 2–3 times weekly; no recreational drugs; caffeine 2 cups coffee daily. Labs: TSH normal, metabolic panel unremarkable, toxicology negative. Medications: no current prescription medications; uses OTC melatonin intermittently for sleep.\n\n6. MENTAL STATUS EXAMINATION\n   Appearance: casually dressed, well-groomed. Behaviour: cooperative, some psychomotor restlessness (fidgeting). Speech: relevant, slightly rapid. Mood (subjective): \"stressed and on edge.\" Affect (observed): tense, reactive. Thought process: coherent and goal-directed. Cognition: alert and oriented x3; concentration impaired during serial 7's with frequent lapses. Insight: acknowledges symptoms interfere with work and relationships and expresses desire for strategies to manage worry.",
    "answers": {
      "gad_a": "present",
      "gad_b": "present",
      "gad_c1": "present",
      "gad_c2": "present",
      "gad_c3": "present",
      "gad_c4": "present",
      "gad_c5": "present",
      "gad_c6": "present",
      "gad_exc_substance": "cleared",
      "gad_exc_medical": "cleared",
      "gad_exc_panic": "cleared",
      "gad_exc_social_anxiety": "cleared",
      "gad_exc_ocd": "cleared",
      "gad_exc_separation": "cleared",
      "gad_exc_ptsd": "cleared",
      "gad_exc_anorexia": "cleared",
      "gad_exc_somatic": "cleared",
      "gad_exc_bdd": "cleared",
      "gad_exc_illness_anxiety": "cleared",
      "gad_exc_psychotic": "cleared",
      "gad_subj_clinical_significance": "met",
      "gad_subj_excessive": "met",
      "duration_days": 187
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 364
    }
  },
  {
    "id": "vig_037_adhd_ambiguous_2cca9d6a",
    "ground_truth": [
      "adhd"
    ],
    "difficulty": "AMBIGUOUS",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n25-year-old graduate student presents with \"I can't focus, I forget things all the time, but it's probably not that bad.\"\n\n2. HISTORY OF PRESENT ILLNESS\nSymptoms reported to have first appeared around age 10 and have recurred across schooling; current pattern has been present for approximately 6 months with increased interference. Patient describes frequent inattention to task details: \"I turn in assignments with little mistakes because I skim and miss parts.\" Reports often not following through on multi-step tasks — starts projects (paper drafts, lab protocols) but \"lose interest halfway and get sidetracked by other things.\" Describes difficulty organizing: backpack and desk \"messy,\" deadlines missed because of poor time estimation and starting multiple tasks simultaneously. Avoids tasks requiring sustained mental effort (delays long readings, report preparation). States being easily distracted by external stimuli and by internal thoughts: \"I get pulled into random thoughts and then forget what I was doing.\" Reports forgetfulness in daily life (missed appointments, late bill payments, forgetting to return calls). Describes frequent motor restlessness: taps hands/feet, squirms, often gets up from seat in meetings or library, uncomfortable sitting still in restaurants. Notes feeling \"on the go\" and restless; talks a lot in group settings and acknowledges blurting answers or finishing others' sentences, though downplays this: \"People say I talk too much, but I don't always mean to.\" Patient minimizes severity and expresses uncertainty about need for treatment.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\n4. FAMILY HISTORY\nMother has longstanding problems with concentration and organization per patient report; no formal treatment reported.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nNo significant medical history. Alcohol: 1–2 drinks on weekends. Recreational drugs: denies current use; past occasional cannabis in college. Caffeine: 2–3 cups coffee daily.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, slightly disheveled. Behaviour: restless, frequent leg tapping, stood up once during interview. Speech: rapid at times, verbose. Mood: reports \"mostly okay.\" Affect: somewhat constricted but reactive. Thought process: tangential at points, frequent interruptions of own train of thought. Thought content: denies fixed false beliefs. Perceptions: denies hallucinations. Insight: limited; patient minimizes impact of symptoms.",
    "answers": {
      "adhd_a1a": "present",
      "adhd_a1b": "absent",
      "adhd_a1c": "absent",
      "adhd_a1d": "present",
      "adhd_a1e": "present",
      "adhd_a1f": "present",
      "adhd_a1g": "absent",
      "adhd_a1h": "present",
      "adhd_a1i": "present",
      "adhd_a2a": "present",
      "adhd_a2b": "present",
      "adhd_a2c": "absent",
      "adhd_a2d": "present",
      "adhd_a2e": "present",
      "adhd_a2f": "present",
      "adhd_a2g": "present",
      "adhd_a2h": "absent",
      "adhd_a2i": "absent",
      "adhd_exc_psychotic": "cleared",
      "adhd_exc_mood": "cleared",
      "adhd_exc_anxiety": "cleared",
      "adhd_exc_dissociative": "cleared",
      "adhd_exc_personality": "cleared",
      "adhd_exc_substance": "cleared",
      "adhd_subj_functional_impairment": "met",
      "adhd_subj_developmental": "met",
      "adhd_subj_not_oppositional": "met",
      "duration_days": 187,
      "onset_age": 10
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 352
    }
  },
  {
    "id": "vig_038_ptsd_moderate_53e37834",
    "ground_truth": [
      "ptsd"
    ],
    "difficulty": "MODERATE",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n34-year-old elementary school teacher presents with \"I can't stop having these dreams and I kind of can't feel like myself.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports onset approximately one month ago, beginning in early December 2025, after learning that her close friend was killed in a car crash. She states, \"I was told on the phone and it just felt unreal,\" and later reports, \"I don't really remember exactly what happened around that call — there's a blank.\" Patient describes recurrent distressing dreams several times per week in which she is back at the roadside scene; dreams evoke intense fear and sadness and wake her up. She endorses active efforts to avoid thinking about the event: \"I try not to scroll through his pictures or talk about him, I kind of close the tab.\" Patient reports persistent inability to feel positive emotions toward usual activities or relationships, saying, \"things that used to make me happy just feel muted, like I'm watching from far away.\" She describes increased irritability and several angry outbursts over the last month, including yelling at coworkers and once throwing a mug. Sleep is disturbed with difficulty falling asleep and restless sleep; naps leave her feeling unrefreshed. Patient cannot recall an important aspect of how she learned the news and describes a subjective gap in memory around that time. She reports no repetitive intrusive memories or episodes in which she feels the event is occurring again.\n\nPERTINENT NEGATIVES\nDenies directly experiencing the event. Denies witnessing the event in person. Denies repeated or extreme exposure to aversive details (e.g., as part of work). Denies recurrent, involuntary, and intrusive distressing memories. Denies dissociative reactions in which she feels the event is recurring. Denies intense or prolonged distress on exposure to cues. Denies marked physiological reactions to cues. Denies avoidance of external reminders (people, places, activities).\n\nFUNCTIONAL IMPACT\nWork: Reduced concentration and frequent absences, difficulty grading papers on time. Relationships: Withdrawal from friends, irritability causing conflict with partner. Daily activities: Difficulty enjoying hobbies, disrupted sleep affecting routine self-care.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history, no prior therapy or medications.\n\n4. FAMILY HISTORY\nMother with history of mood difficulties; no known hospitalizations.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nNo significant medical illnesses. Alcohol: 1–2 drinks socially 1–2 times/week. Recreational drugs: denies. Caffeine: 2–3 cups daily. Labs: TSH normal, metabolic panel unremarkable, toxicology negative. Medications: OTC ibuprofen as needed; no current prescriptions.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, groomed. Behavior: cooperative but intermittently tearful. Mood: \"numb, kind of on edge.\" Affect: restricted, congruent to mood. Thought content: denies current suicidal ideation, no plan or intent; protective factors include partner support and caregiving responsibilities. No homicidal ideation. Thought process linear. Cognition: oriented x3, short-term memory slightly impaired around the event, attention mildly decreased. Insight: limited understanding of emotional reaction, acknowledges need for support.",
    "answers": {
      "ptsd_a1": "absent",
      "ptsd_a2": "absent",
      "ptsd_a3": "present",
      "ptsd_a4": "absent",
      "ptsd_b1": "absent",
      "ptsd_b2": "present",
      "ptsd_b3": "absent",
      "ptsd_b4": "absent",
      "ptsd_b5": "absent",
      "ptsd_c1": "present",
      "ptsd_c2": "absent",
      "ptsd_d1": "present",
      "ptsd_d2": "absent",
      "ptsd_d3": "absent",
      "ptsd_d4": "absent",
      "ptsd_d5": "absent",
      "ptsd_d6": "absent",
      "ptsd_d7": "present",
      "ptsd_e1": "present",
      "ptsd_e2": "absent",
      "ptsd_e3": "absent",
      "ptsd_e4": "absent",
      "ptsd_e5": "absent",
      "ptsd_e6": "present",
      "ptsd_exc_substance": "cleared",
      "ptsd_exc_medical": "cleared",
      "ptsd_exc_dissociative_substance": "cleared",
      "ptsd_exc_dissociative_medical": "cleared",
      "ptsd_subj_distress": "met",
      "ptsd_subj_trauma_quality": "met",
      "ptsd_subj_violent_accidental": "met",
      "duration_days": 37
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 478
    }
  },
  {
    "id": "vig_039_asd_moderate_783eb9f5",
    "ground_truth": [
      "asd"
    ],
    "difficulty": "MODERATE",
    "meets_criteria": true,
    "clinical_text": "22-year-old college student presents with \"I kind of don't know how to talk to people\" and \"I sometimes just stick to what I know.\"\n\nHISTORY OF PRESENT ILLNESS:\nPatient reports a roughly 3-week increase in difficulties with social interactions that started about three weeks ago after returning to campus. Notes longstanding patterns since adolescence: \"This has been sort of like this since I was 16 — I just felt different in groups.\" Describes limited back-and-forth in conversation, often answering with brief comments or changing topic to a preferred subject; \"I might talk about trains for a long time and not notice they look bored.\" Reports reduced spontaneous sharing of emotions and interests, rarely initiating social plans and often not responding to others' invitations. Describes minimal eye contact and \"pretty flat\" facial expression at times; gestures are used infrequently and appear awkward when attempted. Reports difficulty adjusting behavior across contexts (e.g., same tone and topics with peers and professors) and few close friendships; \"I don't really get the rules of hanging out.\" Describes strong preference for routine: follows same route to campus daily and becomes upset if plans change. Reports an intense focus on a small number of subjects, spending hours reading about them. Denies stereotyped or repetitive motor movements, use of objects, or speech (e.g., lining up toys, echolalia). Denies hyper- or hyporeactivity to sensory input or unusual interest in sensory aspects of the environment.\n\nPAST PSYCHIATRIC HISTORY:\nNo prior psychiatric history or formal therapy.\n\nFAMILY HISTORY:\nMother treated intermittently for emotional problems; no further details available.\n\nMEDICAL HISTORY AND SUBSTANCES:\nNo chronic medical problems. Current medications: daily multivitamin. Denies alcohol, tobacco, and recreational drug use; drinks caffeinated beverages.\n\nMENTAL STATUS EXAMINATION:\nAppearance: casually dressed, well-groomed. Behavior: cooperative but reserved, sits slightly apart. Speech: soft, sometimes hesitant, normal rate. Mood: reports feeling \"okay, kind of tired.\" Affect: restricted range, limited facial animation, reduced eye contact. Thought process: coherent, concrete, often returns to preferred topics. Cognition: oriented x3, attention mildly variable during exam. Insight: limited regarding social impact of behaviors; recognizes some difficulty but minimizes consequences.",
    "answers": {
      "asd_a1": "present",
      "asd_a2": "present",
      "asd_a3": "present",
      "asd_b1": "absent",
      "asd_b2": "present",
      "asd_b3": "present",
      "asd_b4": "absent",
      "asd_exc_intellectual_disability": "cleared",
      "asd_subj_impairment": "met",
      "asd_subj_early_onset": "met",
      "asd_subj_severity_social": "met",
      "asd_subj_severity_rrb": "met",
      "duration_days": 21,
      "onset_age": 16
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 345
    }
  },
  {
    "id": "vig_040_mdd_moderate_1a9d2a36",
    "ground_truth": [
      "mdd"
    ],
    "difficulty": "MODERATE",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n42-year-old schoolteacher presents with \"I've been feeling kind of empty and can't get going most days.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports a roughly 3-week history of low mood that is present \"most of the day, almost every day,\" beginning in mid-December 2025 after a busy grading period. States, \"I feel sad and kind of hopeless sometimes,\" and, \"I cry at small things and then feel wiped out.\" Partner notes patient has appeared tearful and moved more slowly around the house. Patient endorses disturbed sleep nearly every night, reporting either difficulty falling asleep or waking very early and sleeping only 3–4 hours, and occasionally sleeping more than usual on weekends. Reports near-daily fatigue and \"not having the energy to do normal things.\" Observed psychomotor slowing by partner and teacher colleagues (speaks more slowly, takes longer to get ready) and patient admits sometimes feeling agitated and pacing at home. Describes diminished concentration at work: \"I keep losing my place when I read and make small mistakes on lesson plans.\" Expresses uncertainty and indecisiveness about routine choices.\n\nPERTINENT NEGATIVES\nDenies markedly diminished interest or pleasure in all, or almost all, activities most of the day, nearly every day. Denies significant weight loss or gain, or decrease or increase in appetite nearly every day. Denies feelings of worthlessness or excessive/inappropriate guilt nearly every day. Denies recurrent thoughts of death, recurrent suicidal ideation without a specific plan, suicide attempt, or a specific plan for committing suicide.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history. No prior psychotherapy or psychiatric medication reported.\n\n4. FAMILY HISTORY\nMother received mental health treatment in the past; no further details volunteered.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nMedical: seasonal allergies; otherwise no chronic medical problems reported. Substance use: drinks alcohol socially, approximately 1–2 drinks on weekends; denies recreational drug use; caffeine intake moderate (2–3 cups daily). TSH normal. Metabolic panel unremarkable. Toxicology negative. Medications: no current prescription medications; uses ibuprofen OTC PRN.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, hygiene adequate. Behavior: cooperative, mildly slowed movements. Speech: soft, somewhat slowed. Mood: reports \"sad\" and \"empty.\" Affect: constricted, tearful at times. Thought process: slowed, some difficulty maintaining topic and shifting back to point. Thought content: denies delusions; denies suicidal or homicidal ideation. Perceptions: denies hallucinations. Insight: limited to fair; patient acknowledges change and is somewhat concerned.",
    "answers": {
      "mdd_a1": "present",
      "mdd_a2": "absent",
      "mdd_a3": "absent",
      "mdd_a4": "present",
      "mdd_a5": "present",
      "mdd_a6": "present",
      "mdd_a7": "absent",
      "mdd_a8": "present",
      "mdd_a9": "absent",
      "mdd_exc_substance": "cleared",
      "mdd_exc_medical": "cleared",
      "mdd_exc_psychotic": "cleared",
      "mdd_exc_bipolar": "cleared",
      "mdd_subj_clinical_significance": "met",
      "duration_days": 21
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 391
    }
  },
  {
    "id": "vig_041_gad_ambiguous_94b63c63",
    "ground_truth": [
      "gad"
    ],
    "difficulty": "AMBIGUOUS",
    "meets_criteria": false,
    "clinical_text": "29-year-old software engineer presents with \"I'm worrying a lot about work and little things, but it's not terrible — I manage.\"\n\nHISTORY OF PRESENT ILLNESS:\nPatient reports approximately 5 months of persistent, excessive worry and apprehensive expectation, beginning around August 2025 after a reorganization at work. Worry is present more days than not and spans multiple domains, primarily performance at work, upcoming deadlines, and social interactions: \"I keep going over conversations and meetings in my head\" and \"I worry I'll miss something important.\" Patient states the worry is difficult to control: \"Even when I try to stop, it comes back.\" Patient minimizes severity, adding \"it's manageable most days\" and expresses uncertainty about whether it meets threshold for help. Denies restlessness or feeling keyed up or on edge. Denies being easily fatigued. Denies difficulty concentrating or mind going blank. Denies irritability.\n\nPAST PSYCHIATRIC HISTORY:\nNo prior psychiatric history. No past psychotherapy or psychotropic medication use reported.\n\nFAMILY HISTORY:\nMother reported to have had periods of low mood and worry; no known hospitalizations in family.\n\nMEDICAL HISTORY AND SUBSTANCES:\nMedical history notable for seasonal allergies only. Substance use: alcohol 1–2 drinks per week; denies recreational drug use; caffeine 2–3 cups coffee daily. Labs completed: TSH normal, metabolic panel unremarkable, toxicology negative. Current medications: loratadine as needed, OTC ibuprofen PRN; no current prescriptions for mood or thought symptoms.\n\nMENTAL STATUS EXAMINATION:\nAppearance: casually dressed, well-groomed. Behavior: cooperative, calm. Speech: normal rate and volume. Mood (subjective): \"a bit worried, but fine.\" Affect (observed): mildly constricted, appropriate to content. Thought process: logical, goal-directed with noticeable preoccupation around performance and future events. Thought content: preoccupation with possible errors and consequences; no evidence of delusional thinking. Cognition: oriented x3, attention and short-term memory intact on bedside testing. Insight: limited; patient acknowledges worry but minimizes impact and expresses uncertainty about need for intervention.",
    "answers": {
      "gad_a": "present",
      "gad_b": "present",
      "gad_c1": "absent",
      "gad_c2": "absent",
      "gad_c3": "absent",
      "gad_c4": "absent",
      "gad_c5": "absent",
      "gad_c6": "absent",
      "gad_exc_substance": "cleared",
      "gad_exc_medical": "cleared",
      "gad_exc_panic": "cleared",
      "gad_exc_social_anxiety": "cleared",
      "gad_exc_ocd": "cleared",
      "gad_exc_separation": "cleared",
      "gad_exc_ptsd": "cleared",
      "gad_exc_anorexia": "cleared",
      "gad_exc_somatic": "cleared",
      "gad_exc_bdd": "cleared",
      "gad_exc_illness_anxiety": "cleared",
      "gad_exc_psychotic": "cleared",
      "gad_subj_clinical_significance": "met",
      "gad_subj_excessive": "met",
      "duration_days": 177
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 305
    }
  },
  {
    "id": "vig_042_adhd_clear_6a6937d9",
    "ground_truth": [
      "adhd"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n27-year-old graphic designer presents with \"I can't focus and I'm messing everything up.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports longstanding difficulties with attention and restlessness beginning in childhood, first noticed \"around age 10,\" with marked worsening over the past six months. \"I miss small things all the time — I submit files with errors because I didn't double-check,\" he states. Describes frequent failure to complete tasks: \"I'll start a project, get halfway through, then get pulled onto something else and never finish it.\" Reports often not appearing to listen: during conversations his \"mind seems elsewhere,\" even when there are no distractions. Gives concrete examples: overlooks spellings in client logos, misses attachment of files in emails, forgets to include required pages in print jobs. Avoids long reports and administrative forms, postponing them until deadlines are missed. \"I lose my keys and wallet almost every week,\" he says; reports losing phones, chargers, and paperwork. States he is easily distracted by noises in the office and by unrelated thoughts, and frequently forgets appointments and to return calls. Notes motor restlessness: taps hands and feet while seated, gets up during meetings, feels \"driven\" and uncomfortable sitting through dinners. Reports talking rapidly in meetings, interrupting others, and blurting out answers before questions are finished. Duration: Symptoms present for approximately 6 month(s), with earlier onset noted at age 10.\n\nPERTINENT NEGATIVES\nDenies suicidal ideation, self-harm, or homicidal thoughts. Denies hearing voices or seeing things. No current intent to harm self/others. No recent significant recreational drug use.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history; no prior psychiatric medications or hospitalizations.\n\n4. FAMILY HISTORY\nFather with history of heavy alcohol use; no known hospitalizations for mental health in immediate family.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nNo chronic medical illnesses reported. Alcohol: 1–2 drinks on weekends. Recreational drugs: denies current use. Caffeine: 2–3 cups coffee daily.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, slightly disheveled. Behaviour: fidgeting, frequent shifting in seat, rose once during interview. Speech: somewhat rapid, spontaneous, interrupts interviewer. Mood: \"frustrated.\" Affect: reactive, somewhat irritable. Thought process: tangential at times, quick to interrupt, frequent topic shifts. Thought content: no delusional content reported. Perceptions: denies hallucinations. Insight: fair; acknowledges problems but minimizes impact at times.",
    "answers": {
      "adhd_a1a": "present",
      "adhd_a1b": "present",
      "adhd_a1c": "present",
      "adhd_a1d": "present",
      "adhd_a1e": "present",
      "adhd_a1f": "present",
      "adhd_a1g": "present",
      "adhd_a1h": "present",
      "adhd_a1i": "present",
      "adhd_a2a": "present",
      "adhd_a2b": "present",
      "adhd_a2c": "present",
      "adhd_a2d": "present",
      "adhd_a2e": "present",
      "adhd_a2f": "present",
      "adhd_a2g": "present",
      "adhd_a2h": "present",
      "adhd_a2i": "present",
      "adhd_exc_psychotic": "cleared",
      "adhd_exc_mood": "cleared",
      "adhd_exc_anxiety": "cleared",
      "adhd_exc_dissociative": "cleared",
      "adhd_exc_personality": "cleared",
      "adhd_exc_substance": "cleared",
      "adhd_subj_functional_impairment": "met",
      "adhd_subj_developmental": "met",
      "adhd_subj_not_oppositional": "met",
      "duration_days": 187,
      "onset_age": 10
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 374
    }
  },
  {
    "id": "vig_043_ptsd_clear_f3fe1ae4",
    "ground_truth": [
      "ptsd"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "36-year-old paramedic presents with \"I keep seeing him die and I can't stop it\" as chief complaint.\n\nHISTORY OF PRESENT ILLNESS\nPatient reports onset approximately 1 month ago after responding in person to a multi-vehicle collapse on 2025-12-03 in which he was directly trapped briefly, witnessed multiple fatalities on scene, and later learned that his close friend and coworker died in the same event. \"I was under the wreckage and then I watched Mark not breathe,\" he stated. He describes repeated work-related review of images and body recovery details as part of his role: \"I've had to open bags and identify parts of people — it's burned into me.\" He endorses recurrent, involuntary intrusive memories and recurrent distressing dreams that replay the event with the same sensory detail. He reports brief dissociative reactions where he feels \"like I'm back in the metal and can't tell what's real\" and episodes in which he cannot recall important moments from the rescue (\"I can't remember how I got out of the cab\"). Exposure to ambulances, the hospital bay, and specific streets produces immediate racing heart, sweating, and panic-like sensations; he avoids routes to the scene and has stopped riding with certain colleagues. He reports increasing irritability with angry outbursts at home (\"I smashed a plate last week\"), occasional reckless speeding, diminished participation in weekend biking, feelings of estrangement from his partner, and an inability to feel happiness. He notes hypervigilance, exaggerated startle at loud noises, poor concentration at work, and difficulty falling and staying asleep.\n\nPAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\nFAMILY HISTORY\nFather with history of alcohol use; no other known psychiatric hospitalizations in family.\n\nMEDICAL HISTORY AND SUBSTANCES\nNo chronic medical conditions. Substance use: alcohol 2–3 drinks on weekends, denies recreational drugs, caffeine 2–3 cups/day. Labs: TSH normal, metabolic panel unremarkable, toxicology negative. Medications: occasional ibuprofen and melatonin OTC; no current prescriptions.\n\nPERTINENT NEGATIVES (explicitly deny these):\nDenies hearing voices or seeing things not present. Denies homicidal ideation. Denies current use of recreational drugs.\n\nMENTAL STATUS EXAMINATION\nAppearance: disheveled, fatigue evident. Behavior: cooperative but frequently scans room. Mood: \"numb and guilty.\" Affect: restricted, tearful at times. Thought content: intrusive memories and flashbacks described; passive thoughts of death noted intermittently without a specific plan; denies intent; protective factors include partner and two children. Cognition: oriented x3, concentration impaired by intrusive imagery. Insight: recognizes symptoms as related to the event and expresses desire for help.",
    "answers": {
      "ptsd_a1": "present",
      "ptsd_a2": "present",
      "ptsd_a3": "present",
      "ptsd_a4": "present",
      "ptsd_b1": "present",
      "ptsd_b2": "present",
      "ptsd_b3": "present",
      "ptsd_b4": "present",
      "ptsd_b5": "present",
      "ptsd_c1": "present",
      "ptsd_c2": "present",
      "ptsd_d1": "present",
      "ptsd_d2": "present",
      "ptsd_d3": "present",
      "ptsd_d4": "present",
      "ptsd_d5": "present",
      "ptsd_d6": "present",
      "ptsd_d7": "present",
      "ptsd_e1": "present",
      "ptsd_e2": "present",
      "ptsd_e3": "present",
      "ptsd_e4": "present",
      "ptsd_e5": "present",
      "ptsd_e6": "present",
      "ptsd_exc_substance": "cleared",
      "ptsd_exc_medical": "cleared",
      "ptsd_exc_dissociative_substance": "cleared",
      "ptsd_exc_dissociative_medical": "cleared",
      "ptsd_subj_distress": "met",
      "ptsd_subj_trauma_quality": "met",
      "ptsd_subj_violent_accidental": "met",
      "duration_days": 37
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 403
    }
  },
  {
    "id": "vig_044_asd_moderate_55a82d03",
    "ground_truth": [
      "asd"
    ],
    "difficulty": "MODERATE",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n20-year-old college student presents with \"I'm kind of having trouble with people and it's been worse these last few weeks.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports a gradual pattern of interpersonal difficulties that \"first started around age 16,\" with an acute increase in social withdrawal and unusual behaviors over the past approximately 3 weeks. She says, \"Sometimes I don't know how to answer when people talk to me, I kind of just look away,\" and later, \"I keep repeating things I heard on TV, it's like I say the same line over and over.\" Timeline: difficulty with back-and-forth conversation noted in adolescence; recent three-week period marked by more frequent avoidance of peers, more obvious repetitive motions (hand flapping and flipping a ring), and greater sensory sensitivity to crowded dining halls. She reports reduced spontaneous sharing of emotions or interests and difficulty adjusting her behavior in different social settings; describes being \"not super into hanging out\" but hedges that she \"sort of wants friends but doesn't know how to join in.\"\n\nPertinent negatives: Denies insistence on sameness, inflexible adherence to routines, or ritualized patterns of behavior. Denies highly restricted, fixated interests that are abnormal in intensity or focus.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history. No prior psychiatric medications or hospitalizations.\n\n4. FAMILY HISTORY\nMother has a history of anxiety symptoms and receives ongoing outpatient counseling.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nNo significant medical history. No current prescription medications. Occasional alcohol use on weekends; reports one instance of cannabis use several months ago.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, slightly disheveled. Behaviour: limited spontaneous social initiation, intermittent hand flapping. Speech: soft, literal, sometimes repeats phrases heard earlier. Mood (subjective): \"a little stressed, kind of tired.\" Affect (observed): restricted range, minimal facial animation, limited spontaneous smiling. Thought process: concrete, occasionally perseverative on topics, no evidence of disorganized thought. Cognition: oriented x3, attention mildly variable during interview, intact short-term recall. Insight: limited understanding of how behaviors affect relationships; acknowledges some difficulty but hedges ability to change. Functional impact: academic performance declining due to avoidance of group projects and missed classes; peer relationships strained, few social contacts; daily activities impacted by sensory avoidance (avoids crowded places, eats at odd times to minimize noise).",
    "answers": {
      "asd_a1": "present",
      "asd_a2": "present",
      "asd_a3": "present",
      "asd_b1": "present",
      "asd_b2": "absent",
      "asd_b3": "absent",
      "asd_b4": "present",
      "asd_exc_intellectual_disability": "cleared",
      "asd_subj_impairment": "met",
      "asd_subj_early_onset": "met",
      "asd_subj_severity_social": "met",
      "asd_subj_severity_rrb": "met",
      "duration_days": 21,
      "onset_age": 16
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 377
    }
  },
  {
    "id": "vig_045_mdd_gad_comorbid_66b258a2",
    "ground_truth": [
      "mdd",
      "gad"
    ],
    "difficulty": "COMORBID",
    "meets_criteria": true,
    "clinical_text": "DEMOGRAPHICS AND CHIEF COMPLAINT\n34-year-old software engineer presents with \"I can't get out of bed and I'm worried all the time.\"\n\nHISTORY OF PRESENT ILLNESS\nPatient reports a roughly 6-month history of pervasive low mood and worry, beginning around July 2025 after an increase in workload. States \"I feel empty most days\" and \"nothing is enjoyable anymore.\" Reports marked loss of interest in hobbies formerly enjoyed (stopped attending weekend coding meetups, no longer plays guitar), and says he rarely finds pleasure in social activities. Describes appetite change with 8-lb weight loss in one month without dieting and reports \"I often forget to eat.\" Sleep is disrupted: difficulty falling asleep and frequent early morning awakening most nights. Observed by partner as tearful on several occasions and markedly slowed movements at times; at other times reports feeling restless and unable to sit still. Endorses low energy nearly every day and excessive self-blame: \"I don't deserve to be promoted.\" Reports difficulty concentrating at work, missing deadlines and making coding errors. Describes recurrent thoughts of death and passive suicidal ideation without a specific plan; states \"Sometimes I think about not waking up\" but denies any intent today. Also endorses pervasive worry about job performance and finances for at least 6 months, difficulty controlling worry, feeling keyed up, easy fatigability, tension in shoulders and neck, irritability with coworkers, and frequent blanking when trying to focus. Timeline: symptoms gradual in onset, worse over past 3 months.\n\nPAST PSYCHIATRIC HISTORY\nNo prior psychiatric history. Denies prior psychiatric hospitalizations. Denies prior suicide attempts.\n\nFAMILY HISTORY\nMother had recurrent periods of low mood treated intermittently with medication; father reports long-standing high stress at work.\n\nMEDICAL HISTORY AND SUBSTANCES\nPMH: seasonal allergic rhinitis. Substance use: alcohol 1–2 drinks on weekends, denies recreational drug use, caffeine 2 cups coffee daily. TSH normal. Metabolic panel unremarkable. Toxicology negative. Medications: loratadine OTC PRN; acetaminophen PRN.\n\nPERTINENT NEGATIVES\nDenies hallucinations. Denies current intent or plan for suicide. Denies history of manic-type episodes. No recent substance intoxication reported.\n\nMENTAL STATUS EXAMINATION\nAppearance: casually dressed, slightly unkempt. Behaviour: cooperative but psychomotor slowing observed during interview with intermittent restlessness. Speech: soft, slow, coherent. Mood: subjectively \"sad, worried.\" Affect: constricted, tearful at times. Thought process: goal-directed but slowed, frequent pauses and difficulty initiating responses. Thought content: passive death ideation without plan; denies fixed false beliefs. Perceptions: denies hallucinations. Insight: limited — attributes symptoms to personal failure rather than medical/psychosocial factors.",
    "answers": {
      "mdd_a1": "present",
      "mdd_a2": "present",
      "mdd_a3": "present",
      "mdd_a4": "present",
      "mdd_a5": "present",
      "mdd_a6": "present",
      "mdd_a7": "present",
      "mdd_a8": "present",
      "mdd_a9": "present",
      "mdd_exc_substance": "cleared",
      "mdd_exc_medical": "cleared",
      "mdd_exc_psychotic": "cleared",
      "mdd_exc_bipolar": "cleared",
      "mdd_subj_clinical_significance": "met",
      "duration_days": 194,
      "gad_a": "present",
      "gad_b": "present",
      "gad_c1": "present",
      "gad_c2": "present",
      "gad_c3": "present",
      "gad_c4": "present",
      "gad_c5": "present",
      "gad_c6": "present",
      "gad_exc_substance": "cleared",
      "gad_exc_medical": "cleared",
      "gad_exc_panic": "cleared",
      "gad_exc_social_anxiety": "cleared",
      "gad_exc_ocd": "cleared",
      "gad_exc_separation": "cleared",
      "gad_exc_ptsd": "cleared",
      "gad_exc_anorexia": "cleared",
      "gad_exc_somatic": "cleared",
      "gad_exc_bdd": "cleared",
      "gad_exc_illness_anxiety": "cleared",
      "gad_exc_psychotic": "cleared",
      "gad_subj_clinical_significance": "met",
      "gad_subj_excessive": "met"
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 402
    }
  },
  {
    "id": "vig_046_mdd_ptsd_comorbid_d0df1e71",
    "ground_truth": [
      "mdd",
      "ptsd"
    ],
    "difficulty": "COMORBID",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n28-year-old retail manager presents with \"I can't stop replaying what I saw and I feel numb and worthless\" and \"I don't want to do anything anymore.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports onset approximately 1 month ago after witnessing a severe workplace assault. \"I saw him get hurt and I still hear it in my head,\" and \"I wake up drenched in sweat from the same dream.\" Reports persistent low mood most days, describes feeling \"empty\" and \"hopeless.\" Notes marked loss of interest in hobbies and socializing; stopped attending weekly soccer and declined a close friend's birthday dinner. Reports 10 lb weight loss without dieting over the past month and decreased appetite. Sleep disturbed: difficulty falling asleep and frequent nightmares about the event. Describes periods of slowed movement and speech observed by coworkers, alternating with nights of restlessness and pacing. Reports fatigue, poor concentration at work, excessive guilt (\"I should have done more\"), and recurrent thoughts of death without an active plan; states \"I think about just not waking up\" but denies intent or a specific plan. Reports intrusive, involuntary memories, distress at reminders (sirens, crowded break room), avoidance of the location where event occurred, hypervigilance, exaggerated startle to loud noises, and feelings of detachment from others.\n\nPertinent negatives: Denies auditory or visual hallucinations. Denies current intent to act on suicidal thoughts. Denies recent substance use other than alcohol described below. No history of seizures or head injury.\n\nDuration: Symptoms present for approximately 1 month, began after witnessing the assault about 4 weeks ago.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history. No prior psychiatric hospitalizations. No previous psychotropic medication use.\n\n4. FAMILY HISTORY\nMother had episodes of low mood requiring counseling; no known hospitalizations.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nMedical: well-controlled seasonal allergies. Substance use: alcohol 2–3 drinks per week, no recreational drug use, caffeine 2 cups coffee daily. Labs: TSH normal; metabolic panel unremarkable; toxicology negative. Medications: OTC loratadine as needed; takes ibuprofen PRN.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, disheveled. Behavior: cooperative but reduced eye contact. Speech: soft, slowed. Mood: \"hopeless, numb.\" Affect: constricted, tearful during discussion of event. Thought process: slowed, ruminative. Thought content: recurrent suicidal thoughts without plan; excessive self-blame; no fixed false beliefs reported. Perceptions: denies hallucinations. Insight: limited; recognizes symptoms but attributes them solely to weakness.",
    "answers": {
      "mdd_a1": "present",
      "mdd_a2": "present",
      "mdd_a3": "present",
      "mdd_a4": "present",
      "mdd_a5": "present",
      "mdd_a6": "present",
      "mdd_a7": "present",
      "mdd_a8": "present",
      "mdd_a9": "present",
      "mdd_exc_substance": "cleared",
      "mdd_exc_medical": "cleared",
      "mdd_exc_psychotic": "cleared",
      "mdd_exc_bipolar": "cleared",
      "mdd_subj_clinical_significance": "met",
      "duration_days": 44,
      "ptsd_a1": "present",
      "ptsd_a2": "present",
      "ptsd_a3": "present",
      "ptsd_a4": "present",
      "ptsd_b1": "present",
      "ptsd_b2": "present",
      "ptsd_b3": "present",
      "ptsd_b4": "present",
      "ptsd_b5": "present",
      "ptsd_c1": "present",
      "ptsd_c2": "present",
      "ptsd_d1": "present",
      "ptsd_d2": "present",
      "ptsd_d3": "present",
      "ptsd_d4": "present",
      "ptsd_d5": "present",
      "ptsd_d6": "present",
      "ptsd_d7": "present",
      "ptsd_e1": "present",
      "ptsd_e2": "present",
      "ptsd_e3": "present",
      "ptsd_e4": "present",
      "ptsd_e5": "present",
      "ptsd_e6": "present",
      "ptsd_exc_substance": "cleared",
      "ptsd_exc_medical": "cleared",
      "ptsd_exc_dissociative_substance": "cleared",
      "ptsd_exc_dissociative_medical": "cleared",
      "ptsd_subj_distress": "met",
      "ptsd_subj_trauma_quality": "met",
      "ptsd_subj_violent_accidental": "met"
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 390
    }
  },
  {
    "id": "vig_047_adhd_clear_b587b5f5",
    "ground_truth": [
      "adhd"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n29-year-old accountant presents with \"I can't focus, I'm always losing things and messing up at work.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports a long-standing pattern of distractibility that began around age 10 but has been particularly disruptive over the past approximately 6 months. \"I started zoning out in class when I was a kid,\" he states, \"and now at work I'll read an email and forget half of it.\" He describes frequently overlooking details on spreadsheets, entering incorrect figures, and missing two deadlines in the last three months. Gives concrete examples: left important receipts at home, lost his wallet twice in one week, and forgot a scheduled client call last month. Reports starting tasks (monthly reports, home chores) then becoming sidetracked by unrelated thoughts or external stimuli; \"I'll open a document to work and end up scrolling my phone for 30 minutes.\" Notes fidgeting in meetings, standing or pacing when expected to sit, and colleagues comment that he \"talks over people\" and interrupts during conversations. Sleep and mood changes are denied as primary explanations. Duration: symptoms present for approximately 6 months at current severity. Onset: symptoms first appeared around age 10.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history and no prior psychiatric medications or formal therapy reported.\n\n4. FAMILY HISTORY\nFather described as having lifelong problems with restlessness and disorganization; no known formal diagnoses in family.\n\nPERTINENT NEGATIVES\nDenies suicidal ideation, homicidal ideation, self-harm. Denies hearing voices or seeing things. Denies recent use of illicit stimulants.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nNo significant medical history reported. Alcohol: 1–2 drinks socially per week. Recreational drugs: denies current use; remote experimentation in college only. Caffeine: 2–3 cups coffee daily.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: casually dressed, slightly disheveled workspace notes. Behaviour: fidgets with hands and feet, frequently shifts in seat, stands briefly during interview. Speech: slightly rapid, sometimes interrupts examiner. Mood: \"frustrated\" per patient. Affect: reactive, occasionally bright when describing examples. Thought process: goal-directed but tangential at times, frequent topic shifts. Thought content (delusions): Denies fixed false beliefs. Perceptions (hallucinations): Denies auditory or visual hallucinations. Insight: limited recognition of impact on work and relationships; acknowledges problems but attributes much to being \"busy.\"",
    "answers": {
      "adhd_a1a": "present",
      "adhd_a1b": "present",
      "adhd_a1c": "present",
      "adhd_a1d": "present",
      "adhd_a1e": "present",
      "adhd_a1f": "present",
      "adhd_a1g": "present",
      "adhd_a1h": "present",
      "adhd_a1i": "present",
      "adhd_a2a": "present",
      "adhd_a2b": "present",
      "adhd_a2c": "present",
      "adhd_a2d": "present",
      "adhd_a2e": "present",
      "adhd_a2f": "present",
      "adhd_a2g": "present",
      "adhd_a2h": "present",
      "adhd_a2i": "present",
      "adhd_exc_psychotic": "cleared",
      "adhd_exc_mood": "cleared",
      "adhd_exc_anxiety": "cleared",
      "adhd_exc_dissociative": "cleared",
      "adhd_exc_personality": "cleared",
      "adhd_exc_substance": "cleared",
      "adhd_subj_functional_impairment": "met",
      "adhd_subj_developmental": "met",
      "adhd_subj_not_oppositional": "met",
      "duration_days": 187,
      "onset_age": 10
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 367
    }
  },
  {
    "id": "vig_048_ptsd_clear_f57ed1c5",
    "ground_truth": [
      "ptsd"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n35-year-old paramedic presents with \"I can't stop seeing the crash; it's like I'm back there all the time.\"\n\n2. HISTORY OF PRESENT ILLNESS\nApproximately 1 month duration. Symptoms began about four weeks ago after responding as first responder to a multi-vehicle collision in which multiple people were killed, including a close friend who arrived on scene later and was found deceased; patient also learned that a childhood friend died in the same incident. Patient reports direct involvement in extricating victims and \"was there when they died.\" States, \"I relive the scene on loop,\" and \"I wake up sweating, my heart is racing and I'm back at the highway.\" Describes repeated exposure to aversive details at work (photographs, victim belongings) and by assisting in body recovery: \"I keep smelling gasoline and metal; it drags me back.\" Reports recurrent intrusive memories and frequent nightmares with the same scene; describes episodes where he feels as if the event is happening now and has to stop work: \"I feel like I'm back at the roadside — I can't tell what's real.\" Acknowledges avoiding highways, the hospital trauma bay, coworkers who were on scene, and conversations about the collision. Reports inability to recall certain moments from the scene (\"I can't remember driving away; there's a blank\"), persistent guilt (\"If I'd slowed down more he might have lived\"), pervasive fear and anger, diminished interest in evening basketball, feeling detached from his partner, frequent outbursts of yelling at family, one episode of reckless driving since the incident. Reports hypervigilance, exaggerated startle to loud engines, poor concentration at work, difficulty falling and staying asleep.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history.\n\n4. FAMILY HISTORY\nMother with history of heavy alcohol use requiring medical care; no other known psychiatric hospitalizations in family.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nSubstance use: drinks alcohol 2-3 times weekly (2–3 drinks), denies recreational drug use, caffeine 2 cups/day. TSH normal, metabolic panel unremarkable, toxicology negative. Medications: over-the-counter ibuprofen PRN; no prescribed medications.\n\nPERTINENT NEGATIVES\nDenies current auditory or visual hallucinations independent of memories. Denies suicidal plan or intent; expresses protective factors (partner, job responsibilities). Denies current homicidal intent.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: fatigued, slightly disheveled. Behavior: restless, frequently scanning room. Mood: \"on edge,\" fearful and guilty. Affect: constricted, tearful when describing victims. Thought content: preoccupation with crash details; intrusive recollections reported. Suicidal ideation: passive thoughts of life being \"not worth it at times,\" no plan, no intent, protective factors noted (partner, job). Cognition: oriented x3, attention intermittently impaired by intrusions. Insight: recognizes symptoms relate to the incident and reports desire for help.",
    "answers": {
      "ptsd_a1": "present",
      "ptsd_a2": "present",
      "ptsd_a3": "present",
      "ptsd_a4": "present",
      "ptsd_b1": "present",
      "ptsd_b2": "present",
      "ptsd_b3": "present",
      "ptsd_b4": "present",
      "ptsd_b5": "present",
      "ptsd_c1": "present",
      "ptsd_c2": "present",
      "ptsd_d1": "present",
      "ptsd_d2": "present",
      "ptsd_d3": "present",
      "ptsd_d4": "present",
      "ptsd_d5": "present",
      "ptsd_d6": "present",
      "ptsd_d7": "present",
      "ptsd_e1": "present",
      "ptsd_e2": "present",
      "ptsd_e3": "present",
      "ptsd_e4": "present",
      "ptsd_e5": "present",
      "ptsd_e6": "present",
      "ptsd_exc_substance": "cleared",
      "ptsd_exc_medical": "cleared",
      "ptsd_exc_dissociative_substance": "cleared",
      "ptsd_exc_dissociative_medical": "cleared",
      "ptsd_subj_distress": "met",
      "ptsd_subj_trauma_quality": "met",
      "ptsd_subj_violent_accidental": "met",
      "duration_days": 37
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 435
    }
  },
  {
    "id": "vig_049_asd_clear_f37ad925",
    "ground_truth": [
      "asd"
    ],
    "difficulty": "CLEAR",
    "meets_criteria": true,
    "clinical_text": "1. DEMOGRAPHICS AND CHIEF COMPLAINT\n18-year-old college student presents with \"People think I'm rude because I don't respond to them\" and \"I get very upset if my routine changes.\"\n\n2. HISTORY OF PRESENT ILLNESS\nPatient reports a noticeable change with increased rigidity and social withdrawal over the past three weeks, with longstanding patterns dating back to adolescence. \"I usually answer by repeating what someone said; it's easier than thinking of my own words,\" the patient says, describing intermittent echolalia during conversations. Describes difficulty with back-and-forth conversation: will answer questions with brief factual statements and then stop speaking, often not asking follow-up questions. Reports poor eye contact and avoiding gestures: \"I stare at my desk or my hands when someone talks to me.\" Describes ritualized behaviors: lines up personal items on desk each morning, takes same walking route to campus, and becomes highly distressed if interrupted—\"Yesterday my friend moved my phone and I had to leave class.\" Reports intense, narrow interest in clocks and mechanical parts, spending hours disassembling watches and describing them in detail to others who are uninterested. Notes repetitive motor behavior (finger flipping, occasional hand-flapping) when anxious or excited. Reports heightened sensitivity to specific sounds (loud chewing, fire alarm) and aversion to certain textures. Timeline: current worsening began approximately three weeks ago; similar social and behavioral patterns first appeared around age 16.\n\nPERTINENT NEGATIVES\nDenies suicidal ideation or intent. Denies homicidal ideation. Denies hallucinations. Denies illicit drug use; reports occasional alcohol (1–2 drinks on social occasions). No history of seizures.\n\n3. PAST PSYCHIATRIC HISTORY\nNo prior psychiatric history, no prior psychiatric hospitalizations, no prior medications for behavioral or emotional concerns.\n\n4. FAMILY HISTORY\nMother has treated hypertension; no known family history of psychiatric hospitalization reported.\n\n5. MEDICAL HISTORY AND SUBSTANCES\nNo chronic medical conditions. Current medications: none; uses ibuprofen PRN. Occasional alcohol use as above. Denies tobacco use.\n\n6. MENTAL STATUS EXAMINATION\nAppearance: neatly dressed, age-appropriate. Behavior: avoids eye contact, repeats phrases heard in room, lines pens on desk during interview. Speech: low volume, literal, occasional echolalia. Mood (subjective): \"Okay mostly, annoyed when things change.\" Affect (observed): restricted range, flat facial expression for much of interview. Thought process: linear but concrete, limited spontaneous elaboration, frequent focus on mechanical details. Cognition: oriented x3, attention fluctuates with repetitive motor movements, short-term memory preserved on testing. Insight: limited awareness of impact of social behaviors on relationships.",
    "answers": {
      "asd_a1": "present",
      "asd_a2": "present",
      "asd_a3": "present",
      "asd_b1": "present",
      "asd_b2": "present",
      "asd_b3": "present",
      "asd_b4": "present",
      "asd_exc_intellectual_disability": "cleared",
      "asd_subj_impairment": "met",
      "asd_subj_early_onset": "met",
      "asd_subj_severity_social": "met",
      "asd_subj_severity_rrb": "met",
      "duration_days": 21,
      "onset_age": 16
    },
    "verification": {
      "valid": true,
      "issues": [],
      "warnings": [],
      "word_count": 395
    }
  }
]