[
  {
    "id": "vig_000_mdd_moderate",
    "ground_truth": [
      "mdd"
    ],
    "difficulty": "MODERATE",
    "meets_criteria": true,
    "clinical_text": "Patient: 38-year-old female schoolteacher. Lives with partner; no children at home. Employed full-time. No prior psychiatric hospitalizations.\n\nChief complaint (in patient’s words): \"I can't sleep, keep losing weight, and I can't concentrate at work. Sometimes I think about not waking up, but I'm not planning anything.\"\n\nHistory of present illness: The patient reports a 3-week (21-day) history of progressive functional decline. She describes difficulty initiating and maintaining sleep most nights with early morning awakenings (~2–3:30 AM) and estimates total sleep 3–4 hours/night. Appetite has decreased and she reports an unintentional 8-lb weight loss over three weeks (approximately 6% of baseline body weight). She endorses near-daily fatigue and low energy that interfere with teaching duties and household responsibilities. She denies feeling sad most of the day and explicitly states, \"I'm not depressed in the way I used to be — I just feel exhausted and blank.\" She reports preserved interest in a few activities (still plays guitar on weekends and met friends twice this month) but recognizes decreased stamina and concentration, stating, \"I start a task and forget what I was doing.\" She describes marked difficulty concentrating and making routine decisions nearly every day for the past three weeks.\n\nShe acknowledges recurrent thoughts of death — \"Sometimes I think about dying, like not waking up\" — and admits to passive suicidal ideation without a specific plan or intent. She denies any past manic or hypomanic episodes, no history of psychosis, and no current hallucinations or delusional thinking. She reports no recent substance use beyond occasional wine (1–2 glasses) and a negative urine toxicology screen obtained in clinic. Medical evaluation including TSH and basic metabolic panel within normal limits; no medications or medical conditions identified as causative.\n\nMental status examination: Alert and oriented to person, place, time. Appearance: casually dressed, hygiene adequate. Behavior: cooperative, no psychomotor agitation or retardation observed. Speech: normal rate, tone, and volume. Mood (subjective): reports feeling \"tired,\" \"empty,\" and \"blank,\" denies being sad. Affect: constricted but appropriate to content. Thought process: linear and goal-directed. Thought content: passive death wishes and recurrent thoughts of death without intent or plan; no suicidal intent; no homicidal ideation. No delusions or perceptual disturbances. Cognition: attention and concentration diminished on serial 7s and digit span; memory intact for recent and remote events. Insight: fair; judgment: somewhat impaired by indecisiveness. Symptoms cause significant occupational impairment (missed lesson planning, decreased classroom effectiveness) and interpersonal strain.\n\nExclusions: No evidence symptoms are substance-induced, medically explained, psychotic, or part of bipolar illness. Clinical significance criterion met.",
    "answers": {
      "mdd_a6": "present",
      "mdd_a4": "present",
      "mdd_a8": "present",
      "mdd_a3": "present",
      "mdd_a9": "present",
      "mdd_a1": "absent",
      "mdd_a5": "absent",
      "mdd_a2": "absent",
      "mdd_a7": "absent",
      "mdd_exc_substance": "cleared",
      "mdd_exc_medical": "cleared",
      "mdd_exc_psychotic": "cleared",
      "mdd_exc_bipolar": "cleared",
      "mdd_subj_clinical_significance": "met",
      "duration_days": 21
    }
  }
]