[
  {
    "id": "vig_20260102_103450_000_mdd",
    "ground_truth": "mdd",
    "difficulty": "AMBIGUOUS",
    "demographics": "29-year-old woman, software quality assurance analyst, lives alone in an urban apartment; single; college graduate; no military history; bilingual (English/Spanish).",
    "clinical_text": "Chief concern: “I feel like I’m disappearing from my own life.”\n\nHistory of present illness: The patient is a 29-year-old software QA analyst presenting for evaluation of progressively worsening mood and functioning over the past 7–8 weeks, with a clear deterioration in the last 3 weeks. She reports feeling “down and empty most of the day, almost every day,” and describes a marked loss of interest in activities she previously enjoyed (running, cooking new recipes, online gaming with friends). “Even when I force myself to do it, it doesn’t register as fun.” She notes reduced social engagement and increased time alone. Coworkers have commented that she seems “harder to read” and “more quiet,” which she finds confusing and embarrassing: “I’m not trying to be cold—I just don’t have the energy to make my face do the right thing.”\n\nShe endorses significant fatigue (“like moving through wet cement”) and impaired concentration, especially when reviewing test cases and writing reports. “I’ll read the same paragraph five times and it doesn’t stick.” She reports early-morning awakening (waking around 3–4 a.m. with difficulty returning to sleep) and overall decreased sleep from 7–8 hours to 4–5 hours nightly. Appetite is decreased with an unintentional weight loss of approximately 8 pounds over the last month. She describes feeling slowed down at times (“I sit on the couch and can’t start anything”) and at other times restless, pacing briefly in her apartment.\n\nShe endorses pervasive guilt and worthlessness disproportionate to circumstances: “My team would be better off without me. I’m a burden. I mess up everything.” She denies any recent disciplinary action at work but states her productivity has dropped and she has missed two deadlines, which is atypical for her. She reports frequent tearfulness when alone and occasional irritability with emails and minor interruptions.\n\nSafety: She reports recurrent thoughts that she “wouldn’t mind not waking up,” and has had passive suicidal thoughts several times per week for the past two weeks. She denies current intent. She denies having a plan and denies preparatory behaviors. She states she has avoided alcohol and has removed unused prescription pain medication from her home “because it scared me that it was there.” She identifies protective factors including her sister, her cat, and not wanting to hurt her family: “I don’t actually want to die. I just want the pain to stop.” No history of suicide attempts.\n\nFeatures raising diagnostic complexity / social-communication concerns: She reports longstanding introversion and a preference for predictable routines (“I like knowing what the day will look like”), and she describes feeling socially ‘out of sync’ recently: “In meetings I can’t tell when it’s my turn to talk, so I just don’t.” She worries she may be “wired differently,” noting that after work she often needs to be alone in a quiet room. She describes discomfort with loud environments and bright open-plan office lighting. However, she reports adequate social development in childhood and adolescence: she had several close friends throughout school, participated in a drama club in high school, dated intermittently in college, and maintained reciprocal friendships until this recent decline. She describes enjoying imaginative play as a child and denies a history of persistent difficulties with back-and-forth conversation, understanding relationships, or nonverbal communication across settings. She denies a history of restricted, fixated interests that were abnormal in intensity or focus; she describes hobbies that shifted over time (sports in middle school, art in late high school, running and cooking in adulthood). No history of stereotyped movements or insistence on rigid rituals beyond general preference for routine. She notes that her current flatness and reduced expressiveness feel new and unwanted: “I used to laugh easily; now my face feels stuck.”\n\nPsychiatric history: No prior psychiatric hospitalizations. She reports one brief period of low mood during college after a breakup lasting about two weeks that resolved without treatment. No history suggestive of elevated mood, decreased need for sleep with increased energy, grandiosity, pressured speech, risky behavior, or episodic increased goal-directed activity. No panic attacks. Denies obsessive-compulsive symptoms. Denies psychotic symptoms.\n\nMedical history: Generally healthy. Mild intermittent migraines. No thyroid disease known. Not pregnant. Current medications: occasional ibuprofen. No supplements.\n\nSubstance use: Drinks alcohol 0–2 drinks/month; none in the last month. Denies cannabis, stimulants, opioids, or other substances. Caffeine 1–2 cups coffee/day.\n\nFamily history: Mother with history of recurrent depressive episodes treated with antidepressants. No known family history of bipolar disorder or psychotic disorders. One cousin with ADHD.\n\nSocial history and stressors: Recently transferred to a new team 3 months ago with increased ambiguity in role expectations. She reports feeling socially isolated after several friends moved away last year, though she previously kept in contact and met weekly online. Over the past month she has been cancelling calls: “I can’t think of anything to say.” Financially stable. No legal issues.\n\nMental status examination: Appearance neat, mildly disheveled hair; cooperative. Psychomotor: mild retardation with occasional brief fidgeting. Speech soft, slowed, normal volume. Mood “numb and sad.” Affect constricted, tearful at times. Thought process linear. Thought content notable for self-critical ruminations and passive death wishes; no delusions. No hallucinations. Cognition grossly intact though attention subjectively impaired. Insight fair. Judgment fair. \n\nClinical impression (narrative): Presentation characterized by a sustained period of depressed mood and markedly diminished interest/pleasure with neurovegetative changes (sleep, appetite/weight), fatigue, psychomotor change, diminished concentration, and excessive guilt, causing clinically significant occupational and social impairment. Social withdrawal and reduced expressiveness are temporally linked to the current mood episode and contrast with previously adequate social reciprocity and developmental history, making a primary neurodevelopmental social-communication condition less likely. Ongoing safety monitoring indicated given passive suicidal ideation.",
    "symptom_checklist": {
      "mdd_A1_depressed_mood_most_of_day_nearly_every_day": "present",
      "mdd_A2_anhedonia": "present",
      "mdd_A3_weight_or_appetite_change": "present",
      "mdd_A4_insomnia_or_hypersomnia": "present",
      "mdd_A5_psychomotor_agitation_or_retardation": "present",
      "mdd_A6_fatigue_or_loss_of_energy": "present",
      "mdd_A7_worthlessness_or_excessive_guilt": "present",
      "mdd_A8_diminished_concentration_or_indecisiveness": "present",
      "mdd_A9_recurrent_thoughts_of_death_or_suicidal_ideation": "present",
      "mdd_duration_2_weeks_or_more": "present",
      "mdd_clinically_significant_distress_or_impairment": "present",
      "manic_or_hypomanic_episode_history": "absent",
      "substance_or_medical_induced_mood_change_evidence": "absent",
      "asd_childhood_social_communication_deficits_persistent": "absent",
      "asd_restricted_repetitive_behaviors_or_fixated_interests": "absent",
      "asd_symptoms_present_in_early_development": "absent"
    },
    "comorbid": false
  },
  {
    "id": "vig_20260102_103508_001_gad",
    "ground_truth": "gad",
    "difficulty": "CLEAR",
    "demographics": "34-year-old woman, married, two children, employed full-time as an accountant at a mid-sized firm; lives with spouse and children; no military history.",
    "clinical_text": "34-year-old woman presents to outpatient psychiatry reporting “I worry about everything, all the time,” with persistent, excessive anxiety and worry occurring more days than not for the past 10–11 months. She describes the worry as difficult to control and shifting across multiple areas, including work performance (fear of making minor errors and being fired despite consistently positive reviews), finances (“even when the bills are paid, I feel like something will go wrong”), her children’s health and safety (ruminating about accidents or illnesses after routine school days), and her spouse’s wellbeing. She reports spending several hours per day in a state of apprehensive expectation, repeatedly running through “what if” scenarios, seeking reassurance, and re-checking emails and calculations at work. She says, “I tell myself to stop, but my brain won’t let it go,” and notes the worry persists even when there is no immediate trigger.\n\nAssociated symptoms have been present most days during this period. She endorses feeling keyed up and restless (“I’m on edge, like I can’t relax”), becoming easily fatigued by mid-afternoon, and having difficulty concentrating (“I reread the same spreadsheet line over and over”). She also reports irritability with family (“little things set me off, then I feel guilty”), chronic muscle tension (tight shoulders/jaw with frequent headaches), and sleep disturbance characterized by prolonged sleep onset and frequent nighttime awakenings due to worry. She denies episodes of abrupt surges of intense fear with palpitations or feeling she might die; instead she describes a steady, ongoing level of anxiety. She reports that her symptoms have caused clinically significant distress and impairment: decreased efficiency at work due to overchecking and procrastination, increased conflict at home, and reduced participation in enjoyable activities because she feels “too tense” to unwind.\n\nShe denies persistent depressed mood or loss of interest as the primary issue, though she feels frustrated and demoralized about her ongoing anxiety. She denies intrusive unwanted images or rituals/compulsions, denies trauma exposure with re-experiencing symptoms, and denies marked fear limited to social scrutiny or a single specific situation. No history of manic or hypomanic episodes. She denies current or past psychotic symptoms.\n\nMedical history is unremarkable; no thyroid disease or cardiopulmonary illness reported. She drinks 1–2 cups of coffee daily, denies stimulant or illicit substance use, and drinks alcohol socially (1–2 drinks on weekends) without escalation. She is not taking corticosteroids, decongestants, or other medications known to worsen anxiety. She denies suicidal or homicidal ideation. Mental status exam: well-groomed, cooperative, normal speech; mood “anxious,” affect tense and congruent; thought process linear but ruminative; no delusions or hallucinations; cognition grossly intact; insight and judgment fair. Overall presentation is consistent with chronic, excessive, difficult-to-control worry across domains with multiple associated somatic/cognitive symptoms and functional impairment, not attributable to substances, a medical condition, or another primary mental disorder.",
    "symptom_checklist": {
      "A_excessive_anxiety_worry_multiple_domains_more_days_than_not_6mo": "present",
      "B_difficulty_controlling_worry": "present",
      "C_restlessness_keyed_up_on_edge": "present",
      "C_easily_fatigued": "present",
      "C_difficulty_concentrating_mind_blank": "present",
      "C_irritability": "present",
      "C_muscle_tension": "present",
      "C_sleep_disturbance": "present",
      "D_clinically_significant_distress_or_impairment": "present",
      "E_not_substance_or_medical": "present",
      "F_not_better_explained_by_other_mental_disorder": "present",
      "panic_attacks_discrete_unexpected": "absent",
      "ocd_obsessions_compulsions_primary": "absent",
      "ptsd_trauma_reexperiencing_primary": "absent",
      "social_anxiety_fear_of_scrutiny_primary": "absent",
      "mania_hypomania_history": "absent"
    },
    "comorbid": false
  },
  {
    "id": "vig_20260102_103551_002_adhd",
    "ground_truth": "adhd",
    "difficulty": "AMBIGUOUS",
    "demographics": "29-year-old woman, works as a UX designer at a mid-sized tech company, lives with her partner, completed college with variable grades, no current substance use, drinks 1–2 coffees/day, occasional social alcohol.",
    "clinical_text": "Presenting for evaluation due to longstanding difficulties with attention, organization, and follow-through that have become more impairing after a recent promotion. She reports, “My brain is like ten tabs open—someone just turned the music up.” At work she misses details in design specs, overlooks comments in long email threads, and frequently starts tasks but does not finish them unless a deadline is imminent. She describes repeatedly re-reading the same paragraph, losing her place in meetings, and “zoning out” when colleagues talk for more than a few minutes. She compensates by taking extensive notes and using multiple reminder apps, though she forgets to check them. Performance reviews highlight strong creativity but inconsistent execution and late deliverables.\n\nShe also reports restlessness and impulsive behaviors. She fidgets constantly, taps her foot, and often stands during calls. She interrupts others, finishes people’s sentences, and speaks quickly when excited. She describes blurting out ideas in meetings and later thinking, “Why did I say that?” She makes impulsive online purchases “for the dopamine,” then feels guilt. Driving history includes several minor fender-benders and two speeding tickets; she notes she becomes distracted by billboards or her own thoughts. Sleep is variable; she goes to bed late due to “hyperfocusing on random stuff,” then struggles to wake on time.\n\nSymptoms are longstanding. She recalls elementary school teachers saying she was “bright but daydreamy” and that she talked too much. She frequently forgot homework at home, lost jackets and lunchboxes, and needed repeated reminders to start chores. Her parents describe her as chronically messy, with a “tornado room.” She reports that when she enjoyed a topic she could work intensely for hours, but for routine assignments she procrastinated until the last minute. She denies any period in childhood where these difficulties were absent.\n\nFunctional impairment is present across settings. At home she forgets to pay bills unless automated, leaves cabinets open, and starts cleaning one area then drifts to another. Her partner reports she seems not to listen when spoken to and will agree to plans but then forget details. She misplaces keys and phone daily and uses tracking devices. Socially, she maintains a small but stable friend group and describes herself as warm and outgoing, though others sometimes perceive her as “spacey” or “too intense.” She occasionally misses social cues when distracted (e.g., continuing to talk when someone looks bored), but when this is pointed out she readily understands and adjusts. She describes enjoying humor and sarcasm and can accurately infer others’ intentions in most situations.\n\nThe referral question includes concern about a neurodevelopmental social-communication condition because she prefers predictable routines and sometimes rehearses what to say before phone calls. On careful history, these features appear to be coping strategies for distractibility and anxiety about forgetting information rather than a lifelong inability to understand social reciprocity. Developmental history notes age-appropriate language, imaginative play, and reciprocal friendships in childhood. She reports enjoying group play and having “best friends” in multiple grades. There is no history of markedly restricted, repetitive motor movements, persistent insistence on sameness beyond typical preference, or highly circumscribed interests that dominate her life; rather, she cycles through hobbies intensely for weeks (e.g., knitting, gaming, sourdough) and then drops them. She denies significant sensory aversions or unusual sensory seeking beyond occasional overwhelm in very noisy settings, which she attributes to difficulty filtering background stimuli.\n\nMood and anxiety symptoms are described as secondary. She feels demoralized and intermittently anxious due to repeated mistakes and time pressure, stating, “I’m always catching up.” She denies sustained periods of elevated mood, decreased need for sleep, or grandiosity. No history of psychosis. She denies current suicidal ideation. Medical history is unremarkable; no thyroid disease, seizures, or head injury. Family history notable for a brother with longstanding academic disorganization and a father described as “always on the go.”\n\nMental status examination: well-groomed, cooperative, mildly restless in seat with frequent shifting. Speech normal volume, occasionally rapid. Mood “stressed,” affect reactive and congruent. Thought process mostly linear with occasional tangentiality when describing examples. No delusions or hallucinations. Cognition grossly intact; attention fluctuates during interview (requests repetition twice, loses track mid-sentence). Insight and judgment fair. Overall presentation suggests a chronic pattern of inattentiveness with restlessness/impulsivity beginning in childhood, occurring across multiple contexts, and causing clinically significant impairment; social difficulties appear better explained by distractibility, fast-paced speech, and compensatory scripting rather than a primary deficit in social reciprocity or restricted/repetitive behavioral patterns.",
    "symptom_checklist": {
      "IA1_careless_mistakes": "present",
      "IA2_difficulty_sustaining_attention": "present",
      "IA3_not_listen_when_spoken_to": "present",
      "IA4_not_follow_through": "present",
      "IA5_disorganized": "present",
      "IA6_avoids_sustained_effort": "present",
      "IA7_loses_things": "present",
      "IA8_easily_distracted": "present",
      "IA9_forgetful": "present",
      "HI1_fidgets": "present",
      "HI2_leaves_seat_restless": "present",
      "HI3_runs_about_restless_internal": "present",
      "HI4_unable_play_quietly": "absent",
      "HI5_on_the_go": "present",
      "HI6_talks_excessively": "present",
      "HI7_blurts_answers": "present",
      "HI8_difficulty_waiting_turn": "present",
      "HI9_interrupts_intrudes": "present",
      "onset_before_12": "present",
      "cross_setting": "present",
      "clinically_significant_impairment": "present",
      "better_explained_by_other_condition": "absent",
      "persistent_social_reciprocity_deficit": "absent",
      "restricted_repetitive_patterns": "absent"
    },
    "comorbid": false
  },
  {
    "id": "vig_20260102_103634_003_comorbid_ptsd_mdd",
    "ground_truth": [
      "ptsd",
      "mdd"
    ],
    "difficulty": "MODERATE",
    "demographics": "34-year-old woman, married, one child (age 6), employed as an emergency department nurse; lives in an urban area; no prior psychiatric hospitalizations; occasional alcohol use (1–2 drinks/month), denies illicit substances.",
    "clinical_text": "Ms. R is a 34-year-old emergency department nurse presenting for evaluation of persistent anxiety symptoms and low mood that began after a workplace incident 8 months ago. She reports that during a night shift, an armed individual entered the department and fired multiple shots; she was pinned behind a medication cart while hearing colleagues scream and seeing a coworker struck and later die. She states, “I thought I was going to die. I can still smell the disinfectant and hear the shots like it’s happening again.” She denies any history of similar traumatic events prior to this incident.\n\nSince the event, she describes recurrent, involuntary, distressing memories of the shooting occurring “out of nowhere,” especially when she hears loud noises or when a patient becomes agitated. She endorses recurrent nightmares 3–4 nights per week in which she relives being trapped and unable to reach her coworker. She reports several episodes at work and in public where she momentarily feels as if she is back in the trauma, stating, “For a second I’m not in the hallway—I’m there again,” accompanied by intense fear, palpitations, sweating, and trembling. She describes marked distress and physical reactivity when exposed to reminders (e.g., overhead announcements, security alarms, the smell of hospital disinfectant), often leading her to leave the area abruptly.\n\nShe reports persistent avoidance of trauma-related stimuli. She has requested reassignment away from the emergency department and avoids walking past the bay where the incident occurred. Outside work, she avoids news coverage of violence and refuses to attend crowded events; she states, “If I can’t see the exits, I can’t breathe.” She also avoids talking about the incident with family and coworkers, saying, “If I start, I’ll lose it,” and becomes tearful and visibly tense when asked for details.\n\nShe endorses ongoing negative changes in thoughts and mood since the event. She describes persistent guilt and self-blame (“I should have done something—if I’d moved faster, she might be alive”), and a more negative view of the world (“Now I just assume people will hurt you”). She reports diminished interest in previously enjoyable activities such as running and cooking, and she has withdrawn socially, declining invitations and spending most evenings isolated in her bedroom. She notes feeling emotionally numb at times—“I’m there, but I’m not really feeling anything”—alternating with irritability and sudden crying spells. She reports difficulty experiencing positive emotions, stating, “Even when my kid is laughing, it doesn’t reach me.”\n\nShe also describes persistent hyperarousal and reactivity: chronic hypervigilance (constantly scanning for danger), exaggerated startle response to sudden sounds, irritability with verbal outbursts (“I snap over nothing”), difficulty concentrating at work, and sleep disturbance. Sleep is fragmented; she lies awake for 1–2 hours due to feeling “on edge,” wakes from nightmares, and then checks doors and windows. She reports keeping a chair under the doorknob at night and repeatedly checking locks.\n\nIn addition to the above, over the past 3 months she reports a nearly daily depressed mood most of the day, describing herself as “empty” and “hopeless.” She notes a marked loss of interest and pleasure in most activities, including time with her family: “I’m going through the motions.” She endorses low energy nearly every day, feeling slowed down, and having difficulty initiating basic tasks such as showering and preparing meals. Her appetite has decreased, with an unintentional 10-pound weight loss over approximately 2 months. She reports impaired concentration and indecisiveness (“I read the same chart note three times and still can’t process it”), which has led to increased errors at work and a formal performance warning. She expresses feelings of worthlessness and excessive guilt that extend beyond the trauma (“I’m a burden; my family would be better off without me”).\n\nShe reports passive thoughts of death occurring several times per week, such as “I wish I wouldn’t wake up,” and occasional thoughts that “it would be easier to disappear,” but denies a specific plan or intent. She identifies her child as a major protective factor and states she would seek help if urges increased. She denies any history of suicide attempts or self-injury.\n\nShe denies lifetime episodes of abnormally elevated or expansive mood, decreased need for sleep with increased energy, grandiosity, pressured speech, or risk-taking behaviors. She denies hallucinations or fixed delusional beliefs. She reports occasional alcohol use without bingeing and denies substance misuse. Medical history is notable only for mild asthma; she takes an as-needed inhaler and no psychoactive medications. She reports significant functional impairment: she has reduced work hours, has limited engagement with family activities, avoids leaving the house except for necessities, and reports strained marital communication due to irritability and emotional withdrawal.\n\nMental status examination: Appearance tired with dark circles; behavior guarded but cooperative. Speech normal rate/volume. Mood “numb and sad”; affect constricted, tearful when discussing workplace triggers. Thought process linear; thought content notable for guilt, hopelessness, and passive death wishes without plan or intent. No perceptual disturbances observed. Cognition grossly intact but with reported concentration difficulties. Insight fair; judgment intact. Symptoms have been present for months and are not attributable to substances or another medical condition, and they cause clinically significant distress and impairment in occupational and social functioning.",
    "symptom_checklist": {
      "PTSD_A_exposure_to_trauma": "present",
      "PTSD_B_intrusion_memories": "present",
      "PTSD_B_nightmares": "present",
      "PTSD_B_dissociative_reactions": "present",
      "PTSD_B_distress_at_cues": "present",
      "PTSD_B_physiologic_reactivity": "present",
      "PTSD_C_avoidance_memories": "present",
      "PTSD_C_avoidance_external_reminders": "present",
      "PTSD_D_negative_beliefs": "present",
      "PTSD_D_self_blame_guilt": "present",
      "PTSD_D_diminished_interest": "present",
      "PTSD_D_detachment": "present",
      "PTSD_D_inability_positive_emotions": "present",
      "PTSD_E_irritability": "present",
      "PTSD_E_hypervigilance": "present",
      "PTSD_E_exaggerated_startle": "present",
      "PTSD_E_concentration_problems": "present",
      "PTSD_E_sleep_disturbance": "present",
      "PTSD_duration_over_1_month": "present",
      "PTSD_distress_impairment": "present",
      "MDD_depressed_mood": "present",
      "MDD_anhedonia": "present",
      "MDD_weight_loss_or_appetite_decrease": "present",
      "MDD_insomnia": "present",
      "MDD_psychomotor_retardation": "present",
      "MDD_fatigue": "present",
      "MDD_worthlessness_or_excessive_guilt": "present",
      "MDD_concentration_difficulty": "present",
      "MDD_suicidal_ideation_passive": "present",
      "MDD_duration_over_2_weeks": "present",
      "MDD_distress_impairment": "present",
      "mania_history": "absent",
      "substance_induced": "absent"
    },
    "comorbid": true
  },
  {
    "id": "vig_20260102_103711_004_comorbid_adhd_mdd",
    "ground_truth": [
      "adhd",
      "mdd"
    ],
    "difficulty": "CLEAR",
    "demographics": "29-year-old woman, employed full-time as a marketing coordinator at a mid-sized tech company; lives with a roommate; college graduate; no current substance use (rare alcohol, denies cannabis/illicit drugs); medical history unremarkable; family history notable for a father described as chronically disorganized and impulsive and a maternal aunt with recurrent depressive episodes.",
    "clinical_text": "The patient presents for evaluation due to worsening mood and marked functional decline over the past 6–7 weeks, on a background of lifelong problems with attention and organization. She reports feeling \"down most of the day, nearly every day\" and states, \"I don’t care about anything right now—things I usually like just feel flat.\" She has stopped going to the gym and has withdrawn from friends because she \"can’t muster the energy\" and feels \"like I’m failing at everything.\" She describes prominent fatigue, slowed morning routine, and needing significantly more effort to complete basic tasks. Sleep is disrupted with early-morning awakening 2–3 hours before her alarm, after which she ruminates about work mistakes and finances. Appetite has decreased with an unintended 8-lb weight loss in about a month. She endorses impaired concentration that is worse than her usual baseline and says she reads the same email repeatedly \"and it still doesn’t stick.\" She reports excessive self-criticism and guilt, stating, \"I’m letting my team down\" and \"they’d be better off without me.\" She endorses passive thoughts of death several times per week (\"I wish I wouldn’t wake up\"), denies intent or plan, and identifies protective factors including her mother and a close friend; she denies access to firearms. She denies any lifetime periods of abnormally elevated or expansive mood, decreased need for sleep with high energy, grandiosity, or episodes of unusually increased goal-directed activity.\n\nIn addition to the recent mood episode, she describes chronic symptoms dating back to childhood. She recalls that in elementary school she was \"always daydreaming\" and frequently forgot homework, lost pencils and notebooks, and needed repeated reminders to finish chores. Report cards reportedly noted that she was bright but \"not working up to potential\" and \"talks too much\"; she remembers being sent to the hallway for blurting out answers. Her mother corroborates a long-standing pattern of disorganization and forgetfulness. She reports that these difficulties continued through high school and college: she procrastinated until deadlines, pulled frequent all-nighters, missed steps in long assignments, and relied on friends to keep track of schedules. She describes current work impairment across settings (work, home, social): she often makes careless errors in spreadsheets and ad copy, misses details, and has difficulty sustaining attention in meetings longer than 10–15 minutes unless highly interested. She states, \"My mind jumps to ten things at once,\" and she frequently starts tasks but does not finish them, leaving projects \"80% done\" and scrambling at the last minute. She has significant difficulty organizing tasks, prioritizing, and managing time; she often underestimates how long tasks take and has received feedback that she is unreliable with deadlines. She avoids tasks requiring sustained mental effort (e.g., expense reports, long documentation) and procrastinates until consequences are imminent. She is often easily distracted by Slack notifications and ambient office noise, and at home she starts cleaning, then switches to checking email, then forgets the original task. She frequently misplaces her badge, keys, and phone and uses tracking devices to find them. She is forgetful in daily activities, including missing bill payments and forgetting to return messages.\n\nShe also endorses a long-standing pattern of restlessness and impulsivity. She reports feeling \"on edge\" and fidgeting, tapping her foot, and needing to stand during meetings. She finds it difficult to relax and describes talking excessively when anxious, occasionally interrupting others and finishing their sentences. She reports impulsive spending on small online purchases \"without thinking\" and occasional impatience while driving, though she denies accidents. These patterns were present before the recent mood change and have occurred across multiple environments since childhood.\n\nShe notes that the recent mood decline has amplified her baseline organizational problems: missed deadlines and errors have increased, which in turn intensifies guilt and hopelessness. She denies panic attacks, psychotic symptoms, restrictive eating behaviors, or recent bereavement. She is not taking any psychoactive medications and denies recent steroid use or other substances that could account for symptoms. Overall, the presentation reflects a current severe mood episode with significant neurovegetative changes and suicidality, superimposed on a persistent developmental pattern of inattention and executive dysfunction with associated restlessness and impulsivity causing impairment across school/work and home settings.",
    "symptom_checklist": {
      "ADHD_INATTENTION_CARELESS_MISTAKES": "present",
      "ADHD_INATTENTION_SUSTAIN_ATTENTION": "present",
      "ADHD_INATTENTION_LISTENING": "present",
      "ADHD_INATTENTION_FOLLOW_THROUGH": "present",
      "ADHD_INATTENTION_ORGANIZATION": "present",
      "ADHD_INATTENTION_AVOIDS_SUSTAINED_EFFORT": "present",
      "ADHD_INATTENTION_LOSES_THINGS": "present",
      "ADHD_INATTENTION_DISTRACTIBLE": "present",
      "ADHD_INATTENTION_FORGETFUL": "present",
      "ADHD_HI_FIDGET_RESTLESS": "present",
      "ADHD_HI_TALKS_EXCESSIVELY": "present",
      "ADHD_HI_INTERRUPTS_INTRUDES": "present",
      "ADHD_HI_IMPATIENCE_IMPULSIVE": "present",
      "ADHD_ONSET_BEFORE_12": "present",
      "ADHD_TWO_OR_MORE_SETTINGS": "present",
      "ADHD_FUNCTIONAL_IMPAIRMENT": "present",
      "MDD_DEPRESSED_MOOD": "present",
      "MDD_ANHEDONIA": "present",
      "MDD_WEIGHT_APPETITE_CHANGE": "present",
      "MDD_SLEEP_DISTURBANCE": "present",
      "MDD_PSYCHOMOTOR_CHANGE": "present",
      "MDD_FATIGUE": "present",
      "MDD_WORTHLESSNESS_GUILT": "present",
      "MDD_CONCENTRATION_DIFFICULTY": "present",
      "MDD_SUICIDAL_IDEATION": "present",
      "MDD_DURATION_2WEEKS": "present",
      "MDD_NO_MANIA_HYPOMANIA_HISTORY": "present",
      "MDD_DISTRESS_IMPAIRMENT": "present"
    },
    "comorbid": true
  }
]