[
  {
    "id": "vig_3244_0_mdd",
    "ground_truth": "mdd",
    "difficulty": "MODERATE",
    "demographics": "34-year-old woman, middle-school teacher, married, two children (ages 6 and 3), lives with spouse and children; no military history; no current legal issues.",
    "clinical_text": "Chief concern: \"I feel like I’m running on fumes and I can’t enjoy anything anymore.\"\n\nHistory of present illness: The patient is a 34-year-old middle-school teacher who presents for evaluation of persistent low mood and loss of interest that began about 7–8 weeks ago after a change in school administration and increased workload. She reports feeling \"down, heavy, and numb\" most days, \"from the moment I wake up,\" with notable irritability: \"I snap at my kids over nothing and then I hate myself for it.\" She describes markedly diminished interest in activities she previously enjoyed (reading novels, cooking, weekend outings): \"I used to look forward to Saturdays—now I just want to stay in bed.\" She endorses fatigue nearly every day and says routine tasks feel overwhelming: \"I’m dragging myself through the day.\"\n\nSleep/appetite: She reports early-morning awakening (waking around 3–4 a.m. and unable to fall back asleep) on most nights and unrefreshing sleep. Appetite has decreased with an unintentional 8–10 lb weight loss over ~2 months: \"Food tastes like cardboard; I forget to eat.\" She denies intentional dieting.\n\nCognition/psychomotor: She reports impaired concentration and indecisiveness at work: \"I read the same email three times and still can’t process it.\" She has received feedback that she seems \"slower\" and less engaged in meetings. On interview she appears mildly slowed with reduced spontaneous speech, though she is cooperative and fully oriented.\n\nGuilt/worthlessness: She endorses excessive guilt and feelings of worthlessness: \"I’m a bad mom and a bad teacher. Everyone would be better off without me.\" She ruminates at night about mistakes and perceives herself as \"a burden\" to her spouse.\n\nSuicidality: She reports intermittent passive thoughts of death over the past 2–3 weeks: \"Sometimes I think it would be easier not to wake up.\" She denies a current plan or intent and denies preparatory behaviors. She denies past suicide attempts or self-injury. Protective factors include strong attachment to her children and willingness to seek help. She agrees to seek emergency support if thoughts intensify.\n\nAnxiety/somatic features (non-standard/mild comorbidity): She reports increased muscle tension, headaches, and two brief episodes in the last month of sudden intense anxiety with palpitations and shortness of breath lasting about 10 minutes, occurring while driving to work; she worried she was \"having a heart problem\" but symptoms resolved spontaneously. She now feels anticipatory worry before commuting but continues to drive. She denies avoidance of leaving home or fear of multiple settings.\n\nFunctioning: Symptoms have caused clinically significant impairment. She has used four sick days in the last month, is behind on grading, and reports reduced patience with students. At home she has withdrawn socially, turning down invitations and spending evenings on the couch. Her spouse reports she is \"not herself\" and less emotionally responsive.\n\nPast psychiatric history: No prior psychiatric hospitalizations. She recalls a shorter period of low mood in college that resolved without treatment. No history of elevated/expansive mood, decreased need for sleep with high energy, increased goal-directed activity, grandiosity, pressured speech, or risky behavior suggestive of manic/hypomanic episodes.\n\nMedical history/medications: Generally healthy. No thyroid disease history. Denies recent infection, pregnancy, or postpartum state. Takes an occasional ibuprofen for headaches. No corticosteroid use. No known medication allergies.\n\nSubstance use: Drinks wine \"most nights,\" typically 1–2 glasses; on two weekends in the last month she had 3–4 drinks at social events. Denies morning drinking, blackouts, withdrawal symptoms, or occupational consequences. Denies tobacco, cannabis, or other substances. Caffeine 2–3 coffees/day.\n\nFamily history: Mother with history of recurrent episodes of low mood treated with antidepressants. Maternal uncle with alcohol-related problems. No known family history of bipolar disorder or psychotic disorders.\n\nMental status exam (summary): Appearance appropriate, mildly disheveled; behavior cooperative; psychomotor mild retardation; speech soft, slowed; mood \"exhausted and sad\"; affect constricted; thought process linear; thought content notable for guilt and passive death wishes without plan/intent; no delusions; no hallucinations; cognition intact to orientation; attention mildly impaired; insight and judgment fair.\n\nAssessment considerations: Symptoms have persisted >2 weeks with depressed mood and markedly diminished interest plus neurovegetative changes (sleep, appetite/weight), fatigue, impaired concentration, psychomotor slowing, excessive guilt/worthlessness, and passive suicidal ideation, causing significant impairment. No evidence of a manic/hypomanic episode. Symptoms are not better explained by substance intoxication/withdrawal or a medical condition based on current history, though basic labs (e.g., TSH, CBC) are planned to rule out contributory medical causes.",
    "symptom_checklist": {
      "depressed_mood_most_of_day_nearly_every_day": "present",
      "markedly_diminished_interest_or_pleasure": "present",
      "significant_weight_loss_or_decreased_appetite": "present",
      "insomnia_or_hypersomnia": "present",
      "psychomotor_retardation_or_agitation_observable": "present",
      "fatigue_or_loss_of_energy": "present",
      "feelings_of_worthlessness_or_excessive_guilt": "present",
      "diminished_ability_to_think_or_concentrate_indecisiveness": "present",
      "recurrent_thoughts_of_death_or_suicidal_ideation": "present",
      "clinically_significant_distress_or_impairment": "present",
      "manic_or_hypomanic_episode_history": "absent",
      "substance_induced_or_medical_condition_primary_cause": "absent",
      "psychotic_features": "absent",
      "panic_attack_like_episodes": "present"
    }
  },
  {
    "id": "vig_3315_1_gad",
    "ground_truth": "gad",
    "difficulty": "AMBIGUOUS",
    "demographics": "29-year-old woman, works as a project coordinator at a mid-size marketing firm; lives with partner; college educated; no children.",
    "clinical_text": "Chief concern: \"My mind doesn't shut off—I'm always bracing for something to go wrong.\"\n\nHistory of present illness: The patient presents for evaluation of persistent, excessive worry that has been present most days for approximately 10–11 months. She describes pervasive anxious anticipation across multiple domains, including work deadlines, finances, her partner’s health, and minor day-to-day matters (e.g., \"If I don’t answer an email fast enough, I’ll get fired,\" \"If my partner is quiet, I assume something terrible happened,\" \"I keep replaying whether I said something weird in a meeting\"). She reports she spends \"hours\" mentally reviewing possible outcomes and contingency plans and states she has difficulty controlling the worry: \"I tell myself to stop, but it just pops back in—like a browser with 30 tabs open.\"\n\nAssociated symptoms include feeling keyed up and restless (\"I’m on edge, like my shoulders are up by my ears\"), easy fatigability by mid-afternoon, irritability (\"I snap over small things and then feel guilty\"), muscle tension in the neck/jaw with frequent jaw clenching, and sleep disturbance characterized by difficulty falling asleep due to rumination and frequent nocturnal awakenings to \"check the clock\" and mentally rehearse the next day. She endorses difficulty concentrating at work, describing that during tasks she \"keeps drifting\" into worry-related thoughts. She reports this has led to reduced efficiency, increased time to complete tasks, and avoidance/procrastination with certain emails or reports because she worries they will be \"wrong\" or lead to criticism.\n\nDiagnostic ambiguity / overlapping attentional complaints: She wonders if she might have an attention disorder because she has been \"forgetting little things,\" misplacing her badge, and struggling to stay focused in meetings. On detailed review, she notes that concentration problems are worst when she is worrying, and she can sustain attention when calm or when tasks are highly structured with clear expectations. She denies longstanding symptoms beginning in childhood: she reports strong academic performance in grade school and college, no history of teacher concerns about inattention or hyperactivity, no childhood behavioral problems, and no pattern of chronic disorganization across settings prior to the past year. She describes herself historically as \"a planner\" who was \"very on top of deadlines\" until anxiety escalated over the last year after a major reorganization at work and increased responsibility.\n\nCourse and triggers: Symptoms intensified following workplace restructuring, with increased workload ambiguity and fear of performance evaluation. She also reports heightened worry after her father’s recent hospitalization (now resolved), stating, \"Ever since then, I keep imagining the worst.\" Despite reassurance and objective evidence of good work performance, she continues to anticipate negative outcomes.\n\nFunctional impact: She reports significant distress and impairment: spending evenings worrying rather than engaging in leisure activities, decreased productivity at work, tension in her relationship due to irritability and reassurance seeking (\"I keep asking if we’re okay\"), and occasional avoidance of social plans because she feels mentally exhausted.\n\nSafety and other psychiatric review: She denies current or past manic/hypomanic episodes (no periods of abnormally elevated/expansive mood, decreased need for sleep, or risky behavior). She denies panic attacks with abrupt surges of intense fear; instead she describes a steady, persistent anxious state. She denies intrusive unwanted images or ritualized compulsions; she does endorse checking her calendar and email repeatedly, which she attributes to fear of missing something and difficulty tolerating uncertainty rather than repetitive rituals with a sense of magical prevention. She denies trauma-related flashbacks or nightmares. She denies depressive episode symptoms as primary; she acknowledges low enjoyment \"because I’m worried\" but denies pervasive low mood, anhedonia most of the day, nearly every day for weeks, or suicidal ideation. She denies psychotic symptoms.\n\nSubstance/medical: She drinks 1–2 cups of coffee in the morning, no energy drinks; reports that higher caffeine worsens jitteriness, so she limits intake. Alcohol 0–2 drinks/week, denies cannabis or other substances. No stimulant use. No recent medication changes. Medical history notable for episodic tension headaches; no known thyroid disease. She reports a recent physical exam with normal basic labs per patient (no documentation available). No weight loss, heat intolerance, or tremor reported.\n\nDevelopmental/ADHD-specific history: She reports being \"organized\" as a child, able to complete homework without significant supervision, and not described as fidgety or disruptive. She denies a lifelong pattern of losing items, chronic lateness, or frequent careless mistakes beginning before adolescence. She does report perfectionistic tendencies and fear of disappointing others emerging more prominently in late adolescence and worsening in the past year.\n\nMental status exam (abbreviated): Well-groomed, cooperative. Psychomotor mildly tense; no hyperactivity observed. Speech normal rate/volume. Mood \"stressed\"; affect anxious, congruent. Thought process linear but ruminative. Thought content notable for excessive worry and catastrophic predictions; no delusions. Cognition grossly intact; attention mildly impaired during the interview when discussing stressors, with frequent self-referential worry. Insight fair; judgment intact.\n\nClinical impression: Presentation is characterized by persistent, excessive anxiety and worry occurring most days for ~10–11 months across multiple areas, difficult to control, with associated restlessness, fatigue, concentration difficulty, irritability, muscle tension, and sleep disturbance, causing clinically significant impairment. Attentional complaints appear secondary to pervasive worry and sleep disruption with adult onset and without evidence of childhood-onset, cross-situational symptoms required for a primary attention disorder.",
    "symptom_checklist": {
      "gad_excessive_worry_multiple_domains_6plus_months": "present",
      "gad_difficulty_controlling_worry": "present",
      "gad_restlessness_keyed_up": "present",
      "gad_fatigue": "present",
      "gad_concentration_difficulty_mind_going_blank": "present",
      "gad_irritability": "present",
      "gad_muscle_tension": "present",
      "gad_sleep_disturbance": "present",
      "gad_clinically_significant_distress_or_impairment": "present",
      "substance_or_medical_cause": "absent",
      "better_explained_by_panic_disorder": "absent",
      "better_explained_by_ocd": "absent",
      "better_explained_by_ptsd": "absent",
      "better_explained_by_depressive_disorder_primary": "absent",
      "adhd_childhood_onset_symptoms": "absent",
      "adhd_cross_situational_persistent_inattention": "absent",
      "adhd_hyperactivity_impulsivity": "absent",
      "attention_problems_secondary_to_worry_and_sleep": "present"
    }
  },
  {
    "id": "vig_3349_2_adhd",
    "ground_truth": "adhd",
    "difficulty": "MODERATE",
    "demographics": "29-year-old woman; works as a project coordinator at a mid-sized marketing firm; lives with partner; completed college; no children; drives; drinks 1–2 alcoholic drinks/week; no tobacco; occasional cannabis edible (1–2x/month).",
    "clinical_text": "Chief concern: “My brain feels like a web browser with 30 tabs open, and I can’t keep the right one in front.”\n\nHistory of present illness: The patient presents for evaluation of chronic difficulties with sustained attention, organization, and time management that have become more impairing after a recent promotion requiring more self-directed work. She reports frequent missed details and inconsistent follow-through despite strong intent: “I’ll read an email, think I responded, then realize two days later I never hit send.” She describes starting multiple tasks and shifting between them, often leaving projects half-completed until deadlines are imminent. She notes she relies on “panic mode” to finish work and then feels exhausted and embarrassed.\n\nInattention-related symptoms described: She reports (1) frequent careless mistakes (incorrect attachments, mis-typed dates, overlooked line items), (2) difficulty sustaining focus during meetings unless she is actively taking notes, (3) appearing not to listen when spoken to—partner says she “zones out” mid-conversation, (4) failure to follow through on instructions and routine administrative tasks (expense reports, calendar invites), (5) disorganization (cluttered desk, multiple unsorted to-do lists, trouble breaking projects into steps), (6) avoidance of tasks requiring sustained mental effort (e.g., budgeting, long reports), (7) losing items (badge, keys, earbuds; uses tracking tags but still misplaces them), (8) distractibility by external stimuli and internal thoughts (“If Slack pings, I’m gone”), and (9) forgetfulness in daily activities (missed appointments unless reminded; late bill payments).\n\nHyperactivity/impulsivity-related symptoms described: She denies feeling “physically hyper” most of the day but endorses restlessness (shifts position, fidgets with pens, taps foot), difficulty staying seated through long meetings, and frequent interrupting in conversations when excited: “If I don’t say it right away, I’ll lose it.” She also describes occasional impulsive online purchases (“little dopamine buys”) but without major financial harm.\n\nCourse and age of onset: She reports these patterns began in childhood. She recalls elementary school teachers writing comments such as “bright but daydreams,” “forgets homework,” and “talks too much with friends.” Her mother reportedly had to pack her backpack nightly and bring forgotten items to school. She states she often completed assignments at the last minute and relied on high test performance to compensate. She denies any period of sustained symptom remission. Symptoms are present in multiple settings: work (missed deadlines, performance feedback for “inconsistency” and “not following through”), home (unfinished chores, forgotten plans, conflict with partner about not listening), and driving (missed exits; distracted by thoughts though no accidents).\n\nFunctional impact: At work, she has received a formal warning after missing a client deliverable and forgetting to add a meeting time-zone conversion, resulting in a no-show. She reports spending evenings “trying to catch up” but becoming overwhelmed and then procrastinating. At home, she describes chronic clutter, difficulty maintaining routines, and arguments with her partner who feels “unheard.” She reports low self-esteem tied to perceived underachievement: “I feel lazy, but I’m actually trying all the time.”\n\nAssociated features / mild comorbidity: She reports chronic sleep-onset difficulty (mind racing, late-night scrolling) and variable sleep schedule; she often feels tired in the mornings. She endorses intermittent anxiety secondary to performance concerns (“I worry I’ll mess up again”), but denies persistent excessive worry across most domains. She denies panic attacks. Mood is described as “frustrated and ashamed,” with no sustained depressive episode symptoms; appetite stable. She denies suicidal ideation, self-harm, or history of mania/hypomania. No psychotic symptoms.\n\nSubstance and medical history: Caffeine 2–3 cups of coffee/day; notes it sometimes “helps me focus.” Rare cannabis edible use; denies other substances. No history of traumatic brain injury or seizures. No known thyroid disease. Medications: none. Allergies: none.\n\nFamily/developmental history: Father described as “very distractible” and chronically late; no formal diagnoses known. No developmental delays reported; met early milestones. Academic history notable for strong standardized test scores but chronic missing assignments and “messy” work.\n\nMental status exam: Well-groomed, cooperative, mildly restless in chair with frequent fidgeting. Speech normal rate/volume; occasionally tangential but redirectable. Mood “stressed”; affect mildly anxious, congruent. Thought process generally linear with occasional topic shifts. No delusions or hallucinations. Cognition grossly intact; attention during interview variable—asks for questions to be repeated once and checks phone impulsively but puts it away when asked. Insight and judgment fair.\n\nRisk assessment: Denies suicidal or homicidal ideation. No acute safety concerns.\n\nClinical impression (descriptive): Longstanding, pervasive pattern of attentional dysregulation and executive function difficulties beginning in childhood, persisting into adulthood, impairing occupational and relational functioning, with mild situational anxiety and sleep dysregulation likely exacerbating symptom severity. No evidence of a primary mood, psychotic, or substance-induced disorder accounting for the presentation.",
    "symptom_checklist": {
      "IA1_careless_mistakes": "present",
      "IA2_difficulty_sustaining_attention": "present",
      "IA3_seems_not_listen": "present",
      "IA4_fails_follow_through": "present",
      "IA5_disorganized": "present",
      "IA6_avoids_sustained_effort": "present",
      "IA7_loses_things": "present",
      "IA8_easily_distracted": "present",
      "IA9_forgetful": "present",
      "HI1_fidgets": "present",
      "HI2_leaves_seat": "absent",
      "HI3_restless": "present",
      "HI4_unable_play_quietly": "absent",
      "HI5_on_the_go": "absent",
      "HI6_talks_excessively": "absent",
      "HI7_blurts_out": "present",
      "HI8_difficulty_waiting_turn": "absent",
      "HI9_interrupts_intrudes": "present",
      "onset_before_12": "present",
      "impairment_two_or_more_settings": "present",
      "clinically_significant_impairment": "present",
      "sleep_onset_insomnia_mild": "present",
      "situational_performance_anxiety_mild": "present",
      "substance_induced_explanation": "absent",
      "bipolar_manic_history": "absent",
      "psychosis_history": "absent"
    }
  },
  {
    "id": "vig_3410_3_ptsd",
    "ground_truth": "ptsd",
    "difficulty": "CLEAR",
    "demographics": "34-year-old woman; registered nurse working in an urban emergency department; divorced; lives alone; no prior psychiatric history; no substance use disorder history.",
    "clinical_text": "Ms. A is a 34-year-old emergency department nurse referred by occupational health for persistent trauma-related symptoms following a workplace event 7 months ago. She reports that during a mass-casualty incident in the ED, she provided direct care to multiple severely injured patients and performed prolonged resuscitation efforts on a young adult who died despite intervention. She describes witnessing extensive blood and injuries and hearing family members screaming nearby. She states, “I can still see his face and the monitors flatlining—like it’s happening again.”\n\nSince the incident, she endorses recurrent, involuntary, and intrusive distressing memories occurring “almost every day,” often triggered by ambulance sirens, the smell of antiseptic, or the sound of monitor alarms. She reports distressing dreams 2–3 nights per week in which she is “back in that room” and wakes “soaked in sweat.” She describes episodes at work where, for several seconds, she feels as if she is reliving the event: “I freeze and I’m not in the present—I’m there again.” During these episodes she experiences intense anxiety, palpitations, and shaking. She reports marked physiologic reactivity to reminders (tachycardia, nausea, trembling) and intense psychological distress when confronted with cues such as certain trauma-bay rooms or trauma pages.\n\nShe actively avoids reminders. She has refused to work in the trauma bay, asks coworkers to take trauma activations, and has called out sick when assigned to critical care shifts. She also avoids internal reminders, stating, “If I start thinking about it, I shut it down. I keep myself busy so I don’t have to feel it.” She avoids watching medical dramas or news stories about accidents and will change the channel immediately.\n\nShe reports a persistent negative emotional state with frequent fear and guilt. She says, “I know it wasn’t my fault, but I keep thinking I should’ve done something different,” and describes persistent self-blame thoughts about the patient’s death. She reports diminished interest in previously enjoyable activities (stopped running with friends and declined social invitations), feeling detached from others (“I’m numb around people; I don’t feel connected”), and difficulty experiencing positive emotions (“Even when something good happens, I feel flat”). She also notes worsening irritability and a “short fuse” at work and at home.\n\nArousal symptoms include hypervigilance (“I’m scanning for danger all the time”), an exaggerated startle response to sudden noises, sleep disturbance (difficulty falling asleep and frequent awakenings), and impaired concentration (“I reread chart notes over and over”). She reports being more “on edge” in crowds and sits facing exits in restaurants. She denies panic attacks outside of trauma reminders.\n\nSymptoms have been present continuously for more than 6 months and have led to significant functional impairment: she has received a written warning for missed shifts, is considering leaving the ED, and reports social withdrawal and conflict with family due to irritability. She denies current or past manic episodes, psychotic symptoms, or obsessive-compulsive symptoms. She denies suicidal ideation, intent, or plan. She drinks alcohol rarely (1–2 drinks/month) and denies illicit drug use. She is not taking corticosteroids or other medications associated with mood or sleep changes. Medical review is unremarkable. She states, “I want my life back, but my body reacts like it’s still happening.”",
    "symptom_checklist": {
      "criterion_A_trauma_exposure": "present",
      "intrusive_memories": "present",
      "distressing_dreams": "present",
      "dissociative_reactions_flashbacks": "present",
      "psychological_distress_at_cues": "present",
      "physiological_reactivity_at_cues": "present",
      "avoidance_external_reminders": "present",
      "avoidance_internal_reminders": "present",
      "negative_beliefs_or_self_blame": "present",
      "persistent_negative_emotional_state": "present",
      "diminished_interest": "present",
      "detachment_or_estrangement": "present",
      "inability_to_experience_positive_emotions": "present",
      "irritability_or_angry_outbursts": "present",
      "hypervigilance": "present",
      "exaggerated_startle": "present",
      "concentration_problems": "present",
      "sleep_disturbance": "present",
      "duration_more_than_1_month": "present",
      "clinically_significant_distress_or_impairment": "present",
      "not_due_to_substance_or_medical_condition": "present"
    }
  },
  {
    "id": "vig_3442_4_asd",
    "ground_truth": "asd",
    "difficulty": "AMBIGUOUS",
    "demographics": "29-year-old woman, software QA analyst at a mid-sized tech company; lives alone; never married; limited social network; no substance use; completed college with strong grades; no history of intellectual disability; family history notable for an uncle described as 'socially odd' and highly detail-focused.",
    "clinical_text": "Chief concern: \"My manager thinks I'm depressed because I'm quiet and avoid people, but I just don't know how to do the social stuff. I'm exhausted.\" \n\nHistory of present presentation: The patient presents at the request of occupational health after repeated workplace conflicts and increased avoidance of team interactions. Coworkers have described her as \"withdrawn\" and \"emotionless\" during meetings. She reports feeling chronically overwhelmed by open-plan office noise, sudden schedule changes, and unstructured group discussions. Over the past 2–3 months, after a departmental reorganization requiring more cross-team meetings, she has been eating lunch alone more often and requesting to work from home. She denies a persistent sad mood and denies pervasive loss of interest: \"I still look forward to my projects and my hobbies. When I get to work on test scripts or sort my collections, I feel calm.\" She endorses fatigue after social demands and states she can appear \"flat\" because she is concentrating on \"saying the right thing.\" She denies hopelessness and denies suicidal ideation, intent, or plan. \n\nMood/anxiety features that raise diagnostic questions: She reports intermittent low energy and reduced appetite on days with prolonged meetings, but notes appetite is normal on routine days and improves on weekends. Sleep is variable; she describes difficulty falling asleep when her routine changes, with repetitive reviewing of conversations: \"I replay what I said and whether it sounded wrong.\" She describes these symptoms as situational and strongly linked to social overstimulation rather than a sustained depressive episode. She reports that pleasure and motivation remain intact for preferred activities (e.g., cataloging and photographing transit maps, building spreadsheets, completing gaming achievements) and that her mood improves quickly when she can return to predictable routines. She does not describe a 2-week period of nearly daily depressed mood or markedly diminished interest/pleasure across most activities. \n\nDevelopmental history: The patient describes longstanding differences beginning in early childhood. Her mother (available by phone collateral) reports she was \"a very serious toddler\" who played for long periods lining up toy animals \"by size and color\" and became very upset if moved. She spoke in full sentences early but was described as \"little professor\" in tone, with advanced vocabulary and a tendency to correct adults. She had few friends and preferred solitary activities; she struggled with pretend play with peers and would instead recite facts about topics of interest. In elementary school she was described as \"gifted but rigid,\" with distress when classroom routines changed. She reports lifelong difficulty understanding implicit social rules: \"I can do scripts, but I don't naturally get what people mean.\" She reports frequent misunderstandings of sarcasm and indirect requests unless explicitly stated. \n\nSocial communication/interaction: In interview, she is cooperative but shows limited spontaneous reciprocity; answers are highly detailed and sometimes tangential, returning repeatedly to specific examples. Eye contact is intermittent and appears effortful; she states, \"If I look at your eyes too long I can't process what you're saying.\" She reports difficulty initiating and maintaining friendships, describing relationships as \"transactional\" and based on shared activities rather than emotional sharing. She expresses confusion about others' expectations: \"People say 'let's grab coffee' but they don't set a time. I don't know if they mean it.\" She reports challenges interpreting facial expressions and tone, relying on explicit statements. She describes masking strategies learned over time (memorizing phrases, mirroring gestures), which she finds exhausting and leading to \"shutdowns\" after prolonged social demands. \n\nRestricted/repetitive patterns and sensory features: She reports intense, circumscribed interests since childhood, currently focused on public transit systems and software defect taxonomies, spending hours organizing information and feeling \"soothed\" by categorization. She describes adherence to routines (same breakfast, same commute route) and significant distress with unexpected changes: \"If a meeting moves by 15 minutes, my whole plan collapses.\" She reports repetitive behaviors when anxious, including finger tapping in patterns and rubbing fabric seams; she tries to conceal these at work. Sensory sensitivities are prominent: she is distressed by fluorescent lights, overlapping conversations, and certain fabric textures, and carries noise-canceling headphones. She reports occasional \"meltdowns\" at home after high-demand days, characterized by crying, pacing, and needing a dark quiet room; she denies self-harm and describes these as episodes of overload rather than sadness. \n\nFunctioning and impairment: She maintains independent living and strong performance on solitary, structured tasks, but has persistent impairment in social-communication demands at work and in forming supportive relationships. She has received prior feedback that she is \"too blunt\" and \"doesn't read the room.\" She reports prior employment changes due to interpersonal conflicts rather than performance deficits. \n\nPsychiatric history: No prior psychiatric hospitalizations. She reports being told she had \"social anxiety\" in college; she attended brief counseling focused on interview skills. She denies history of manic/hypomanic symptoms. She denies panic attacks but endorses anticipatory worry about ambiguous social situations. No history of psychosis. \n\nMedical history/medications: No major medical illness reported. Not currently taking psychotropic medication. \n\nSubstance use: Denies alcohol, cannabis, or other substances. \n\nMental status examination (abbreviated): Appearance neat, casual; behavior cooperative with mild motor fidgeting; speech fluent, slightly formal with occasional pedantic phrasing; mood \"stressed\"; affect constricted but congruent; thought process linear with detail-heavy digressions; thought content without delusions; perception normal; cognition grossly intact; insight partial (recognizes differences but attributes some conflicts to others being \"illogical\"); judgment fair. \n\nRisk: Denies suicidal or homicidal ideation. No access to firearms. \n\nClinical formulation note: Presentation includes lifelong, developmentally anchored difficulties with social reciprocity and pragmatic communication, restricted interests, insistence on sameness, sensory sensitivities, and repetitive self-soothing behaviors causing functional impairment. While she reports fatigue, reduced appetite, and social withdrawal under increased workplace demands—features that can resemble a depressive syndrome—she does not endorse sustained depressed mood, pervasive anhedonia, or other symptoms meeting criteria for a major depressive episode; her enjoyment and motivation remain robust for preferred activities and symptoms fluctuate with environmental overload and routine disruption.",
    "symptom_checklist": {
      "A1_social_emotional_reciprocity_deficit": "present",
      "A2_nonverbal_communication_deficit": "present",
      "A3_relationship_deficits": "present",
      "B1_repetitive_motor_or_speech_or_objects": "present",
      "B2_insistence_on_sameness_inflexibility_routines": "present",
      "B3_highly_restricted_fixated_interests": "present",
      "B4_sensory_hyper_hyporeactivity": "present",
      "C_onset_early_development": "present",
      "D_clinically_significant_impairment": "present",
      "E_not_better_explained_by_intellectual_disability": "present",
      "MDD_depressed_mood_most_of_day_nearly_every_day_2w": "absent",
      "MDD_markedly_diminished_interest_or_pleasure_2w": "absent",
      "MDD_suicidal_ideation": "absent"
    }
  }
]